Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
#ifndef STM32F7X6_H
#define STM32F7X6_H

#ifdef __cplusplus
extern "C" {
#endif


#ifdef __cplusplus
  #define   __I     volatile        
#else
  #define   __I     volatile const  
#endif
#define     __O     volatile        
#define     __IO    volatile        

#define     __IM     volatile const 
#define     __OM     volatile       
#define     __IOM    volatile       

typedef unsigned long uint32;

/* =========================================================================================================================== */
/* ================                                            RNG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Random number generator (RNG)
  */

typedef struct {                                /*!< (@ 0x50060800) RNG Structure                                              */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register                                           */
    
    struct {
            uint32            : 2;
      __IOM uint32 RNGEN      : 1;            /*!< [2..2] Random number generator enable                                     */
      __IOM uint32 IE         : 1;            /*!< [3..3] Interrupt enable                                                   */
            uint32            : 28;
    } bit;
  } CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) status register                                            */
    
    struct {
      __IM  uint32 DRDY       : 1;            /*!< [0..0] Data ready                                                         */
      __IM  uint32 CECS       : 1;            /*!< [1..1] Clock error current status                                         */
      __IM  uint32 SECS       : 1;            /*!< [2..2] Seed error current status                                          */
            uint32            : 2;
      __IOM uint32 CEIS       : 1;            /*!< [5..5] Clock error interrupt status                                       */
      __IOM uint32 SEIS       : 1;            /*!< [6..6] Seed error interrupt status                                        */
            uint32            : 25;
    } bit;
  } SR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000008) data register                                              */
    
    struct {
      __IM  uint32 RNDATA     : 32;           /*!< [31..0] Random data                                                       */
    } bit;
  } DR;
} RNG_Type;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           HASH                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Hash processor (HASH)
  */

typedef struct {                                /*!< (@ 0x50060400) HASH Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register                                           */
    
    struct {
            uint32            : 2;
      __OM  uint32 INIT       : 1;            /*!< [2..2] Initialize message digest calculation                              */
      __IOM uint32 DMAE       : 1;            /*!< [3..3] DMA enable                                                         */
      __IOM uint32 DATATYPE   : 2;            /*!< [5..4] Data type selection                                                */
      __IOM uint32 MODE       : 1;            /*!< [6..6] Mode selection                                                     */
      __IOM uint32 ALGO0      : 1;            /*!< [7..7] Algorithm selection                                                */
      __IM  uint32 NBW        : 4;            /*!< [11..8] Number of words already pushed                                    */
      __IM  uint32 DINNE      : 1;            /*!< [12..12] DIN not empty                                                    */
      __IOM uint32 MDMAT      : 1;            /*!< [13..13] Multiple DMA Transfers                                           */
            uint32            : 2;
      __IOM uint32 LKEY       : 1;            /*!< [16..16] Long key selection                                               */
            uint32            : 1;
      __IOM uint32 ALGO1      : 1;            /*!< [18..18] ALGO                                                             */
            uint32            : 13;
    } bit;
  } CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) data input register                                        */
    
    struct {
      __IOM uint32 DATAIN     : 32;           /*!< [31..0] Data input                                                        */
    } bit;
  } DIN;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) start register                                             */
    
    struct {
      __IOM uint32 NBLW       : 5;            /*!< [4..0] Number of valid bits in the last word of the message               */
            uint32            : 3;
      __OM  uint32 DCAL       : 1;            /*!< [8..8] Digest calculation                                                 */
            uint32            : 23;
    } bit;
  } STR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000000C) digest registers                                           */
    
    struct {
      __IM  uint32 H0         : 32;           /*!< [31..0] H0                                                                */
    } bit;
  } HR0;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000010) digest registers                                           */
    
