Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 H1         : 32;           /*!< [31..0] H1                                                                */
    } bit;
  } HR1;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000014) digest registers                                           */
    
    struct {
      __IM  uint32 H2         : 32;           /*!< [31..0] H2                                                                */
    } bit;
  } HR2;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000018) digest registers                                           */
    
    struct {
      __IM  uint32 H3         : 32;           /*!< [31..0] H3                                                                */
    } bit;
  } HR3;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000001C) digest registers                                           */
    
    struct {
      __IM  uint32 H4         : 32;           /*!< [31..0] H4                                                                */
    } bit;
  } HR4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) interrupt enable register                                  */
    
    struct {
      __IOM uint32 DINIE      : 1;            /*!< [0..0] Data input interrupt enable                                        */
      __IOM uint32 DCIE       : 1;            /*!< [1..1] Digest calculation completion interrupt enable                     */
            uint32            : 30;
    } bit;
  } IMR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) status register                                            */
    
    struct {
      __IOM uint32 DINIS      : 1;            /*!< [0..0] Data input interrupt status                                        */
      __IOM uint32 DCIS       : 1;            /*!< [1..1] Digest calculation completion interrupt status                     */
      __IM  uint32 DMAS       : 1;            /*!< [2..2] DMA Status                                                         */
      __IM  uint32 BUSY       : 1;            /*!< [3..3] Busy bit                                                           */
            uint32            : 28;
    } bit;
  } SR;
  __IM  uint32  RESERVED[52];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000F8) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR0       : 32;           /*!< [31..0] CSR0                                                              */
    } bit;
  } CSR0;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000FC) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR1       : 32;           /*!< [31..0] CSR1                                                              */
    } bit;
  } CSR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000100) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR2       : 32;           /*!< [31..0] CSR2                                                              */
    } bit;
  } CSR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000104) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR3       : 32;           /*!< [31..0] CSR3                                                              */
    } bit;
  } CSR3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000108) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR4       : 32;           /*!< [31..0] CSR4                                                              */
    } bit;
  } CSR4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000010C) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR5       : 32;           /*!< [31..0] CSR5                                                              */
    } bit;
  } CSR5;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000110) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR6       : 32;           /*!< [31..0] CSR6                                                              */
    } bit;
  } CSR6;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000114) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR7       : 32;           /*!< [31..0] CSR7                                                              */
    } bit;
  } CSR7;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000118) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR8       : 32;           /*!< [31..0] CSR8                                                              */
    } bit;
  } CSR8;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000011C) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR9       : 32;           /*!< [31..0] CSR9                                                              */
    } bit;
  } CSR9;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000120) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR10      : 32;           /*!< [31..0] CSR10                                                             */
    } bit;
  } CSR10;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000124) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR11      : 32;           /*!< [31..0] CSR11                                                             */
    } bit;
  } CSR11;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000128) context swap registers                                     */
    
