Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 CSR12      : 32;           /*!< [31..0] CSR12                                                             */
    } bit;
  } CSR12;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000012C) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR13      : 32;           /*!< [31..0] CSR13                                                             */
    } bit;
  } CSR13;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000130) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR14      : 32;           /*!< [31..0] CSR14                                                             */
    } bit;
  } CSR14;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000134) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR15      : 32;           /*!< [31..0] CSR15                                                             */
    } bit;
  } CSR15;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000138) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR16      : 32;           /*!< [31..0] CSR16                                                             */
    } bit;
  } CSR16;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000013C) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR17      : 32;           /*!< [31..0] CSR17                                                             */
    } bit;
  } CSR17;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000140) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR18      : 32;           /*!< [31..0] CSR18                                                             */
    } bit;
  } CSR18;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000144) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR19      : 32;           /*!< [31..0] CSR19                                                             */
    } bit;
  } CSR19;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000148) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR20      : 32;           /*!< [31..0] CSR20                                                             */
    } bit;
  } CSR20;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000014C) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR21      : 32;           /*!< [31..0] CSR21                                                             */
    } bit;
  } CSR21;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000150) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR22      : 32;           /*!< [31..0] CSR22                                                             */
    } bit;
  } CSR22;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000154) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR23      : 32;           /*!< [31..0] CSR23                                                             */
    } bit;
  } CSR23;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000158) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR24      : 32;           /*!< [31..0] CSR24                                                             */
    } bit;
  } CSR24;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000015C) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR25      : 32;           /*!< [31..0] CSR25                                                             */
    } bit;
  } CSR25;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000160) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR26      : 32;           /*!< [31..0] CSR26                                                             */
    } bit;
  } CSR26;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000164) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR27      : 32;           /*!< [31..0] CSR27                                                             */
    } bit;
  } CSR27;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000168) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR28      : 32;           /*!< [31..0] CSR28                                                             */
    } bit;
  } CSR28;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000016C) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR29      : 32;           /*!< [31..0] CSR29                                                             */
    } bit;
  } CSR29;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000170) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR30      : 32;           /*!< [31..0] CSR30                                                             */
    } bit;
  } CSR30;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000174) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR31      : 32;           /*!< [31..0] CSR31                                                             */
    } bit;
  } CSR31;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000178) context swap registers                                     */
    
