Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 CSR32      : 32;           /*!< [31..0] CSR32                                                             */
    } bit;
  } CSR32;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000017C) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR33      : 32;           /*!< [31..0] CSR33                                                             */
    } bit;
  } CSR33;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000180) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR34      : 32;           /*!< [31..0] CSR34                                                             */
    } bit;
  } CSR34;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000184) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR35      : 32;           /*!< [31..0] CSR35                                                             */
    } bit;
  } CSR35;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000188) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR36      : 32;           /*!< [31..0] CSR36                                                             */
    } bit;
  } CSR36;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000018C) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR37      : 32;           /*!< [31..0] CSR37                                                             */
    } bit;
  } CSR37;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000190) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR38      : 32;           /*!< [31..0] CSR38                                                             */
    } bit;
  } CSR38;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000194) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR39      : 32;           /*!< [31..0] CSR39                                                             */
    } bit;
  } CSR39;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000198) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR40      : 32;           /*!< [31..0] CSR40                                                             */
    } bit;
  } CSR40;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000019C) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR41      : 32;           /*!< [31..0] CSR41                                                             */
    } bit;
  } CSR41;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001A0) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR42      : 32;           /*!< [31..0] CSR42                                                             */
    } bit;
  } CSR42;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001A4) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR43      : 32;           /*!< [31..0] CSR43                                                             */
    } bit;
  } CSR43;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001A8) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR44      : 32;           /*!< [31..0] CSR44                                                             */
    } bit;
  } CSR44;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001AC) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR45      : 32;           /*!< [31..0] CSR45                                                             */
    } bit;
  } CSR45;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001B0) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR46      : 32;           /*!< [31..0] CSR46                                                             */
    } bit;
  } CSR46;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001B4) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR47      : 32;           /*!< [31..0] CSR47                                                             */
    } bit;
  } CSR47;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001B8) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR48      : 32;           /*!< [31..0] CSR48                                                             */
    } bit;
  } CSR48;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001BC) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR49      : 32;           /*!< [31..0] CSR49                                                             */
    } bit;
  } CSR49;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001C0) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR50      : 32;           /*!< [31..0] CSR50                                                             */
    } bit;
  } CSR50;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001C4) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR51      : 32;           /*!< [31..0] CSR51                                                             */
    } bit;
  } CSR51;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001C8) context swap registers                                     */
    
