Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 CSR52      : 32;           /*!< [31..0] CSR52                                                             */
    } bit;
  } CSR52;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001CC) context swap registers                                     */
    
    struct {
      __IOM uint32 CSR53      : 32;           /*!< [31..0] CSR53                                                             */
    } bit;
  } CSR53;
  __IM  uint32  RESERVED1[80];
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000310) HASH digest register                                       */
    
    struct {
      __IM  uint32 H0         : 32;           /*!< [31..0] H0                                                                */
    } bit;
  } HASH_HR0;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000314) read-only                                                  */
    
    struct {
      __IM  uint32 H1         : 32;           /*!< [31..0] H1                                                                */
    } bit;
  } HASH_HR1;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000318) read-only                                                  */
    
    struct {
      __IM  uint32 H2         : 32;           /*!< [31..0] H2                                                                */
    } bit;
  } HASH_HR2;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000031C) read-only                                                  */
    
    struct {
      __IM  uint32 H3         : 32;           /*!< [31..0] H3                                                                */
    } bit;
  } HASH_HR3;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000320) read-only                                                  */
    
    struct {
      __IM  uint32 H4         : 32;           /*!< [31..0] H4                                                                */
    } bit;
  } HASH_HR4;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000324) read-only                                                  */
    
    struct {
      __IM  uint32 H5         : 32;           /*!< [31..0] H5                                                                */
    } bit;
  } HASH_HR5;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000328) read-only                                                  */
    
    struct {
      __IM  uint32 H6         : 32;           /*!< [31..0] H6                                                                */
    } bit;
  } HASH_HR6;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000032C) read-only                                                  */
    
    struct {
      __IM  uint32 H7         : 32;           /*!< [31..0] H7                                                                */
    } bit;
  } HASH_HR7;
} HASH_Type;                                    /*!< Size = 816 (0x330)                                                        */



/* =========================================================================================================================== */
/* ================                                           CRYP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Cryptographic processor (CRYP)
  */

typedef struct {                                /*!< (@ 0x50060000) CRYP Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register                                           */
    
    struct {
            uint32            : 2;
      __IOM uint32 ALGODIR    : 1;            /*!< [2..2] Algorithm direction                                                */
      __IOM uint32 ALGOMODE0  : 3;            /*!< [5..3] Algorithm mode                                                     */
      __IOM uint32 DATATYPE   : 2;            /*!< [7..6] Data type selection                                                */
      __IOM uint32 KEYSIZE    : 2;            /*!< [9..8] Key size selection (AES mode only)                                 */
            uint32            : 4;
      __OM  uint32 FFLUSH     : 1;            /*!< [14..14] FIFO flush                                                       */
      __IOM uint32 CRYPEN     : 1;            /*!< [15..15] Cryptographic processor enable                                   */
      __IOM uint32 GCM_CCMPH  : 2;            /*!< [17..16] GCM_CCMPH                                                        */
            uint32            : 1;
      __IOM uint32 ALGOMODE3  : 1;            /*!< [19..19] ALGOMODE                                                         */
            uint32            : 12;
    } bit;
  } CR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000004) status register                                            */
    
    struct {
      __IM  uint32 IFEM       : 1;            /*!< [0..0] Input FIFO empty                                                   */
      __IM  uint32 IFNF       : 1;            /*!< [1..1] Input FIFO not full                                                */
      __IM  uint32 OFNE       : 1;            /*!< [2..2] Output FIFO not empty                                              */
      __IM  uint32 OFFU       : 1;            /*!< [3..3] Output FIFO full                                                   */
      __IM  uint32 BUSY       : 1;            /*!< [4..4] Busy bit                                                           */
            uint32            : 27;
    } bit;
  } SR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) data input register                                        */
    
