Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 DATAIN     : 32;           /*!< [31..0] Data input                                                        */
    } bit;
  } DIN;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000000C) data output register                                       */
    
    struct {
      __IM  uint32 DATAOUT    : 32;           /*!< [31..0] Data output                                                       */
    } bit;
  } DOUT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) DMA control register                                       */
    
    struct {
      __IOM uint32 DIEN       : 1;            /*!< [0..0] DMA input enable                                                   */
      __IOM uint32 DOEN       : 1;            /*!< [1..1] DMA output enable                                                  */
            uint32            : 30;
    } bit;
  } DMACR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) interrupt mask set/clear register                          */
    
    struct {
      __IOM uint32 INIM       : 1;            /*!< [0..0] Input FIFO service interrupt mask                                  */
      __IOM uint32 OUTIM      : 1;            /*!< [1..1] Output FIFO service interrupt mask                                 */
            uint32            : 30;
    } bit;
  } IMSCR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000018) raw interrupt status register                              */
    
    struct {
      __IM  uint32 INRIS      : 1;            /*!< [0..0] Input FIFO service raw interrupt status                            */
      __IM  uint32 OUTRIS     : 1;            /*!< [1..1] Output FIFO service raw interrupt status                           */
            uint32            : 30;
    } bit;
  } RISR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000001C) masked interrupt status register                           */
    
    struct {
      __IM  uint32 INMIS      : 1;            /*!< [0..0] Input FIFO service masked interrupt status                         */
      __IM  uint32 OUTMIS     : 1;            /*!< [1..1] Output FIFO service masked interrupt status                        */
            uint32            : 30;
    } bit;
  } MISR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000020) key registers                                              */
    
    struct {
      __OM  uint32 b224       : 1;            /*!< [0..0] b224                                                               */
      __OM  uint32 b225       : 1;            /*!< [1..1] b225                                                               */
      __OM  uint32 b226       : 1;            /*!< [2..2] b226                                                               */
      __OM  uint32 b227       : 1;            /*!< [3..3] b227                                                               */
      __OM  uint32 b228       : 1;            /*!< [4..4] b228                                                               */
      __OM  uint32 b229       : 1;            /*!< [5..5] b229                                                               */
      __OM  uint32 b230       : 1;            /*!< [6..6] b230                                                               */
      __OM  uint32 b231       : 1;            /*!< [7..7] b231                                                               */
      __OM  uint32 b232       : 1;            /*!< [8..8] b232                                                               */
      __OM  uint32 b233       : 1;            /*!< [9..9] b233                                                               */
      __OM  uint32 b234       : 1;            /*!< [10..10] b234                                                             */
      __OM  uint32 b235       : 1;            /*!< [11..11] b235                                                             */
      __OM  uint32 b236       : 1;            /*!< [12..12] b236                                                             */
      __OM  uint32 b237       : 1;            /*!< [13..13] b237                                                             */
      __OM  uint32 b238       : 1;            /*!< [14..14] b238                                                             */
      __OM  uint32 b239       : 1;            /*!< [15..15] b239                                                             */
      __OM  uint32 b240       : 1;            /*!< [16..16] b240                                                             */
      __OM  uint32 b241       : 1;            /*!< [17..17] b241                                                             */
      __OM  uint32 b242       : 1;            /*!< [18..18] b242                                                             */
      __OM  uint32 b243       : 1;            /*!< [19..19] b243                                                             */
      __OM  uint32 b244       : 1;            /*!< [20..20] b244                                                             */
      __OM  uint32 b245       : 1;            /*!< [21..21] b245                                                             */
      __OM  uint32 b246       : 1;            /*!< [22..22] b246                                                             */
      __OM  uint32 b247       : 1;            /*!< [23..23] b247                                                             */
      __OM  uint32 b248       : 1;            /*!< [24..24] b248                                                             */
      __OM  uint32 b249       : 1;            /*!< [25..25] b249                                                             */
      __OM  uint32 b250       : 1;            /*!< [26..26] b250                                                             */
      __OM  uint32 b251       : 1;            /*!< [27..27] b251                                                             */
      __OM  uint32 b252       : 1;            /*!< [28..28] b252                                                             */
      __OM  uint32 b253       : 1;            /*!< [29..29] b253                                                             */
      __OM  uint32 b254       : 1;            /*!< [30..30] b254                                                             */
      __OM  uint32 b255       : 1;            /*!< [31..31] b255                                                             */
    } bit;
  } K0LR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000024) key registers                                              */
    
