Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __OM  uint32 b192       : 1;            /*!< [0..0] b192                                                               */
      __OM  uint32 b193       : 1;            /*!< [1..1] b193                                                               */
      __OM  uint32 b194       : 1;            /*!< [2..2] b194                                                               */
      __OM  uint32 b195       : 1;            /*!< [3..3] b195                                                               */
      __OM  uint32 b196       : 1;            /*!< [4..4] b196                                                               */
      __OM  uint32 b197       : 1;            /*!< [5..5] b197                                                               */
      __OM  uint32 b198       : 1;            /*!< [6..6] b198                                                               */
      __OM  uint32 b199       : 1;            /*!< [7..7] b199                                                               */
      __OM  uint32 b200       : 1;            /*!< [8..8] b200                                                               */
      __OM  uint32 b201       : 1;            /*!< [9..9] b201                                                               */
      __OM  uint32 b202       : 1;            /*!< [10..10] b202                                                             */
      __OM  uint32 b203       : 1;            /*!< [11..11] b203                                                             */
      __OM  uint32 b204       : 1;            /*!< [12..12] b204                                                             */
      __OM  uint32 b205       : 1;            /*!< [13..13] b205                                                             */
      __OM  uint32 b206       : 1;            /*!< [14..14] b206                                                             */
      __OM  uint32 b207       : 1;            /*!< [15..15] b207                                                             */
      __OM  uint32 b208       : 1;            /*!< [16..16] b208                                                             */
      __OM  uint32 b209       : 1;            /*!< [17..17] b209                                                             */
      __OM  uint32 b210       : 1;            /*!< [18..18] b210                                                             */
      __OM  uint32 b211       : 1;            /*!< [19..19] b211                                                             */
      __OM  uint32 b212       : 1;            /*!< [20..20] b212                                                             */
      __OM  uint32 b213       : 1;            /*!< [21..21] b213                                                             */
      __OM  uint32 b214       : 1;            /*!< [22..22] b214                                                             */
      __OM  uint32 b215       : 1;            /*!< [23..23] b215                                                             */
      __OM  uint32 b216       : 1;            /*!< [24..24] b216                                                             */
      __OM  uint32 b217       : 1;            /*!< [25..25] b217                                                             */
      __OM  uint32 b218       : 1;            /*!< [26..26] b218                                                             */
      __OM  uint32 b219       : 1;            /*!< [27..27] b219                                                             */
      __OM  uint32 b220       : 1;            /*!< [28..28] b220                                                             */
      __OM  uint32 b221       : 1;            /*!< [29..29] b221                                                             */
      __OM  uint32 b222       : 1;            /*!< [30..30] b222                                                             */
      __OM  uint32 b223       : 1;            /*!< [31..31] b223                                                             */
    } bit;
  } K0RR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000028) key registers                                              */
    
    struct {
      __OM  uint32 b160       : 1;            /*!< [0..0] b160                                                               */
      __OM  uint32 b161       : 1;            /*!< [1..1] b161                                                               */
      __OM  uint32 b162       : 1;            /*!< [2..2] b162                                                               */
      __OM  uint32 b163       : 1;            /*!< [3..3] b163                                                               */
      __OM  uint32 b164       : 1;            /*!< [4..4] b164                                                               */
      __OM  uint32 b165       : 1;            /*!< [5..5] b165                                                               */
      __OM  uint32 b166       : 1;            /*!< [6..6] b166                                                               */
      __OM  uint32 b167       : 1;            /*!< [7..7] b167                                                               */
      __OM  uint32 b168       : 1;            /*!< [8..8] b168                                                               */
      __OM  uint32 b169       : 1;            /*!< [9..9] b169                                                               */
      __OM  uint32 b170       : 1;            /*!< [10..10] b170                                                             */
      __OM  uint32 b171       : 1;            /*!< [11..11] b171                                                             */
      __OM  uint32 b172       : 1;            /*!< [12..12] b172                                                             */
      __OM  uint32 b173       : 1;            /*!< [13..13] b173                                                             */
      __OM  uint32 b174       : 1;            /*!< [14..14] b174                                                             */
      __OM  uint32 b175       : 1;            /*!< [15..15] b175                                                             */
      __OM  uint32 b176       : 1;            /*!< [16..16] b176                                                             */
      __OM  uint32 b177       : 1;            /*!< [17..17] b177                                                             */
      __OM  uint32 b178       : 1;            /*!< [18..18] b178                                                             */
      __OM  uint32 b179       : 1;            /*!< [19..19] b179                                                             */
      __OM  uint32 b180       : 1;            /*!< [20..20] b180                                                             */
      __OM  uint32 b181       : 1;            /*!< [21..21] b181                                                             */
      __OM  uint32 b182       : 1;            /*!< [22..22] b182                                                             */
      __OM  uint32 b183       : 1;            /*!< [23..23] b183                                                             */
      __OM  uint32 b184       : 1;            /*!< [24..24] b184                                                             */
      __OM  uint32 b185       : 1;            /*!< [25..25] b185                                                             */
      __OM  uint32 b186       : 1;            /*!< [26..26] b186                                                             */
      __OM  uint32 b187       : 1;            /*!< [27..27] b187                                                             */
      __OM  uint32 b188       : 1;            /*!< [28..28] b188                                                             */
      __OM  uint32 b189       : 1;            /*!< [29..29] b189                                                             */
      __OM  uint32 b190       : 1;            /*!< [30..30] b190                                                             */
      __OM  uint32 b191       : 1;            /*!< [31..31] b191                                                             */
    } bit;
  } K1LR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x0000002C) key registers                                              */
    
