Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __OM  uint32 b128       : 1;            /*!< [0..0] b128                                                               */
      __OM  uint32 b129       : 1;            /*!< [1..1] b129                                                               */
      __OM  uint32 b130       : 1;            /*!< [2..2] b130                                                               */
      __OM  uint32 b131       : 1;            /*!< [3..3] b131                                                               */
      __OM  uint32 b132       : 1;            /*!< [4..4] b132                                                               */
      __OM  uint32 b133       : 1;            /*!< [5..5] b133                                                               */
      __OM  uint32 b134       : 1;            /*!< [6..6] b134                                                               */
      __OM  uint32 b135       : 1;            /*!< [7..7] b135                                                               */
      __OM  uint32 b136       : 1;            /*!< [8..8] b136                                                               */
      __OM  uint32 b137       : 1;            /*!< [9..9] b137                                                               */
      __OM  uint32 b138       : 1;            /*!< [10..10] b138                                                             */
      __OM  uint32 b139       : 1;            /*!< [11..11] b139                                                             */
      __OM  uint32 b140       : 1;            /*!< [12..12] b140                                                             */
      __OM  uint32 b141       : 1;            /*!< [13..13] b141                                                             */
      __OM  uint32 b142       : 1;            /*!< [14..14] b142                                                             */
      __OM  uint32 b143       : 1;            /*!< [15..15] b143                                                             */
      __OM  uint32 b144       : 1;            /*!< [16..16] b144                                                             */
      __OM  uint32 b145       : 1;            /*!< [17..17] b145                                                             */
      __OM  uint32 b146       : 1;            /*!< [18..18] b146                                                             */
      __OM  uint32 b147       : 1;            /*!< [19..19] b147                                                             */
      __OM  uint32 b148       : 1;            /*!< [20..20] b148                                                             */
      __OM  uint32 b149       : 1;            /*!< [21..21] b149                                                             */
      __OM  uint32 b150       : 1;            /*!< [22..22] b150                                                             */
      __OM  uint32 b151       : 1;            /*!< [23..23] b151                                                             */
      __OM  uint32 b152       : 1;            /*!< [24..24] b152                                                             */
      __OM  uint32 b153       : 1;            /*!< [25..25] b153                                                             */
      __OM  uint32 b154       : 1;            /*!< [26..26] b154                                                             */
      __OM  uint32 b155       : 1;            /*!< [27..27] b155                                                             */
      __OM  uint32 b156       : 1;            /*!< [28..28] b156                                                             */
      __OM  uint32 b157       : 1;            /*!< [29..29] b157                                                             */
      __OM  uint32 b158       : 1;            /*!< [30..30] b158                                                             */
      __OM  uint32 b159       : 1;            /*!< [31..31] b159                                                             */
    } bit;
  } K1RR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000030) key registers                                              */
    
    struct {
      __OM  uint32 b96        : 1;            /*!< [0..0] b96                                                                */
      __OM  uint32 b97        : 1;            /*!< [1..1] b97                                                                */
      __OM  uint32 b98        : 1;            /*!< [2..2] b98                                                                */
      __OM  uint32 b99        : 1;            /*!< [3..3] b99                                                                */
      __OM  uint32 b100       : 1;            /*!< [4..4] b100                                                               */
      __OM  uint32 b101       : 1;            /*!< [5..5] b101                                                               */
      __OM  uint32 b102       : 1;            /*!< [6..6] b102                                                               */
      __OM  uint32 b103       : 1;            /*!< [7..7] b103                                                               */
      __OM  uint32 b104       : 1;            /*!< [8..8] b104                                                               */
      __OM  uint32 b105       : 1;            /*!< [9..9] b105                                                               */
      __OM  uint32 b106       : 1;            /*!< [10..10] b106                                                             */
      __OM  uint32 b107       : 1;            /*!< [11..11] b107                                                             */
      __OM  uint32 b108       : 1;            /*!< [12..12] b108                                                             */
      __OM  uint32 b109       : 1;            /*!< [13..13] b109                                                             */
      __OM  uint32 b110       : 1;            /*!< [14..14] b110                                                             */
      __OM  uint32 b111       : 1;            /*!< [15..15] b111                                                             */
      __OM  uint32 b112       : 1;            /*!< [16..16] b112                                                             */
      __OM  uint32 b113       : 1;            /*!< [17..17] b113                                                             */
      __OM  uint32 b114       : 1;            /*!< [18..18] b114                                                             */
      __OM  uint32 b115       : 1;            /*!< [19..19] b115                                                             */
      __OM  uint32 b116       : 1;            /*!< [20..20] b116                                                             */
      __OM  uint32 b117       : 1;            /*!< [21..21] b117                                                             */
      __OM  uint32 b118       : 1;            /*!< [22..22] b118                                                             */
      __OM  uint32 b119       : 1;            /*!< [23..23] b119                                                             */
      __OM  uint32 b120       : 1;            /*!< [24..24] b120                                                             */
      __OM  uint32 b121       : 1;            /*!< [25..25] b121                                                             */
      __OM  uint32 b122       : 1;            /*!< [26..26] b122                                                             */
      __OM  uint32 b123       : 1;            /*!< [27..27] b123                                                             */
      __OM  uint32 b124       : 1;            /*!< [28..28] b124                                                             */
      __OM  uint32 b125       : 1;            /*!< [29..29] b125                                                             */
      __OM  uint32 b126       : 1;            /*!< [30..30] b126                                                             */
      __OM  uint32 b127       : 1;            /*!< [31..31] b127                                                             */
    } bit;
  } K2LR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000034) key registers                                              */
    
