Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __OM  uint32 b64        : 1;            /*!< [0..0] b64                                                                */
      __OM  uint32 b65        : 1;            /*!< [1..1] b65                                                                */
      __OM  uint32 b66        : 1;            /*!< [2..2] b66                                                                */
      __OM  uint32 b67        : 1;            /*!< [3..3] b67                                                                */
      __OM  uint32 b68        : 1;            /*!< [4..4] b68                                                                */
      __OM  uint32 b69        : 1;            /*!< [5..5] b69                                                                */
      __OM  uint32 b70        : 1;            /*!< [6..6] b70                                                                */
      __OM  uint32 b71        : 1;            /*!< [7..7] b71                                                                */
      __OM  uint32 b72        : 1;            /*!< [8..8] b72                                                                */
      __OM  uint32 b73        : 1;            /*!< [9..9] b73                                                                */
      __OM  uint32 b74        : 1;            /*!< [10..10] b74                                                              */
      __OM  uint32 b75        : 1;            /*!< [11..11] b75                                                              */
      __OM  uint32 b76        : 1;            /*!< [12..12] b76                                                              */
      __OM  uint32 b77        : 1;            /*!< [13..13] b77                                                              */
      __OM  uint32 b78        : 1;            /*!< [14..14] b78                                                              */
      __OM  uint32 b79        : 1;            /*!< [15..15] b79                                                              */
      __OM  uint32 b80        : 1;            /*!< [16..16] b80                                                              */
      __OM  uint32 b81        : 1;            /*!< [17..17] b81                                                              */
      __OM  uint32 b82        : 1;            /*!< [18..18] b82                                                              */
      __OM  uint32 b83        : 1;            /*!< [19..19] b83                                                              */
      __OM  uint32 b84        : 1;            /*!< [20..20] b84                                                              */
      __OM  uint32 b85        : 1;            /*!< [21..21] b85                                                              */
      __OM  uint32 b86        : 1;            /*!< [22..22] b86                                                              */
      __OM  uint32 b87        : 1;            /*!< [23..23] b87                                                              */
      __OM  uint32 b88        : 1;            /*!< [24..24] b88                                                              */
      __OM  uint32 b89        : 1;            /*!< [25..25] b89                                                              */
      __OM  uint32 b90        : 1;            /*!< [26..26] b90                                                              */
      __OM  uint32 b91        : 1;            /*!< [27..27] b91                                                              */
      __OM  uint32 b92        : 1;            /*!< [28..28] b92                                                              */
      __OM  uint32 b93        : 1;            /*!< [29..29] b93                                                              */
      __OM  uint32 b94        : 1;            /*!< [30..30] b94                                                              */
      __OM  uint32 b95        : 1;            /*!< [31..31] b95                                                              */
    } bit;
  } K2RR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000038) key registers                                              */
    
    struct {
      __OM  uint32 b32        : 1;            /*!< [0..0] b32                                                                */
      __OM  uint32 b33        : 1;            /*!< [1..1] b33                                                                */
      __OM  uint32 b34        : 1;            /*!< [2..2] b34                                                                */
      __OM  uint32 b35        : 1;            /*!< [3..3] b35                                                                */
      __OM  uint32 b36        : 1;            /*!< [4..4] b36                                                                */
      __OM  uint32 b37        : 1;            /*!< [5..5] b37                                                                */
      __OM  uint32 b38        : 1;            /*!< [6..6] b38                                                                */
      __OM  uint32 b39        : 1;            /*!< [7..7] b39                                                                */
      __OM  uint32 b40        : 1;            /*!< [8..8] b40                                                                */
      __OM  uint32 b41        : 1;            /*!< [9..9] b41                                                                */
      __OM  uint32 b42        : 1;            /*!< [10..10] b42                                                              */
      __OM  uint32 b43        : 1;            /*!< [11..11] b43                                                              */
      __OM  uint32 b44        : 1;            /*!< [12..12] b44                                                              */
      __OM  uint32 b45        : 1;            /*!< [13..13] b45                                                              */
      __OM  uint32 b46        : 1;            /*!< [14..14] b46                                                              */
      __OM  uint32 b47        : 1;            /*!< [15..15] b47                                                              */
      __OM  uint32 b48        : 1;            /*!< [16..16] b48                                                              */
      __OM  uint32 b49        : 1;            /*!< [17..17] b49                                                              */
      __OM  uint32 b50        : 1;            /*!< [18..18] b50                                                              */
      __OM  uint32 b51        : 1;            /*!< [19..19] b51                                                              */
      __OM  uint32 b52        : 1;            /*!< [20..20] b52                                                              */
      __OM  uint32 b53        : 1;            /*!< [21..21] b53                                                              */
      __OM  uint32 b54        : 1;            /*!< [22..22] b54                                                              */
      __OM  uint32 b55        : 1;            /*!< [23..23] b55                                                              */
      __OM  uint32 b56        : 1;            /*!< [24..24] b56                                                              */
      __OM  uint32 b57        : 1;            /*!< [25..25] b57                                                              */
      __OM  uint32 b58        : 1;            /*!< [26..26] b58                                                              */
      __OM  uint32 b59        : 1;            /*!< [27..27] b59                                                              */
      __OM  uint32 b60        : 1;            /*!< [28..28] b60                                                              */
      __OM  uint32 b61        : 1;            /*!< [29..29] b61                                                              */
      __OM  uint32 b62        : 1;            /*!< [30..30] b62                                                              */
      __OM  uint32 b63        : 1;            /*!< [31..31] b63                                                              */
    } bit;
  } K3LR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x0000003C) key registers                                              */
    
