Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __OM  uint32 b0         : 1;            /*!< [0..0] b0                                                                 */
      __OM  uint32 b1         : 1;            /*!< [1..1] b1                                                                 */
      __OM  uint32 b2         : 1;            /*!< [2..2] b2                                                                 */
      __OM  uint32 b3         : 1;            /*!< [3..3] b3                                                                 */
      __OM  uint32 b4         : 1;            /*!< [4..4] b4                                                                 */
      __OM  uint32 b5         : 1;            /*!< [5..5] b5                                                                 */
      __OM  uint32 b6         : 1;            /*!< [6..6] b6                                                                 */
      __OM  uint32 b7         : 1;            /*!< [7..7] b7                                                                 */
      __OM  uint32 b8         : 1;            /*!< [8..8] b8                                                                 */
      __OM  uint32 b9         : 1;            /*!< [9..9] b9                                                                 */
      __OM  uint32 b10        : 1;            /*!< [10..10] b10                                                              */
      __OM  uint32 b11        : 1;            /*!< [11..11] b11                                                              */
      __OM  uint32 b12        : 1;            /*!< [12..12] b12                                                              */
      __OM  uint32 b13        : 1;            /*!< [13..13] b13                                                              */
      __OM  uint32 b14        : 1;            /*!< [14..14] b14                                                              */
      __OM  uint32 b15        : 1;            /*!< [15..15] b15                                                              */
      __OM  uint32 b16        : 1;            /*!< [16..16] b16                                                              */
      __OM  uint32 b17        : 1;            /*!< [17..17] b17                                                              */
      __OM  uint32 b18        : 1;            /*!< [18..18] b18                                                              */
      __OM  uint32 b19        : 1;            /*!< [19..19] b19                                                              */
      __OM  uint32 b20        : 1;            /*!< [20..20] b20                                                              */
      __OM  uint32 b21        : 1;            /*!< [21..21] b21                                                              */
      __OM  uint32 b22        : 1;            /*!< [22..22] b22                                                              */
      __OM  uint32 b23        : 1;            /*!< [23..23] b23                                                              */
      __OM  uint32 b24        : 1;            /*!< [24..24] b24                                                              */
      __OM  uint32 b25        : 1;            /*!< [25..25] b25                                                              */
      __OM  uint32 b26        : 1;            /*!< [26..26] b26                                                              */
      __OM  uint32 b27        : 1;            /*!< [27..27] b27                                                              */
      __OM  uint32 b28        : 1;            /*!< [28..28] b28                                                              */
      __OM  uint32 b29        : 1;            /*!< [29..29] b29                                                              */
      __OM  uint32 b30        : 1;            /*!< [30..30] b30                                                              */
      __OM  uint32 b31        : 1;            /*!< [31..31] b31                                                              */
    } bit;
  } K3RR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000040) initialization vector registers                            */
    
    struct {
      __IOM uint32 IV31       : 1;            /*!< [0..0] IV31                                                               */
      __IOM uint32 IV30       : 1;            /*!< [1..1] IV30                                                               */
      __IOM uint32 IV29       : 1;            /*!< [2..2] IV29                                                               */
      __IOM uint32 IV28       : 1;            /*!< [3..3] IV28                                                               */
      __IOM uint32 IV27       : 1;            /*!< [4..4] IV27                                                               */
      __IOM uint32 IV26       : 1;            /*!< [5..5] IV26                                                               */
      __IOM uint32 IV25       : 1;            /*!< [6..6] IV25                                                               */
      __IOM uint32 IV24       : 1;            /*!< [7..7] IV24                                                               */
      __IOM uint32 IV23       : 1;            /*!< [8..8] IV23                                                               */
      __IOM uint32 IV22       : 1;            /*!< [9..9] IV22                                                               */
      __IOM uint32 IV21       : 1;            /*!< [10..10] IV21                                                             */
      __IOM uint32 IV20       : 1;            /*!< [11..11] IV20                                                             */
      __IOM uint32 IV19       : 1;            /*!< [12..12] IV19                                                             */
      __IOM uint32 IV18       : 1;            /*!< [13..13] IV18                                                             */
      __IOM uint32 IV17       : 1;            /*!< [14..14] IV17                                                             */
      __IOM uint32 IV16       : 1;            /*!< [15..15] IV16                                                             */
      __IOM uint32 IV15       : 1;            /*!< [16..16] IV15                                                             */
      __IOM uint32 IV14       : 1;            /*!< [17..17] IV14                                                             */
      __IOM uint32 IV13       : 1;            /*!< [18..18] IV13                                                             */
      __IOM uint32 IV12       : 1;            /*!< [19..19] IV12                                                             */
      __IOM uint32 IV11       : 1;            /*!< [20..20] IV11                                                             */
      __IOM uint32 IV10       : 1;            /*!< [21..21] IV10                                                             */
      __IOM uint32 IV9        : 1;            /*!< [22..22] IV9                                                              */
      __IOM uint32 IV8        : 1;            /*!< [23..23] IV8                                                              */
      __IOM uint32 IV7        : 1;            /*!< [24..24] IV7                                                              */
      __IOM uint32 IV6        : 1;            /*!< [25..25] IV6                                                              */
      __IOM uint32 IV5        : 1;            /*!< [26..26] IV5                                                              */
      __IOM uint32 IV4        : 1;            /*!< [27..27] IV4                                                              */
      __IOM uint32 IV3        : 1;            /*!< [28..28] IV3                                                              */
      __IOM uint32 IV2        : 1;            /*!< [29..29] IV2                                                              */
      __IOM uint32 IV1        : 1;            /*!< [30..30] IV1                                                              */
      __IOM uint32 IV0        : 1;            /*!< [31..31] IV0                                                              */
    } bit;
  } IV0LR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000044) initialization vector registers                            */
    
