Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 IV63       : 1;            /*!< [0..0] IV63                                                               */
      __IOM uint32 IV62       : 1;            /*!< [1..1] IV62                                                               */
      __IOM uint32 IV61       : 1;            /*!< [2..2] IV61                                                               */
      __IOM uint32 IV60       : 1;            /*!< [3..3] IV60                                                               */
      __IOM uint32 IV59       : 1;            /*!< [4..4] IV59                                                               */
      __IOM uint32 IV58       : 1;            /*!< [5..5] IV58                                                               */
      __IOM uint32 IV57       : 1;            /*!< [6..6] IV57                                                               */
      __IOM uint32 IV56       : 1;            /*!< [7..7] IV56                                                               */
      __IOM uint32 IV55       : 1;            /*!< [8..8] IV55                                                               */
      __IOM uint32 IV54       : 1;            /*!< [9..9] IV54                                                               */
      __IOM uint32 IV53       : 1;            /*!< [10..10] IV53                                                             */
      __IOM uint32 IV52       : 1;            /*!< [11..11] IV52                                                             */
      __IOM uint32 IV51       : 1;            /*!< [12..12] IV51                                                             */
      __IOM uint32 IV50       : 1;            /*!< [13..13] IV50                                                             */
      __IOM uint32 IV49       : 1;            /*!< [14..14] IV49                                                             */
      __IOM uint32 IV48       : 1;            /*!< [15..15] IV48                                                             */
      __IOM uint32 IV47       : 1;            /*!< [16..16] IV47                                                             */
      __IOM uint32 IV46       : 1;            /*!< [17..17] IV46                                                             */
      __IOM uint32 IV45       : 1;            /*!< [18..18] IV45                                                             */
      __IOM uint32 IV44       : 1;            /*!< [19..19] IV44                                                             */
      __IOM uint32 IV43       : 1;            /*!< [20..20] IV43                                                             */
      __IOM uint32 IV42       : 1;            /*!< [21..21] IV42                                                             */
      __IOM uint32 IV41       : 1;            /*!< [22..22] IV41                                                             */
      __IOM uint32 IV40       : 1;            /*!< [23..23] IV40                                                             */
      __IOM uint32 IV39       : 1;            /*!< [24..24] IV39                                                             */
      __IOM uint32 IV38       : 1;            /*!< [25..25] IV38                                                             */
      __IOM uint32 IV37       : 1;            /*!< [26..26] IV37                                                             */
      __IOM uint32 IV36       : 1;            /*!< [27..27] IV36                                                             */
      __IOM uint32 IV35       : 1;            /*!< [28..28] IV35                                                             */
      __IOM uint32 IV34       : 1;            /*!< [29..29] IV34                                                             */
      __IOM uint32 IV33       : 1;            /*!< [30..30] IV33                                                             */
      __IOM uint32 IV32       : 1;            /*!< [31..31] IV32                                                             */
    } bit;
  } IV0RR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000048) initialization vector registers                            */
    
    struct {
      __IOM uint32 IV95       : 1;            /*!< [0..0] IV95                                                               */
      __IOM uint32 IV94       : 1;            /*!< [1..1] IV94                                                               */
      __IOM uint32 IV93       : 1;            /*!< [2..2] IV93                                                               */
      __IOM uint32 IV92       : 1;            /*!< [3..3] IV92                                                               */
      __IOM uint32 IV91       : 1;            /*!< [4..4] IV91                                                               */
      __IOM uint32 IV90       : 1;            /*!< [5..5] IV90                                                               */
      __IOM uint32 IV89       : 1;            /*!< [6..6] IV89                                                               */
      __IOM uint32 IV88       : 1;            /*!< [7..7] IV88                                                               */
      __IOM uint32 IV87       : 1;            /*!< [8..8] IV87                                                               */
      __IOM uint32 IV86       : 1;            /*!< [9..9] IV86                                                               */
      __IOM uint32 IV85       : 1;            /*!< [10..10] IV85                                                             */
      __IOM uint32 IV84       : 1;            /*!< [11..11] IV84                                                             */
      __IOM uint32 IV83       : 1;            /*!< [12..12] IV83                                                             */
      __IOM uint32 IV82       : 1;            /*!< [13..13] IV82                                                             */
      __IOM uint32 IV81       : 1;            /*!< [14..14] IV81                                                             */
      __IOM uint32 IV80       : 1;            /*!< [15..15] IV80                                                             */
      __IOM uint32 IV79       : 1;            /*!< [16..16] IV79                                                             */
      __IOM uint32 IV78       : 1;            /*!< [17..17] IV78                                                             */
      __IOM uint32 IV77       : 1;            /*!< [18..18] IV77                                                             */
      __IOM uint32 IV76       : 1;            /*!< [19..19] IV76                                                             */
      __IOM uint32 IV75       : 1;            /*!< [20..20] IV75                                                             */
      __IOM uint32 IV74       : 1;            /*!< [21..21] IV74                                                             */
      __IOM uint32 IV73       : 1;            /*!< [22..22] IV73                                                             */
      __IOM uint32 IV72       : 1;            /*!< [23..23] IV72                                                             */
      __IOM uint32 IV71       : 1;            /*!< [24..24] IV71                                                             */
      __IOM uint32 IV70       : 1;            /*!< [25..25] IV70                                                             */
      __IOM uint32 IV69       : 1;            /*!< [26..26] IV69                                                             */
      __IOM uint32 IV68       : 1;            /*!< [27..27] IV68                                                             */
      __IOM uint32 IV67       : 1;            /*!< [28..28] IV67                                                             */
      __IOM uint32 IV66       : 1;            /*!< [29..29] IV66                                                             */
      __IOM uint32 IV65       : 1;            /*!< [30..30] IV65                                                             */
      __IOM uint32 IV64       : 1;            /*!< [31..31] IV64                                                             */
    } bit;
  } IV1LR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000004C) initialization vector registers                            */
    
