Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 IV127      : 1;            /*!< [0..0] IV127                                                              */
      __IOM uint32 IV126      : 1;            /*!< [1..1] IV126                                                              */
      __IOM uint32 IV125      : 1;            /*!< [2..2] IV125                                                              */
      __IOM uint32 IV124      : 1;            /*!< [3..3] IV124                                                              */
      __IOM uint32 IV123      : 1;            /*!< [4..4] IV123                                                              */
      __IOM uint32 IV122      : 1;            /*!< [5..5] IV122                                                              */
      __IOM uint32 IV121      : 1;            /*!< [6..6] IV121                                                              */
      __IOM uint32 IV120      : 1;            /*!< [7..7] IV120                                                              */
      __IOM uint32 IV119      : 1;            /*!< [8..8] IV119                                                              */
      __IOM uint32 IV118      : 1;            /*!< [9..9] IV118                                                              */
      __IOM uint32 IV117      : 1;            /*!< [10..10] IV117                                                            */
      __IOM uint32 IV116      : 1;            /*!< [11..11] IV116                                                            */
      __IOM uint32 IV115      : 1;            /*!< [12..12] IV115                                                            */
      __IOM uint32 IV114      : 1;            /*!< [13..13] IV114                                                            */
      __IOM uint32 IV113      : 1;            /*!< [14..14] IV113                                                            */
      __IOM uint32 IV112      : 1;            /*!< [15..15] IV112                                                            */
      __IOM uint32 IV111      : 1;            /*!< [16..16] IV111                                                            */
      __IOM uint32 IV110      : 1;            /*!< [17..17] IV110                                                            */
      __IOM uint32 IV109      : 1;            /*!< [18..18] IV109                                                            */
      __IOM uint32 IV108      : 1;            /*!< [19..19] IV108                                                            */
      __IOM uint32 IV107      : 1;            /*!< [20..20] IV107                                                            */
      __IOM uint32 IV106      : 1;            /*!< [21..21] IV106                                                            */
      __IOM uint32 IV105      : 1;            /*!< [22..22] IV105                                                            */
      __IOM uint32 IV104      : 1;            /*!< [23..23] IV104                                                            */
      __IOM uint32 IV103      : 1;            /*!< [24..24] IV103                                                            */
      __IOM uint32 IV102      : 1;            /*!< [25..25] IV102                                                            */
      __IOM uint32 IV101      : 1;            /*!< [26..26] IV101                                                            */
      __IOM uint32 IV100      : 1;            /*!< [27..27] IV100                                                            */
      __IOM uint32 IV99       : 1;            /*!< [28..28] IV99                                                             */
      __IOM uint32 IV98       : 1;            /*!< [29..29] IV98                                                             */
      __IOM uint32 IV97       : 1;            /*!< [30..30] IV97                                                             */
      __IOM uint32 IV96       : 1;            /*!< [31..31] IV96                                                             */
    } bit;
  } IV1RR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000050) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCMCCM0R : 32;           /*!< [31..0] CSGCMCCM0R                                                        */
    } bit;
  } CSGCMCCM0R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000054) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCMCCM1R : 32;           /*!< [31..0] CSGCMCCM1R                                                        */
    } bit;
  } CSGCMCCM1R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000058) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCMCCM2R : 32;           /*!< [31..0] CSGCMCCM2R                                                        */
    } bit;
  } CSGCMCCM2R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000005C) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCMCCM3R : 32;           /*!< [31..0] CSGCMCCM3R                                                        */
    } bit;
  } CSGCMCCM3R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000060) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCMCCM4R : 32;           /*!< [31..0] CSGCMCCM4R                                                        */
    } bit;
  } CSGCMCCM4R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000064) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCMCCM5R : 32;           /*!< [31..0] CSGCMCCM5R                                                        */
    } bit;
  } CSGCMCCM5R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000068) context swap register                                      */
    
