Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 CSGCMCCM6R : 32;           /*!< [31..0] CSGCMCCM6R                                                        */
    } bit;
  } CSGCMCCM6R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000006C) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCMCCM7R : 32;           /*!< [31..0] CSGCMCCM7R                                                        */
    } bit;
  } CSGCMCCM7R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000070) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCM0R    : 32;           /*!< [31..0] CSGCM0R                                                           */
    } bit;
  } CSGCM0R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000074) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCM1R    : 32;           /*!< [31..0] CSGCM1R                                                           */
    } bit;
  } CSGCM1R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000078) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCM2R    : 32;           /*!< [31..0] CSGCM2R                                                           */
    } bit;
  } CSGCM2R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000007C) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCM3R    : 32;           /*!< [31..0] CSGCM3R                                                           */
    } bit;
  } CSGCM3R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000080) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCM4R    : 32;           /*!< [31..0] CSGCM4R                                                           */
    } bit;
  } CSGCM4R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000084) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCM5R    : 32;           /*!< [31..0] CSGCM5R                                                           */
    } bit;
  } CSGCM5R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000088) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCM6R    : 32;           /*!< [31..0] CSGCM6R                                                           */
    } bit;
  } CSGCM6R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000008C) context swap register                                      */
    
    struct {
      __IOM uint32 CSGCM7R    : 32;           /*!< [31..0] CSGCM7R                                                           */
    } bit;
  } CSGCM7R;
} CRYP_Type;                                    /*!< Size = 144 (0x90)                                                         */



/* =========================================================================================================================== */
/* ================                                           DCMI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Digital camera interface (DCMI)
  */

typedef struct {                                /*!< (@ 0x50050000) DCMI Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register 1                                         */
    
    struct {
      __IOM uint32 CAPTURE    : 1;            /*!< [0..0] Capture enable                                                     */
      __IOM uint32 CM         : 1;            /*!< [1..1] Capture mode                                                       */
      __IOM uint32 CROP       : 1;            /*!< [2..2] Crop feature                                                       */
      __IOM uint32 JPEG       : 1;            /*!< [3..3] JPEG format                                                        */
      __IOM uint32 ESS        : 1;            /*!< [4..4] Embedded synchronization select                                    */
      __IOM uint32 PCKPOL     : 1;            /*!< [5..5] Pixel clock polarity                                               */
      __IOM uint32 HSPOL      : 1;            /*!< [6..6] Horizontal synchronization polarity                                */
      __IOM uint32 VSPOL      : 1;            /*!< [7..7] Vertical synchronization polarity                                  */
      __IOM uint32 FCRC       : 2;            /*!< [9..8] Frame capture rate control                                         */
      __IOM uint32 EDM        : 2;            /*!< [11..10] Extended data mode                                               */
            uint32            : 2;
      __IOM uint32 ENABLE     : 1;            /*!< [14..14] DCMI enable                                                      */
            uint32            : 17;
    } bit;
  } CR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000004) status register                                            */
    
    struct {
      __IM  uint32 HSYNC      : 1;            /*!< [0..0] HSYNC                                                              */
      __IM  uint32 VSYNC      : 1;            /*!< [1..1] VSYNC                                                              */
      __IM  uint32 FNE        : 1;            /*!< [2..2] FIFO not empty                                                     */
            uint32            : 29;
    } bit;
  } SR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000008) raw interrupt status register                              */
    
