Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 FRAME_RIS  : 1;            /*!< [0..0] Capture complete raw interrupt status                              */
      __IM  uint32 OVR_RIS    : 1;            /*!< [1..1] Overrun raw interrupt status                                       */
      __IM  uint32 ERR_RIS    : 1;            /*!< [2..2] Synchronization error raw interrupt status                         */
      __IM  uint32 VSYNC_RIS  : 1;            /*!< [3..3] VSYNC raw interrupt status                                         */
      __IM  uint32 LINE_RIS   : 1;            /*!< [4..4] Line raw interrupt status                                          */
            uint32            : 27;
    } bit;
  } RIS;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) interrupt enable register                                  */
    
    struct {
      __IOM uint32 FRAME_IE   : 1;            /*!< [0..0] Capture complete interrupt enable                                  */
      __IOM uint32 OVR_IE     : 1;            /*!< [1..1] Overrun interrupt enable                                           */
      __IOM uint32 ERR_IE     : 1;            /*!< [2..2] Synchronization error interrupt enable                             */
      __IOM uint32 VSYNC_IE   : 1;            /*!< [3..3] VSYNC interrupt enable                                             */
      __IOM uint32 LINE_IE    : 1;            /*!< [4..4] Line interrupt enable                                              */
            uint32            : 27;
    } bit;
  } IER;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000010) masked interrupt status register                           */
    
    struct {
      __IM  uint32 FRAME_MIS  : 1;            /*!< [0..0] Capture complete masked interrupt status                           */
      __IM  uint32 OVR_MIS    : 1;            /*!< [1..1] Overrun masked interrupt status                                    */
      __IM  uint32 ERR_MIS    : 1;            /*!< [2..2] Synchronization error masked interrupt status                      */
      __IM  uint32 VSYNC_MIS  : 1;            /*!< [3..3] VSYNC masked interrupt status                                      */
      __IM  uint32 LINE_MIS   : 1;            /*!< [4..4] Line masked interrupt status                                       */
            uint32            : 27;
    } bit;
  } MIS;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000014) interrupt clear register                                   */
    
    struct {
      __OM  uint32 FRAME_ISC  : 1;            /*!< [0..0] Capture complete interrupt status clear                            */
      __OM  uint32 OVR_ISC    : 1;            /*!< [1..1] Overrun interrupt status clear                                     */
      __OM  uint32 ERR_ISC    : 1;            /*!< [2..2] Synchronization error interrupt status clear                       */
      __OM  uint32 VSYNC_ISC  : 1;            /*!< [3..3] Vertical synch interrupt status clear                              */
      __OM  uint32 LINE_ISC   : 1;            /*!< [4..4] line interrupt status clear                                        */
            uint32            : 27;
    } bit;
  } ICR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) embedded synchronization code register                     */
    
    struct {
      __IOM uint32 FSC        : 8;            /*!< [7..0] Frame start delimiter code                                         */
      __IOM uint32 LSC        : 8;            /*!< [15..8] Line start delimiter code                                         */
      __IOM uint32 LEC        : 8;            /*!< [23..16] Line end delimiter code                                          */
      __IOM uint32 FEC        : 8;            /*!< [31..24] Frame end delimiter code                                         */
    } bit;
  } ESCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) embedded synchronization unmask register                   */
    
    struct {
      __IOM uint32 FSU        : 8;            /*!< [7..0] Frame start delimiter unmask                                       */
      __IOM uint32 LSU        : 8;            /*!< [15..8] Line start delimiter unmask                                       */
      __IOM uint32 LEU        : 8;            /*!< [23..16] Line end delimiter unmask                                        */
      __IOM uint32 FEU        : 8;            /*!< [31..24] Frame end delimiter unmask                                       */
    } bit;
  } ESUR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) crop window start                                          */
    
    struct {
      __IOM uint32 HOFFCNT    : 14;           /*!< [13..0] Horizontal offset count                                           */
            uint32            : 2;
      __IOM uint32 VST        : 13;           /*!< [28..16] Vertical start line count                                        */
            uint32            : 3;
    } bit;
  } CWSTRT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) crop window size                                           */
    
    struct {
      __IOM uint32 CAPCNT     : 14;           /*!< [13..0] Capture count                                                     */
            uint32            : 2;
      __IOM uint32 VLINE      : 14;           /*!< [29..16] Vertical line count                                              */
            uint32            : 2;
    } bit;
  } CWSIZE;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000028) data register                                              */
    
    struct {
      __IM  uint32 Byte0      : 8;            /*!< [7..0] Data byte 0                                                        */
      __IM  uint32 Byte1      : 8;            /*!< [15..8] Data byte 1                                                       */
      __IM  uint32 Byte2      : 8;            /*!< [23..16] Data byte 2                                                      */
      __IM  uint32 Byte3      : 8;            /*!< [31..24] Data byte 3                                                      */
    } bit;
  } DR;
} DCMI_Type;                                    /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                            FMC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Flexible memory controller (FMC)
  */

typedef struct {                                /*!< (@ 0xA0000000) FMC Structure                                              */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) SRAM/NOR-Flash chip-select control register 1              */
    
