Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 MBKEN      : 1;            /*!< [0..0] MBKEN                                                              */
      __IOM uint32 MUXEN      : 1;            /*!< [1..1] MUXEN                                                              */
      __IOM uint32 MTYP       : 2;            /*!< [3..2] MTYP                                                               */
      __IOM uint32 MWID       : 2;            /*!< [5..4] MWID                                                               */
      __IOM uint32 FACCEN     : 1;            /*!< [6..6] FACCEN                                                             */
            uint32            : 1;
      __IOM uint32 BURSTEN    : 1;            /*!< [8..8] BURSTEN                                                            */
      __IOM uint32 WAITPOL    : 1;            /*!< [9..9] WAITPOL                                                            */
            uint32            : 1;
      __IOM uint32 WAITCFG    : 1;            /*!< [11..11] WAITCFG                                                          */
      __IOM uint32 WREN       : 1;            /*!< [12..12] WREN                                                             */
      __IOM uint32 WAITEN     : 1;            /*!< [13..13] WAITEN                                                           */
      __IOM uint32 EXTMOD     : 1;            /*!< [14..14] EXTMOD                                                           */
      __IOM uint32 ASYNCWAIT  : 1;            /*!< [15..15] ASYNCWAIT                                                        */
            uint32            : 3;
      __IOM uint32 CBURSTRW   : 1;            /*!< [19..19] CBURSTRW                                                         */
      __IOM uint32 CCLKEN     : 1;            /*!< [20..20] CCLKEN                                                           */
            uint32            : 11;
    } bit;
  } BCR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) SRAM/NOR-Flash chip-select timing register 1               */
    
    struct {
      __IOM uint32 ADDSET     : 4;            /*!< [3..0] ADDSET                                                             */
      __IOM uint32 ADDHLD     : 4;            /*!< [7..4] ADDHLD                                                             */
      __IOM uint32 DATAST     : 8;            /*!< [15..8] DATAST                                                            */
      __IOM uint32 BUSTURN    : 4;            /*!< [19..16] BUSTURN                                                          */
      __IOM uint32 CLKDIV     : 4;            /*!< [23..20] CLKDIV                                                           */
      __IOM uint32 DATLAT     : 4;            /*!< [27..24] DATLAT                                                           */
      __IOM uint32 ACCMOD     : 2;            /*!< [29..28] ACCMOD                                                           */
            uint32            : 2;
    } bit;
  } BTR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) SRAM/NOR-Flash chip-select control register 2              */
    
    struct {
      __IOM uint32 MBKEN      : 1;            /*!< [0..0] MBKEN                                                              */
      __IOM uint32 MUXEN      : 1;            /*!< [1..1] MUXEN                                                              */
      __IOM uint32 MTYP       : 2;            /*!< [3..2] MTYP                                                               */
      __IOM uint32 MWID       : 2;            /*!< [5..4] MWID                                                               */
      __IOM uint32 FACCEN     : 1;            /*!< [6..6] FACCEN                                                             */
            uint32            : 1;
      __IOM uint32 BURSTEN    : 1;            /*!< [8..8] BURSTEN                                                            */
      __IOM uint32 WAITPOL    : 1;            /*!< [9..9] WAITPOL                                                            */
      __IOM uint32 WRAPMOD    : 1;            /*!< [10..10] WRAPMOD                                                          */
      __IOM uint32 WAITCFG    : 1;            /*!< [11..11] WAITCFG                                                          */
      __IOM uint32 WREN       : 1;            /*!< [12..12] WREN                                                             */
      __IOM uint32 WAITEN     : 1;            /*!< [13..13] WAITEN                                                           */
      __IOM uint32 EXTMOD     : 1;            /*!< [14..14] EXTMOD                                                           */
      __IOM uint32 ASYNCWAIT  : 1;            /*!< [15..15] ASYNCWAIT                                                        */
            uint32            : 3;
      __IOM uint32 CBURSTRW   : 1;            /*!< [19..19] CBURSTRW                                                         */
            uint32            : 12;
    } bit;
  } BCR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) SRAM/NOR-Flash chip-select timing register 2               */
    
    struct {
      __IOM uint32 ADDSET     : 4;            /*!< [3..0] ADDSET                                                             */
      __IOM uint32 ADDHLD     : 4;            /*!< [7..4] ADDHLD                                                             */
      __IOM uint32 DATAST     : 8;            /*!< [15..8] DATAST                                                            */
      __IOM uint32 BUSTURN    : 4;            /*!< [19..16] BUSTURN                                                          */
      __IOM uint32 CLKDIV     : 4;            /*!< [23..20] CLKDIV                                                           */
      __IOM uint32 DATLAT     : 4;            /*!< [27..24] DATLAT                                                           */
      __IOM uint32 ACCMOD     : 2;            /*!< [29..28] ACCMOD                                                           */
            uint32            : 2;
    } bit;
  } BTR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) SRAM/NOR-Flash chip-select control register 3              */
    
