Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
            uint32            : 1;
      __IOM uint32 PWAITEN    : 1;            /*!< [1..1] PWAITEN                                                            */
      __IOM uint32 PBKEN      : 1;            /*!< [2..2] PBKEN                                                              */
      __IOM uint32 PTYP       : 1;            /*!< [3..3] PTYP                                                               */
      __IOM uint32 PWID       : 2;            /*!< [5..4] PWID                                                               */
      __IOM uint32 ECCEN      : 1;            /*!< [6..6] ECCEN                                                              */
            uint32            : 2;
      __IOM uint32 TCLR       : 4;            /*!< [12..9] TCLR                                                              */
      __IOM uint32 TAR        : 4;            /*!< [16..13] TAR                                                              */
      __IOM uint32 ECCPS      : 3;            /*!< [19..17] ECCPS                                                            */
            uint32            : 12;
    } bit;
  } PCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000084) FIFO status and interrupt register                         */
    
    struct {
      __IOM uint32 IRS        : 1;            /*!< [0..0] IRS                                                                */
      __IOM uint32 ILS        : 1;            /*!< [1..1] ILS                                                                */
      __IOM uint32 IFS        : 1;            /*!< [2..2] IFS                                                                */
      __IOM uint32 IREN       : 1;            /*!< [3..3] IREN                                                               */
      __IOM uint32 ILEN       : 1;            /*!< [4..4] ILEN                                                               */
      __IOM uint32 IFEN       : 1;            /*!< [5..5] IFEN                                                               */
      __IM  uint32 FEMPT      : 1;            /*!< [6..6] FEMPT                                                              */
            uint32            : 25;
    } bit;
  } SR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000088) Common memory space timing register                        */
    
    struct {
      __IOM uint32 MEMSETx    : 8;            /*!< [7..0] MEMSETx                                                            */
      __IOM uint32 MEMWAITx   : 8;            /*!< [15..8] MEMWAITx                                                          */
      __IOM uint32 MEMHOLDx   : 8;            /*!< [23..16] MEMHOLDx                                                         */
      __IOM uint32 MEMHIZx    : 8;            /*!< [31..24] MEMHIZx                                                          */
    } bit;
  } PMEM;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000008C) Attribute memory space timing register                     */
    
    struct {
      __IOM uint32 ATTSETx    : 8;            /*!< [7..0] ATTSETx                                                            */
      __IOM uint32 ATTWAITx   : 8;            /*!< [15..8] ATTWAITx                                                          */
      __IOM uint32 ATTHOLDx   : 8;            /*!< [23..16] ATTHOLDx                                                         */
      __IOM uint32 ATTHIZx    : 8;            /*!< [31..24] ATTHIZx                                                          */
    } bit;
  } PATT;
  __IM  uint32  RESERVED1;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000094) ECC result register                                        */
    
    struct {
      __IM  uint32 ECCx       : 32;           /*!< [31..0] ECCx                                                              */
    } bit;
  } ECCR;
  __IM  uint32  RESERVED2[27];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000104) SRAM/NOR-Flash write timing registers 1                    */
    
    struct {
      __IOM uint32 ADDSET     : 4;            /*!< [3..0] ADDSET                                                             */
      __IOM uint32 ADDHLD     : 4;            /*!< [7..4] ADDHLD                                                             */
      __IOM uint32 DATAST     : 8;            /*!< [15..8] DATAST                                                            */
            uint32            : 4;
      __IOM uint32 CLKDIV     : 4;            /*!< [23..20] CLKDIV                                                           */
      __IOM uint32 DATLAT     : 4;            /*!< [27..24] DATLAT                                                           */
      __IOM uint32 ACCMOD     : 2;            /*!< [29..28] ACCMOD                                                           */
            uint32            : 2;
    } bit;
  } BWTR1;
  __IM  uint32  RESERVED3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000010C) SRAM/NOR-Flash write timing registers 2                    */
    
    struct {
      __IOM uint32 ADDSET     : 4;            /*!< [3..0] ADDSET                                                             */
      __IOM uint32 ADDHLD     : 4;            /*!< [7..4] ADDHLD                                                             */
      __IOM uint32 DATAST     : 8;            /*!< [15..8] DATAST                                                            */
            uint32            : 4;
      __IOM uint32 CLKDIV     : 4;            /*!< [23..20] CLKDIV                                                           */
      __IOM uint32 DATLAT     : 4;            /*!< [27..24] DATLAT                                                           */
      __IOM uint32 ACCMOD     : 2;            /*!< [29..28] ACCMOD                                                           */
            uint32            : 2;
    } bit;
  } BWTR2;
  __IM  uint32  RESERVED4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000114) SRAM/NOR-Flash write timing registers 3                    */
    
