Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 ADDSET     : 4;            /*!< [3..0] ADDSET                                                             */
      __IOM uint32 ADDHLD     : 4;            /*!< [7..4] ADDHLD                                                             */
      __IOM uint32 DATAST     : 8;            /*!< [15..8] DATAST                                                            */
            uint32            : 4;
      __IOM uint32 CLKDIV     : 4;            /*!< [23..20] CLKDIV                                                           */
      __IOM uint32 DATLAT     : 4;            /*!< [27..24] DATLAT                                                           */
      __IOM uint32 ACCMOD     : 2;            /*!< [29..28] ACCMOD                                                           */
            uint32            : 2;
    } bit;
  } BWTR3;
  __IM  uint32  RESERVED5;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000011C) SRAM/NOR-Flash write timing registers 4                    */
    
    struct {
      __IOM uint32 ADDSET     : 4;            /*!< [3..0] ADDSET                                                             */
      __IOM uint32 ADDHLD     : 4;            /*!< [7..4] ADDHLD                                                             */
      __IOM uint32 DATAST     : 8;            /*!< [15..8] DATAST                                                            */
            uint32            : 4;
      __IOM uint32 CLKDIV     : 4;            /*!< [23..20] CLKDIV                                                           */
      __IOM uint32 DATLAT     : 4;            /*!< [27..24] DATLAT                                                           */
      __IOM uint32 ACCMOD     : 2;            /*!< [29..28] ACCMOD                                                           */
            uint32            : 2;
    } bit;
  } BWTR4;
  __IM  uint32  RESERVED6[8];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000140) SDRAM Control Register 1                                   */
    
    struct {
      __IOM uint32 NC         : 2;            /*!< [1..0] Number of column address bits                                      */
      __IOM uint32 NR         : 2;            /*!< [3..2] Number of row address bits                                         */
      __IOM uint32 MWID       : 2;            /*!< [5..4] Memory data bus width                                              */
      __IOM uint32 NB         : 1;            /*!< [6..6] Number of internal banks                                           */
      __IOM uint32 CAS        : 2;            /*!< [8..7] CAS latency                                                        */
      __IOM uint32 WP         : 1;            /*!< [9..9] Write protection                                                   */
      __IOM uint32 SDCLK      : 2;            /*!< [11..10] SDRAM clock configuration                                        */
      __IOM uint32 RBURST     : 1;            /*!< [12..12] Burst read                                                       */
      __IOM uint32 RPIPE      : 2;            /*!< [14..13] Read pipe                                                        */
            uint32            : 17;
    } bit;
  } SDCR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000144) SDRAM Control Register 2                                   */
    
    struct {
      __IOM uint32 NC         : 2;            /*!< [1..0] Number of column address bits                                      */
      __IOM uint32 NR         : 2;            /*!< [3..2] Number of row address bits                                         */
      __IOM uint32 MWID       : 2;            /*!< [5..4] Memory data bus width                                              */
      __IOM uint32 NB         : 1;            /*!< [6..6] Number of internal banks                                           */
      __IOM uint32 CAS        : 2;            /*!< [8..7] CAS latency                                                        */
      __IOM uint32 WP         : 1;            /*!< [9..9] Write protection                                                   */
      __IOM uint32 SDCLK      : 2;            /*!< [11..10] SDRAM clock configuration                                        */
      __IOM uint32 RBURST     : 1;            /*!< [12..12] Burst read                                                       */
      __IOM uint32 RPIPE      : 2;            /*!< [14..13] Read pipe                                                        */
            uint32            : 17;
    } bit;
  } SDCR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000148) SDRAM Timing register 1                                    */
    
    struct {
      __IOM uint32 TMRD       : 4;            /*!< [3..0] Load Mode Register to Active                                       */
      __IOM uint32 TXSR       : 4;            /*!< [7..4] Exit self-refresh delay                                            */
      __IOM uint32 TRAS       : 4;            /*!< [11..8] Self refresh time                                                 */
      __IOM uint32 TRC        : 4;            /*!< [15..12] Row cycle delay                                                  */
      __IOM uint32 TWR        : 4;            /*!< [19..16] Recovery delay                                                   */
      __IOM uint32 TRP        : 4;            /*!< [23..20] Row precharge delay                                              */
      __IOM uint32 TRCD       : 4;            /*!< [27..24] Row to column delay                                              */
            uint32            : 4;
    } bit;
  } SDTR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000014C) SDRAM Timing register 2                                    */
    
    struct {
      __IOM uint32 TMRD       : 4;            /*!< [3..0] Load Mode Register to Active                                       */
      __IOM uint32 TXSR       : 4;            /*!< [7..4] Exit self-refresh delay                                            */
      __IOM uint32 TRAS       : 4;            /*!< [11..8] Self refresh time                                                 */
      __IOM uint32 TRC        : 4;            /*!< [15..12] Row cycle delay                                                  */
      __IOM uint32 TWR        : 4;            /*!< [19..16] Recovery delay                                                   */
      __IOM uint32 TRP        : 4;            /*!< [23..20] Row precharge delay                                              */
      __IOM uint32 TRCD       : 4;            /*!< [27..24] Row to column delay                                              */
            uint32            : 4;
    } bit;
  } SDTR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000150) SDRAM Command Mode register                                */
    
