Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __OM  uint32 MODE       : 3;            /*!< [2..0] Command mode                                                       */
      __OM  uint32 CTB2       : 1;            /*!< [3..3] Command target bank 2                                              */
      __OM  uint32 CTB1       : 1;            /*!< [4..4] Command target bank 1                                              */
      __IOM uint32 NRFS       : 4;            /*!< [8..5] Number of Auto-refresh                                             */
      __IOM uint32 MRD        : 13;           /*!< [21..9] Mode Register definition                                          */
            uint32            : 10;
    } bit;
  } SDCMR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000154) SDRAM Refresh Timer register                               */
    
    struct {
      __OM  uint32 CRE        : 1;            /*!< [0..0] Clear Refresh error flag                                           */
      __IOM uint32 COUNT      : 13;           /*!< [13..1] Refresh Timer Count                                               */
      __IOM uint32 REIE       : 1;            /*!< [14..14] RES Interrupt Enable                                             */
            uint32            : 17;
    } bit;
  } SDRTR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000158) SDRAM Status register                                      */
    
    struct {
      __IM  uint32 RE         : 1;            /*!< [0..0] Refresh error flag                                                 */
      __IM  uint32 MODES1     : 2;            /*!< [2..1] Status Mode for Bank 1                                             */
      __IM  uint32 MODES2     : 2;            /*!< [4..3] Status Mode for Bank 2                                             */
      __IM  uint32 BUSY       : 1;            /*!< [5..5] Busy status                                                        */
            uint32            : 26;
    } bit;
  } SDSR;
} FMC_Type;                                     /*!< Size = 348 (0x15c)                                                        */



/* =========================================================================================================================== */
/* ================                                            DBG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Debug support (DBG)
  */

typedef struct {                                /*!< (@ 0xE0042000) DBG Structure                                              */
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000000) IDCODE                                                     */
    
    struct {
      __IM  uint32 DEV_ID     : 12;           /*!< [11..0] DEV_ID                                                            */
            uint32            : 4;
      __IM  uint32 REV_ID     : 16;           /*!< [31..16] REV_ID                                                           */
    } bit;
  } DBGMCU_IDCODE;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Control Register                                           */
    
    struct {
      __IOM uint32 DBG_SLEEP  : 1;            /*!< [0..0] DBG_SLEEP                                                          */
      __IOM uint32 DBG_STOP   : 1;            /*!< [1..1] DBG_STOP                                                           */
      __IOM uint32 DBG_STANDBY : 1;           /*!< [2..2] DBG_STANDBY                                                        */
            uint32            : 2;
      __IOM uint32 TRACE_IOEN : 1;            /*!< [5..5] TRACE_IOEN                                                         */
      __IOM uint32 TRACE_MODE : 2;            /*!< [7..6] TRACE_MODE                                                         */
            uint32            : 24;
    } bit;
  } DBGMCU_CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) Debug MCU APB1 Freeze registe                              */
    
    struct {
      __IOM uint32 DBG_TIM2_STOP : 1;         /*!< [0..0] DBG_TIM2_STOP                                                      */
      __IOM uint32 DBG_TIM3_STOP : 1;         /*!< [1..1] DBG_TIM3 _STOP                                                     */
      __IOM uint32 DBG_TIM4_STOP : 1;         /*!< [2..2] DBG_TIM4_STOP                                                      */
      __IOM uint32 DBG_TIM5_STOP : 1;         /*!< [3..3] DBG_TIM5_STOP                                                      */
      __IOM uint32 DBG_TIM6_STOP : 1;         /*!< [4..4] DBG_TIM6_STOP                                                      */
      __IOM uint32 DBG_TIM7_STOP : 1;         /*!< [5..5] DBG_TIM7_STOP                                                      */
      __IOM uint32 DBG_TIM12_STOP : 1;        /*!< [6..6] DBG_TIM12_STOP                                                     */
      __IOM uint32 DBG_TIM13_STOP : 1;        /*!< [7..7] DBG_TIM13_STOP                                                     */
      __IOM uint32 DBG_TIM14_STOP : 1;        /*!< [8..8] DBG_TIM14_STOP                                                     */
            uint32            : 2;
      __IOM uint32 DBG_WWDG_STOP : 1;         /*!< [11..11] DBG_WWDG_STOP                                                    */
      __IOM uint32 DBG_IWDEG_STOP : 1;        /*!< [12..12] DBG_IWDEG_STOP                                                   */
            uint32            : 8;
      __IOM uint32 DBG_J2C1_SMBUS_TIMEOUT : 1;/*!< [21..21] DBG_J2C1_SMBUS_TIMEOUT                                           */
      __IOM uint32 DBG_J2C2_SMBUS_TIMEOUT : 1;/*!< [22..22] DBG_J2C2_SMBUS_TIMEOUT                                           */
      __IOM uint32 DBG_J2C3SMBUS_TIMEOUT : 1; /*!< [23..23] DBG_J2C3SMBUS_TIMEOUT                                            */
            uint32            : 1;
      __IOM uint32 DBG_CAN1_STOP : 1;         /*!< [25..25] DBG_CAN1_STOP                                                    */
      __IOM uint32 DBG_CAN2_STOP : 1;         /*!< [26..26] DBG_CAN2_STOP                                                    */
            uint32            : 5;
    } bit;
  } DBGMCU_APB1_FZ;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) Debug MCU APB2 Freeze registe                              */
    
