Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 DBG_TIM1_STOP : 1;         /*!< [0..0] TIM1 counter stopped when core is halted                           */
      __IOM uint32 DBG_TIM8_STOP : 1;         /*!< [1..1] TIM8 counter stopped when core is halted                           */
            uint32            : 14;
      __IOM uint32 DBG_TIM9_STOP : 1;         /*!< [16..16] TIM9 counter stopped when core is halted                         */
      __IOM uint32 DBG_TIM10_STOP : 1;        /*!< [17..17] TIM10 counter stopped when core is halted                        */
      __IOM uint32 DBG_TIM11_STOP : 1;        /*!< [18..18] TIM11 counter stopped when core is halted                        */
            uint32            : 13;
    } bit;
  } DBGMCU_APB2_FZ;
} DBG_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                           DMA2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA controller (DMA2)
  */

typedef struct {                                /*!< (@ 0x40026400) DMA2 Structure                                             */
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000000) low interrupt status register                              */
    
    struct {
      __IM  uint32 FEIF0      : 1;            /*!< [0..0] Stream x FIFO error interrupt flag (x=3..0)                        */
            uint32            : 1;
      __IM  uint32 DMEIF0     : 1;            /*!< [2..2] Stream x direct mode error interrupt flag (x=3..0)                 */
      __IM  uint32 TEIF0      : 1;            /*!< [3..3] Stream x transfer error interrupt flag (x=3..0)                    */
      __IM  uint32 HTIF0      : 1;            /*!< [4..4] Stream x half transfer interrupt flag (x=3..0)                     */
      __IM  uint32 TCIF0      : 1;            /*!< [5..5] Stream x transfer complete interrupt flag (x = 3..0)               */
      __IM  uint32 FEIF1      : 1;            /*!< [6..6] Stream x FIFO error interrupt flag (x=3..0)                        */
            uint32            : 1;
      __IM  uint32 DMEIF1     : 1;            /*!< [8..8] Stream x direct mode error interrupt flag (x=3..0)                 */
      __IM  uint32 TEIF1      : 1;            /*!< [9..9] Stream x transfer error interrupt flag (x=3..0)                    */
      __IM  uint32 HTIF1      : 1;            /*!< [10..10] Stream x half transfer interrupt flag (x=3..0)                   */
      __IM  uint32 TCIF1      : 1;            /*!< [11..11] Stream x transfer complete interrupt flag (x = 3..0)             */
            uint32            : 4;
      __IM  uint32 FEIF2      : 1;            /*!< [16..16] Stream x FIFO error interrupt flag (x=3..0)                      */
            uint32            : 1;
      __IM  uint32 DMEIF2     : 1;            /*!< [18..18] Stream x direct mode error interrupt flag (x=3..0)               */
      __IM  uint32 TEIF2      : 1;            /*!< [19..19] Stream x transfer error interrupt flag (x=3..0)                  */
      __IM  uint32 HTIF2      : 1;            /*!< [20..20] Stream x half transfer interrupt flag (x=3..0)                   */
      __IM  uint32 TCIF2      : 1;            /*!< [21..21] Stream x transfer complete interrupt flag (x = 3..0)             */
      __IM  uint32 FEIF3      : 1;            /*!< [22..22] Stream x FIFO error interrupt flag (x=3..0)                      */
            uint32            : 1;
      __IM  uint32 DMEIF3     : 1;            /*!< [24..24] Stream x direct mode error interrupt flag (x=3..0)               */
      __IM  uint32 TEIF3      : 1;            /*!< [25..25] Stream x transfer error interrupt flag (x=3..0)                  */
      __IM  uint32 HTIF3      : 1;            /*!< [26..26] Stream x half transfer interrupt flag (x=3..0)                   */
      __IM  uint32 TCIF3      : 1;            /*!< [27..27] Stream x transfer complete interrupt flag (x = 3..0)             */
            uint32            : 4;
    } bit;
  } LISR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000004) high interrupt status register                             */
    
    struct {
      __IM  uint32 FEIF4      : 1;            /*!< [0..0] Stream x FIFO error interrupt flag (x=7..4)                        */
            uint32            : 1;
      __IM  uint32 DMEIF4     : 1;            /*!< [2..2] Stream x direct mode error interrupt flag (x=7..4)                 */
      __IM  uint32 TEIF4      : 1;            /*!< [3..3] Stream x transfer error interrupt flag (x=7..4)                    */
      __IM  uint32 HTIF4      : 1;            /*!< [4..4] Stream x half transfer interrupt flag (x=7..4)                     */
      __IM  uint32 TCIF4      : 1;            /*!< [5..5] Stream x transfer complete interrupt flag (x=7..4)                 */
      __IM  uint32 FEIF5      : 1;            /*!< [6..6] Stream x FIFO error interrupt flag (x=7..4)                        */
            uint32            : 1;
      __IM  uint32 DMEIF5     : 1;            /*!< [8..8] Stream x direct mode error interrupt flag (x=7..4)                 */
      __IM  uint32 TEIF5      : 1;            /*!< [9..9] Stream x transfer error interrupt flag (x=7..4)                    */
      __IM  uint32 HTIF5      : 1;            /*!< [10..10] Stream x half transfer interrupt flag (x=7..4)                   */
      __IM  uint32 TCIF5      : 1;            /*!< [11..11] Stream x transfer complete interrupt flag (x=7..4)               */
            uint32            : 4;
      __IM  uint32 FEIF6      : 1;            /*!< [16..16] Stream x FIFO error interrupt flag (x=7..4)                      */
            uint32            : 1;
      __IM  uint32 DMEIF6     : 1;            /*!< [18..18] Stream x direct mode error interrupt flag (x=7..4)               */
      __IM  uint32 TEIF6      : 1;            /*!< [19..19] Stream x transfer error interrupt flag (x=7..4)                  */
      __IM  uint32 HTIF6      : 1;            /*!< [20..20] Stream x half transfer interrupt flag (x=7..4)                   */
      __IM  uint32 TCIF6      : 1;            /*!< [21..21] Stream x transfer complete interrupt flag (x=7..4)               */
      __IM  uint32 FEIF7      : 1;            /*!< [22..22] Stream x FIFO error interrupt flag (x=7..4)                      */
            uint32            : 1;
      __IM  uint32 DMEIF7     : 1;            /*!< [24..24] Stream x direct mode error interrupt flag (x=7..4)               */
      __IM  uint32 TEIF7      : 1;            /*!< [25..25] Stream x transfer error interrupt flag (x=7..4)                  */
      __IM  uint32 HTIF7      : 1;            /*!< [26..26] Stream x half transfer interrupt flag (x=7..4)                   */
      __IM  uint32 TCIF7      : 1;            /*!< [27..27] Stream x transfer complete interrupt flag (x=7..4)               */
            uint32            : 4;
    } bit;
  } HISR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) low interrupt flag clear register                          */
    
