Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 CFEIF0     : 1;            /*!< [0..0] Stream x clear FIFO error interrupt flag (x = 3..0)                */
            uint32            : 1;
      __IOM uint32 CDMEIF0    : 1;            /*!< [2..2] Stream x clear direct mode error interrupt flag (x =
                                                     3..0)                                                                     */
      __IOM uint32 CTEIF0     : 1;            /*!< [3..3] Stream x clear transfer error interrupt flag (x = 3..0)            */
      __IOM uint32 CHTIF0     : 1;            /*!< [4..4] Stream x clear half transfer interrupt flag (x = 3..0)             */
      __IOM uint32 CTCIF0     : 1;            /*!< [5..5] Stream x clear transfer complete interrupt flag (x =
                                                     3..0)                                                                     */
      __IOM uint32 CFEIF1     : 1;            /*!< [6..6] Stream x clear FIFO error interrupt flag (x = 3..0)                */
            uint32            : 1;
      __IOM uint32 CDMEIF1    : 1;            /*!< [8..8] Stream x clear direct mode error interrupt flag (x =
                                                     3..0)                                                                     */
      __IOM uint32 CTEIF1     : 1;            /*!< [9..9] Stream x clear transfer error interrupt flag (x = 3..0)            */
      __IOM uint32 CHTIF1     : 1;            /*!< [10..10] Stream x clear half transfer interrupt flag (x = 3..0)           */
      __IOM uint32 CTCIF1     : 1;            /*!< [11..11] Stream x clear transfer complete interrupt flag (x
                                                     = 3..0)                                                                   */
            uint32            : 4;
      __IOM uint32 CFEIF2     : 1;            /*!< [16..16] Stream x clear FIFO error interrupt flag (x = 3..0)              */
            uint32            : 1;
      __IOM uint32 CDMEIF2    : 1;            /*!< [18..18] Stream x clear direct mode error interrupt flag (x
                                                     = 3..0)                                                                   */
      __IOM uint32 CTEIF2     : 1;            /*!< [19..19] Stream x clear transfer error interrupt flag (x = 3..0)          */
      __IOM uint32 CHTIF2     : 1;            /*!< [20..20] Stream x clear half transfer interrupt flag (x = 3..0)           */
      __IOM uint32 CTCIF2     : 1;            /*!< [21..21] Stream x clear transfer complete interrupt flag (x
                                                     = 3..0)                                                                   */
      __IOM uint32 CFEIF3     : 1;            /*!< [22..22] Stream x clear FIFO error interrupt flag (x = 3..0)              */
            uint32            : 1;
      __IOM uint32 CDMEIF3    : 1;            /*!< [24..24] Stream x clear direct mode error interrupt flag (x
                                                     = 3..0)                                                                   */
      __IOM uint32 CTEIF3     : 1;            /*!< [25..25] Stream x clear transfer error interrupt flag (x = 3..0)          */
      __IOM uint32 CHTIF3     : 1;            /*!< [26..26] Stream x clear half transfer interrupt flag (x = 3..0)           */
      __IOM uint32 CTCIF3     : 1;            /*!< [27..27] Stream x clear transfer complete interrupt flag (x
                                                     = 3..0)                                                                   */
            uint32            : 4;
    } bit;
  } LIFCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) high interrupt flag clear register                         */
    
    struct {
      __IOM uint32 CFEIF4     : 1;            /*!< [0..0] Stream x clear FIFO error interrupt flag (x = 7..4)                */
            uint32            : 1;
      __IOM uint32 CDMEIF4    : 1;            /*!< [2..2] Stream x clear direct mode error interrupt flag (x =
                                                     7..4)                                                                     */
      __IOM uint32 CTEIF4     : 1;            /*!< [3..3] Stream x clear transfer error interrupt flag (x = 7..4)            */
      __IOM uint32 CHTIF4     : 1;            /*!< [4..4] Stream x clear half transfer interrupt flag (x = 7..4)             */
      __IOM uint32 CTCIF4     : 1;            /*!< [5..5] Stream x clear transfer complete interrupt flag (x =
                                                     7..4)                                                                     */
      __IOM uint32 CFEIF5     : 1;            /*!< [6..6] Stream x clear FIFO error interrupt flag (x = 7..4)                */
            uint32            : 1;
      __IOM uint32 CDMEIF5    : 1;            /*!< [8..8] Stream x clear direct mode error interrupt flag (x =
                                                     7..4)                                                                     */
      __IOM uint32 CTEIF5     : 1;            /*!< [9..9] Stream x clear transfer error interrupt flag (x = 7..4)            */
      __IOM uint32 CHTIF5     : 1;            /*!< [10..10] Stream x clear half transfer interrupt flag (x = 7..4)           */
      __IOM uint32 CTCIF5     : 1;            /*!< [11..11] Stream x clear transfer complete interrupt flag (x
                                                     = 7..4)                                                                   */
            uint32            : 4;
      __IOM uint32 CFEIF6     : 1;            /*!< [16..16] Stream x clear FIFO error interrupt flag (x = 7..4)              */
            uint32            : 1;
      __IOM uint32 CDMEIF6    : 1;            /*!< [18..18] Stream x clear direct mode error interrupt flag (x
                                                     = 7..4)                                                                   */
      __IOM uint32 CTEIF6     : 1;            /*!< [19..19] Stream x clear transfer error interrupt flag (x = 7..4)          */
      __IOM uint32 CHTIF6     : 1;            /*!< [20..20] Stream x clear half transfer interrupt flag (x = 7..4)           */
      __IOM uint32 CTCIF6     : 1;            /*!< [21..21] Stream x clear transfer complete interrupt flag (x
                                                     = 7..4)                                                                   */
      __IOM uint32 CFEIF7     : 1;            /*!< [22..22] Stream x clear FIFO error interrupt flag (x = 7..4)              */
            uint32            : 1;
      __IOM uint32 CDMEIF7    : 1;            /*!< [24..24] Stream x clear direct mode error interrupt flag (x
                                                     = 7..4)                                                                   */
      __IOM uint32 CTEIF7     : 1;            /*!< [25..25] Stream x clear transfer error interrupt flag (x = 7..4)          */
      __IOM uint32 CHTIF7     : 1;            /*!< [26..26] Stream x clear half transfer interrupt flag (x = 7..4)           */
      __IOM uint32 CTCIF7     : 1;            /*!< [27..27] Stream x clear transfer complete interrupt flag (x
                                                     = 7..4)                                                                   */
            uint32            : 4;
    } bit;
  } HIFCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) stream x configuration register                            */
    
