Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 NDT        : 16;           /*!< [15..0] Number of data items to transfer                                  */
            uint32            : 16;
    } bit;
  } S4NDTR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000078) stream x peripheral address register                       */
    
    struct {
      __IOM uint32 PA         : 32;           /*!< [31..0] Peripheral address                                                */
    } bit;
  } S4PAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000007C) stream x memory 0 address register                         */
    
    struct {
      __IOM uint32 M0A        : 32;           /*!< [31..0] Memory 0 address                                                  */
    } bit;
  } S4M0AR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000080) stream x memory 1 address register                         */
    
    struct {
      __IOM uint32 M1A        : 32;           /*!< [31..0] Memory 1 address (used in case of Double buffer mode)             */
    } bit;
  } S4M1AR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000084) stream x FIFO control register                             */
    
    struct {
      __IOM uint32 FTH        : 2;            /*!< [1..0] FIFO threshold selection                                           */
      __IOM uint32 DMDIS      : 1;            /*!< [2..2] Direct mode disable                                                */
      __IM  uint32 FS         : 3;            /*!< [5..3] FIFO status                                                        */
            uint32            : 1;
      __IOM uint32 FEIE       : 1;            /*!< [7..7] FIFO error interrupt enable                                        */
            uint32            : 24;
    } bit;
  } S4FCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000088) stream x configuration register                            */
    
    struct {
      __IOM uint32 EN         : 1;            /*!< [0..0] Stream enable / flag stream ready when read low                    */
      __IOM uint32 DMEIE      : 1;            /*!< [1..1] Direct mode error interrupt enable                                 */
      __IOM uint32 TEIE       : 1;            /*!< [2..2] Transfer error interrupt enable                                    */
      __IOM uint32 HTIE       : 1;            /*!< [3..3] Half transfer interrupt enable                                     */
      __IOM uint32 TCIE       : 1;            /*!< [4..4] Transfer complete interrupt enable                                 */
      __IOM uint32 PFCTRL     : 1;            /*!< [5..5] Peripheral flow controller                                         */
      __IOM uint32 DIR        : 2;            /*!< [7..6] Data transfer direction                                            */
      __IOM uint32 CIRC       : 1;            /*!< [8..8] Circular mode                                                      */
      __IOM uint32 PINC       : 1;            /*!< [9..9] Peripheral increment mode                                          */
      __IOM uint32 MINC       : 1;            /*!< [10..10] Memory increment mode                                            */
      __IOM uint32 PSIZE      : 2;            /*!< [12..11] Peripheral data size                                             */
      __IOM uint32 MSIZE      : 2;            /*!< [14..13] Memory data size                                                 */
      __IOM uint32 PINCOS     : 1;            /*!< [15..15] Peripheral increment offset size                                 */
      __IOM uint32 PL         : 2;            /*!< [17..16] Priority level                                                   */
      __IOM uint32 DBM        : 1;            /*!< [18..18] Double buffer mode                                               */
      __IOM uint32 CT         : 1;            /*!< [19..19] Current target (only in double buffer mode)                      */
      __IOM uint32 ACK        : 1;            /*!< [20..20] ACK                                                              */
      __IOM uint32 PBURST     : 2;            /*!< [22..21] Peripheral burst transfer configuration                          */
      __IOM uint32 MBURST     : 2;            /*!< [24..23] Memory burst transfer configuration                              */
      __IOM uint32 CHSEL      : 3;            /*!< [27..25] Channel selection                                                */
            uint32            : 4;
    } bit;
  } S5CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000008C) stream x number of data register                           */
    
    struct {
      __IOM uint32 NDT        : 16;           /*!< [15..0] Number of data items to transfer                                  */
            uint32            : 16;
    } bit;
  } S5NDTR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000090) stream x peripheral address register                       */
    
    struct {
      __IOM uint32 PA         : 32;           /*!< [31..0] Peripheral address                                                */
    } bit;
  } S5PAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000094) stream x memory 0 address register                         */
    
    struct {
      __IOM uint32 M0A        : 32;           /*!< [31..0] Memory 0 address                                                  */
    } bit;
  } S5M0AR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000098) stream x memory 1 address register                         */
    
    struct {
      __IOM uint32 M1A        : 32;           /*!< [31..0] Memory 1 address (used in case of Double buffer mode)             */
    } bit;
  } S5M1AR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000009C) stream x FIFO control register                             */
    
