Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 NDT        : 16;           /*!< [15..0] Number of data items to transfer                                  */
            uint32            : 16;
    } bit;
  } S7NDTR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000C0) stream x peripheral address register                       */
    
    struct {
      __IOM uint32 PA         : 32;           /*!< [31..0] Peripheral address                                                */
    } bit;
  } S7PAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000C4) stream x memory 0 address register                         */
    
    struct {
      __IOM uint32 M0A        : 32;           /*!< [31..0] Memory 0 address                                                  */
    } bit;
  } S7M0AR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000C8) stream x memory 1 address register                         */
    
    struct {
      __IOM uint32 M1A        : 32;           /*!< [31..0] Memory 1 address (used in case of Double buffer mode)             */
    } bit;
  } S7M1AR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000CC) stream x FIFO control register                             */
    
    struct {
      __IOM uint32 FTH        : 2;            /*!< [1..0] FIFO threshold selection                                           */
      __IOM uint32 DMDIS      : 1;            /*!< [2..2] Direct mode disable                                                */
      __IM  uint32 FS         : 3;            /*!< [5..3] FIFO status                                                        */
            uint32            : 1;
      __IOM uint32 FEIE       : 1;            /*!< [7..7] FIFO error interrupt enable                                        */
            uint32            : 24;
    } bit;
  } S7FCR;
} DMA2_Type;                                    /*!< Size = 208 (0xd0)                                                         */



/* =========================================================================================================================== */
/* ================                                            RCC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset and clock control (RCC)
  */

typedef struct {                                /*!< (@ 0x40023800) RCC Structure                                              */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) clock control register                                     */
    
    struct {
      __IOM uint32 HSION      : 1;            /*!< [0..0] Internal high-speed clock enable                                   */
      __IM  uint32 HSIRDY     : 1;            /*!< [1..1] Internal high-speed clock ready flag                               */
            uint32            : 1;
      __IOM uint32 HSITRIM    : 5;            /*!< [7..3] Internal high-speed clock trimming                                 */
      __IM  uint32 HSICAL     : 8;            /*!< [15..8] Internal high-speed clock calibration                             */
      __IOM uint32 HSEON      : 1;            /*!< [16..16] HSE clock enable                                                 */
      __IM  uint32 HSERDY     : 1;            /*!< [17..17] HSE clock ready flag                                             */
      __IOM uint32 HSEBYP     : 1;            /*!< [18..18] HSE clock bypass                                                 */
      __IOM uint32 CSSON      : 1;            /*!< [19..19] Clock security system enable                                     */
            uint32            : 4;
      __IOM uint32 PLLON      : 1;            /*!< [24..24] Main PLL (PLL) enable                                            */
      __IM  uint32 PLLRDY     : 1;            /*!< [25..25] Main PLL (PLL) clock ready flag                                  */
      __IOM uint32 PLLI2SON   : 1;            /*!< [26..26] PLLI2S enable                                                    */
      __IM  uint32 PLLI2SRDY  : 1;            /*!< [27..27] PLLI2S clock ready flag                                          */
            uint32            : 4;
    } bit;
  } CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) PLL configuration register                                 */
    
    struct {
      __IOM uint32 PLLM       : 6;            /*!< [5..0] Division factor for the main PLL (PLL) and audio PLL                */
      __IOM uint32 PLLN       : 9;            /*!< [14..6] Main PLL (PLL) multiplication factor for VCO                       */
            uint32            : 1;
      __IOM uint32 PLLP       : 2;            /*!< [17..16] Main PLL (PLL) division factor for main system clock             */
            uint32            : 4;
      __IOM uint32 PLLSRC     : 1;            /*!< [22..22] Main PLL(PLL) and audio PLL (PLLI2S) entry clock source          */
            uint32            : 1;
      __IOM uint32 PLLQ       : 4;            /*!< [27..24] Main PLL (PLL) division factor for USB OTG FS, SDIO              */
            uint32            : 4;
    } bit;
  } PLLCFGR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) clock configuration register                               */
    
    struct {
      __IOM uint32 SW         : 2;            /*!< [1..0] System clock switch                                                */
      __IM  uint32 SWS        : 2;            /*!< [3..2] System clock switch status                                         */
      __IOM uint32 HPRE       : 4;            /*!< [7..4] AHB prescaler                                                      */
            uint32            : 2;
      __IOM uint32 PPRE1      : 3;            /*!< [12..10] APB Low speed prescaler (APB1)                                   */
      __IOM uint32 PPRE2      : 3;            /*!< [15..13] APB high-speed prescaler (APB2)                                  */
      __IOM uint32 RTCPRE     : 5;            /*!< [20..16] HSE division factor for RTC clock                                */
      __IOM uint32 MCO1       : 2;            /*!< [22..21] Microcontroller clock output 1                                   */
      __IOM uint32 I2SSRC     : 1;            /*!< [23..23] I2S clock selection                                              */
      __IOM uint32 MCO1PRE    : 3;            /*!< [26..24] MCO1 prescaler                                                   */
      __IOM uint32 MCO2PRE    : 3;            /*!< [29..27] MCO2 prescaler                                                   */
      __IOM uint32 MCO2       : 2;            /*!< [31..30] Microcontroller clock output 2                                   */
    } bit;
  } CFGR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) clock interrupt register                                   */
    
