Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 LSIRDYF    : 1;            /*!< [0..0] LSI ready interrupt flag                                           */
      __IM  uint32 LSERDYF    : 1;            /*!< [1..1] LSE ready interrupt flag                                           */
      __IM  uint32 HSIRDYF    : 1;            /*!< [2..2] HSI ready interrupt flag                                           */
      __IM  uint32 HSERDYF    : 1;            /*!< [3..3] HSE ready interrupt flag                                           */
      __IM  uint32 PLLRDYF    : 1;            /*!< [4..4] Main PLL (PLL) ready interrupt flag                                */
      __IM  uint32 PLLI2SRDYF : 1;            /*!< [5..5] PLLI2S ready interrupt flag                                        */
      __IM  uint32 PLLSAIRDYF : 1;            /*!< [6..6] PLLSAI ready interrupt flag                                        */
      __IM  uint32 CSSF       : 1;            /*!< [7..7] Clock security system interrupt flag                               */
      __IOM uint32 LSIRDYIE   : 1;            /*!< [8..8] LSI ready interrupt enable                                         */
      __IOM uint32 LSERDYIE   : 1;            /*!< [9..9] LSE ready interrupt enable                                         */
      __IOM uint32 HSIRDYIE   : 1;            /*!< [10..10] HSI ready interrupt enable                                       */
      __IOM uint32 HSERDYIE   : 1;            /*!< [11..11] HSE ready interrupt enable                                       */
      __IOM uint32 PLLRDYIE   : 1;            /*!< [12..12] Main PLL (PLL) ready interrupt enable                            */
      __IOM uint32 PLLI2SRDYIE : 1;           /*!< [13..13] PLLI2S ready interrupt enable                                    */
      __IOM uint32 PLLSAIRDYIE : 1;           /*!< [14..14] PLLSAI Ready Interrupt Enable                                    */
            uint32            : 1;
      __OM  uint32 LSIRDYC    : 1;            /*!< [16..16] LSI ready interrupt clear                                        */
      __OM  uint32 LSERDYC    : 1;            /*!< [17..17] LSE ready interrupt clear                                        */
      __OM  uint32 HSIRDYC    : 1;            /*!< [18..18] HSI ready interrupt clear                                        */
      __OM  uint32 HSERDYC    : 1;            /*!< [19..19] HSE ready interrupt clear                                        */
      __OM  uint32 PLLRDYC    : 1;            /*!< [20..20] Main PLL(PLL) ready interrupt clear                              */
      __OM  uint32 PLLI2SRDYC : 1;            /*!< [21..21] PLLI2S ready interrupt clear                                     */
      __OM  uint32 PLLSAIRDYC : 1;            /*!< [22..22] PLLSAI Ready Interrupt Clear                                     */
      __OM  uint32 CSSC       : 1;            /*!< [23..23] Clock security system interrupt clear                            */
            uint32            : 8;
    } bit;
  } CIR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) AHB1 peripheral reset register                             */
    
    struct {
      __IOM uint32 GPIOARST   : 1;            /*!< [0..0] IO port A reset                                                    */
      __IOM uint32 GPIOBRST   : 1;            /*!< [1..1] IO port B reset                                                    */
      __IOM uint32 GPIOCRST   : 1;            /*!< [2..2] IO port C reset                                                    */
      __IOM uint32 GPIODRST   : 1;            /*!< [3..3] IO port D reset                                                    */
      __IOM uint32 GPIOERST   : 1;            /*!< [4..4] IO port E reset                                                    */
      __IOM uint32 GPIOFRST   : 1;            /*!< [5..5] IO port F reset                                                    */
      __IOM uint32 GPIOGRST   : 1;            /*!< [6..6] IO port G reset                                                    */
      __IOM uint32 GPIOHRST   : 1;            /*!< [7..7] IO port H reset                                                    */
      __IOM uint32 GPIOIRST   : 1;            /*!< [8..8] IO port I reset                                                    */
      __IOM uint32 GPIOJRST   : 1;            /*!< [9..9] IO port J reset                                                    */
      __IOM uint32 GPIOKRST   : 1;            /*!< [10..10] IO port K reset                                                  */
            uint32            : 1;
      __IOM uint32 CRCRST     : 1;            /*!< [12..12] CRC reset                                                        */
            uint32            : 8;
      __IOM uint32 DMA1RST    : 1;            /*!< [21..21] DMA2 reset                                                       */
      __IOM uint32 DMA2RST    : 1;            /*!< [22..22] DMA2 reset                                                       */
      __IOM uint32 DMA2DRST   : 1;            /*!< [23..23] DMA2D reset                                                      */
            uint32            : 1;
      __IOM uint32 ETHMACRST  : 1;            /*!< [25..25] Ethernet MAC reset                                               */
            uint32            : 3;
      __IOM uint32 OTGHSRST   : 1;            /*!< [29..29] USB OTG HS module reset                                          */
            uint32            : 2;
    } bit;
  } AHB1RSTR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) AHB2 peripheral reset register                             */
    
    struct {
      __IOM uint32 DCMIRST    : 1;            /*!< [0..0] Camera interface reset                                             */
            uint32            : 3;
      __IOM uint32 CRYPRST    : 1;            /*!< [4..4] Cryptographic module reset                                         */
      __IOM uint32 HSAHRST    : 1;            /*!< [5..5] Hash module reset                                                  */
      __IOM uint32 RNGRST     : 1;            /*!< [6..6] Random number generator module reset                               */
      __IOM uint32 OTGFSRST   : 1;            /*!< [7..7] USB OTG FS module reset                                            */
            uint32            : 24;
    } bit;
  } AHB2RSTR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) AHB3 peripheral reset register                             */
    
