Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 FMCRST     : 1;            /*!< [0..0] Flexible memory controller module reset                            */
      __IOM uint32 QSPIRST    : 1;            /*!< [1..1] Quad SPI memory controller reset                                   */
            uint32            : 30;
    } bit;
  } AHB3RSTR;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) APB1 peripheral reset register                             */
    
    struct {
      __IOM uint32 TIM2RST    : 1;            /*!< [0..0] TIM2 reset                                                         */
      __IOM uint32 TIM3RST    : 1;            /*!< [1..1] TIM3 reset                                                         */
      __IOM uint32 TIM4RST    : 1;            /*!< [2..2] TIM4 reset                                                         */
      __IOM uint32 TIM5RST    : 1;            /*!< [3..3] TIM5 reset                                                         */
      __IOM uint32 TIM6RST    : 1;            /*!< [4..4] TIM6 reset                                                         */
      __IOM uint32 TIM7RST    : 1;            /*!< [5..5] TIM7 reset                                                         */
      __IOM uint32 TIM12RST   : 1;            /*!< [6..6] TIM12 reset                                                        */
      __IOM uint32 TIM13RST   : 1;            /*!< [7..7] TIM13 reset                                                        */
      __IOM uint32 TIM14RST   : 1;            /*!< [8..8] TIM14 reset                                                        */
      __IOM uint32 LPTIM1RST  : 1;            /*!< [9..9] Low power timer 1 reset                                            */
            uint32            : 1;
      __IOM uint32 WWDGRST    : 1;            /*!< [11..11] Window watchdog reset                                            */
            uint32            : 2;
      __IOM uint32 SPI2RST    : 1;            /*!< [14..14] SPI 2 reset                                                      */
      __IOM uint32 SPI3RST    : 1;            /*!< [15..15] SPI 3 reset                                                      */
      __IOM uint32 SPDIFRXRST : 1;            /*!< [16..16] SPDIF-RX reset                                                   */
      __IOM uint32 UART2RST   : 1;            /*!< [17..17] USART 2 reset                                                    */
      __IOM uint32 UART3RST   : 1;            /*!< [18..18] USART 3 reset                                                    */
      __IOM uint32 UART4RST   : 1;            /*!< [19..19] USART 4 reset                                                    */
      __IOM uint32 UART5RST   : 1;            /*!< [20..20] USART 5 reset                                                    */
      __IOM uint32 I2C1RST    : 1;            /*!< [21..21] I2C 1 reset                                                      */
      __IOM uint32 I2C2RST    : 1;            /*!< [22..22] I2C 2 reset                                                      */
      __IOM uint32 I2C3RST    : 1;            /*!< [23..23] I2C3 reset                                                       */
      __IOM uint32 I2C4RST    : 1;            /*!< [24..24] I2C 4 reset                                                      */
      __IOM uint32 CAN1RST    : 1;            /*!< [25..25] CAN1 reset                                                       */
      __IOM uint32 CAN2RST    : 1;            /*!< [26..26] CAN2 reset                                                       */
      __IOM uint32 CECRST     : 1;            /*!< [27..27] HDMI-CEC reset                                                   */
      __IOM uint32 PWRRST     : 1;            /*!< [28..28] Power interface reset                                            */
      __IOM uint32 DACRST     : 1;            /*!< [29..29] DAC reset                                                        */
      __IOM uint32 UART7RST   : 1;            /*!< [30..30] UART7 reset                                                      */
      __IOM uint32 UART8RST   : 1;            /*!< [31..31] UART8 reset                                                      */
    } bit;
  } APB1RSTR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) APB2 peripheral reset register                             */
    
    struct {
      __IOM uint32 TIM1RST    : 1;            /*!< [0..0] TIM1 reset                                                         */
      __IOM uint32 TIM8RST    : 1;            /*!< [1..1] TIM8 reset                                                         */
            uint32            : 2;
      __IOM uint32 USART1RST  : 1;            /*!< [4..4] USART1 reset                                                       */
      __IOM uint32 USART6RST  : 1;            /*!< [5..5] USART6 reset                                                       */
            uint32            : 2;
      __IOM uint32 ADCRST     : 1;            /*!< [8..8] ADC interface reset (common to all ADCs)                           */
            uint32            : 2;
      __IOM uint32 SDMMC1RST  : 1;            /*!< [11..11] SDMMC1 reset                                                     */
      __IOM uint32 SPI1RST    : 1;            /*!< [12..12] SPI 1 reset                                                      */
      __IOM uint32 SPI4RST    : 1;            /*!< [13..13] SPI4 reset                                                       */
      __IOM uint32 SYSCFGRST  : 1;            /*!< [14..14] System configuration controller reset                            */
            uint32            : 1;
      __IOM uint32 TIM9RST    : 1;            /*!< [16..16] TIM9 reset                                                       */
      __IOM uint32 TIM10RST   : 1;            /*!< [17..17] TIM10 reset                                                      */
      __IOM uint32 TIM11RST   : 1;            /*!< [18..18] TIM11 reset                                                      */
            uint32            : 1;
      __IOM uint32 SPI5RST    : 1;            /*!< [20..20] SPI5 reset                                                       */
      __IOM uint32 SPI6RST    : 1;            /*!< [21..21] SPI6 reset                                                       */
      __IOM uint32 SAI1RST    : 1;            /*!< [22..22] SAI1 reset                                                       */
      __IOM uint32 SAI2RST    : 1;            /*!< [23..23] SAI2 reset                                                       */
            uint32            : 2;
      __IOM uint32 LTDCRST    : 1;            /*!< [26..26] LTDC reset                                                       */
            uint32            : 5;
    } bit;
  } APB2RSTR;
  __IM  uint32  RESERVED1[2];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000030) AHB1 peripheral clock register                             */
    
