Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 GPIOAEN    : 1;            /*!< [0..0] IO port A clock enable                                             */
      __IOM uint32 GPIOBEN    : 1;            /*!< [1..1] IO port B clock enable                                             */
      __IOM uint32 GPIOCEN    : 1;            /*!< [2..2] IO port C clock enable                                             */
      __IOM uint32 GPIODEN    : 1;            /*!< [3..3] IO port D clock enable                                             */
      __IOM uint32 GPIOEEN    : 1;            /*!< [4..4] IO port E clock enable                                             */
      __IOM uint32 GPIOFEN    : 1;            /*!< [5..5] IO port F clock enable                                             */
      __IOM uint32 GPIOGEN    : 1;            /*!< [6..6] IO port G clock enable                                             */
      __IOM uint32 GPIOHEN    : 1;            /*!< [7..7] IO port H clock enable                                             */
      __IOM uint32 GPIOIEN    : 1;            /*!< [8..8] IO port I clock enable                                             */
      __IOM uint32 GPIOJEN    : 1;            /*!< [9..9] IO port J clock enable                                             */
      __IOM uint32 GPIOKEN    : 1;            /*!< [10..10] IO port K clock enable                                           */
            uint32            : 1;
      __IOM uint32 CRCEN      : 1;            /*!< [12..12] CRC clock enable                                                 */
            uint32            : 5;
      __IOM uint32 BKPSRAMEN  : 1;            /*!< [18..18] Backup SRAM interface clock enable                               */
            uint32            : 1;
      __IOM uint32 CCMDATARAMEN : 1;          /*!< [20..20] CCM data RAM clock enable                                        */
      __IOM uint32 DMA1EN     : 1;            /*!< [21..21] DMA1 clock enable                                                */
      __IOM uint32 DMA2EN     : 1;            /*!< [22..22] DMA2 clock enable                                                */
      __IOM uint32 DMA2DEN    : 1;            /*!< [23..23] DMA2D clock enable                                               */
            uint32            : 1;
      __IOM uint32 ETHMACEN   : 1;            /*!< [25..25] Ethernet MAC clock enable                                        */
      __IOM uint32 ETHMACTXEN : 1;            /*!< [26..26] Ethernet Transmission clock enable                               */
      __IOM uint32 ETHMACRXEN : 1;            /*!< [27..27] Ethernet Reception clock enable                                  */
      __IOM uint32 ETHMACPTPEN : 1;           /*!< [28..28] Ethernet PTP clock enable                                        */
      __IOM uint32 OTGHSEN    : 1;            /*!< [29..29] USB OTG HS clock enable                                          */
      __IOM uint32 OTGHSULPIEN : 1;           /*!< [30..30] USB OTG HSULPI clock enable                                      */
            uint32            : 1;
    } bit;
  } AHB1ENR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) AHB2 peripheral clock enable register                      */
    
    struct {
      __IOM uint32 DCMIEN     : 1;            /*!< [0..0] Camera interface enable                                            */
            uint32            : 3;
      __IOM uint32 CRYPEN     : 1;            /*!< [4..4] Cryptographic modules clock enable                                 */
      __IOM uint32 HASHEN     : 1;            /*!< [5..5] Hash modules clock enable                                          */
      __IOM uint32 RNGEN      : 1;            /*!< [6..6] Random number generator clock enable                               */
      __IOM uint32 OTGFSEN    : 1;            /*!< [7..7] USB OTG FS clock enable                                            */
            uint32            : 24;
    } bit;
  } AHB2ENR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000038) AHB3 peripheral clock enable register                      */
    
    struct {
      __IOM uint32 FMCEN      : 1;            /*!< [0..0] Flexible memory controller module clock enable                     */
      __IOM uint32 QSPIEN     : 1;            /*!< [1..1] Quad SPI memory controller clock enable                            */
            uint32            : 30;
    } bit;
  } AHB3ENR;
  __IM  uint32  RESERVED2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000040) APB1 peripheral clock enable register                      */
    
    struct {
      __IOM uint32 TIM2EN     : 1;            /*!< [0..0] TIM2 clock enable                                                  */
      __IOM uint32 TIM3EN     : 1;            /*!< [1..1] TIM3 clock enable                                                  */
      __IOM uint32 TIM4EN     : 1;            /*!< [2..2] TIM4 clock enable                                                  */
      __IOM uint32 TIM5EN     : 1;            /*!< [3..3] TIM5 clock enable                                                  */
      __IOM uint32 TIM6EN     : 1;            /*!< [4..4] TIM6 clock enable                                                  */
      __IOM uint32 TIM7EN     : 1;            /*!< [5..5] TIM7 clock enable                                                  */
      __IOM uint32 TIM12EN    : 1;            /*!< [6..6] TIM12 clock enable                                                 */
      __IOM uint32 TIM13EN    : 1;            /*!< [7..7] TIM13 clock enable                                                 */
      __IOM uint32 TIM14EN    : 1;            /*!< [8..8] TIM14 clock enable                                                 */
      __IOM uint32 LPTMI1EN   : 1;            /*!< [9..9] Low power timer 1 clock enable                                     */
            uint32            : 1;
      __IOM uint32 WWDGEN     : 1;            /*!< [11..11] Window watchdog clock enable                                     */
            uint32            : 2;
      __IOM uint32 SPI2EN     : 1;            /*!< [14..14] SPI2 clock enable                                                */
      __IOM uint32 SPI3EN     : 1;            /*!< [15..15] SPI3 clock enable                                                */
      __IOM uint32 SPDIFRXEN  : 1;            /*!< [16..16] SPDIF-RX clock enable                                            */
      __IOM uint32 USART2EN   : 1;            /*!< [17..17] USART 2 clock enable                                             */
      __IOM uint32 USART3EN   : 1;            /*!< [18..18] USART3 clock enable                                              */
      __IOM uint32 UART4EN    : 1;            /*!< [19..19] UART4 clock enable                                               */
      __IOM uint32 UART5EN    : 1;            /*!< [20..20] UART5 clock enable                                               */
      __IOM uint32 I2C1EN     : 1;            /*!< [21..21] I2C1 clock enable                                                */
      __IOM uint32 I2C2EN     : 1;            /*!< [22..22] I2C2 clock enable                                                */
      __IOM uint32 I2C3EN     : 1;            /*!< [23..23] I2C3 clock enable                                                */
      __IOM uint32 I2C4EN     : 1;            /*!< [24..24] I2C4 clock enable                                                */
      __IOM uint32 CAN1EN     : 1;            /*!< [25..25] CAN 1 clock enable                                               */
      __IOM uint32 CAN2EN     : 1;            /*!< [26..26] CAN 2 clock enable                                               */
      __IOM uint32 CECEN      : 1;            /*!< [27..27] HDMI-CEN clock enable                                            */
      __IOM uint32 PWREN      : 1;            /*!< [28..28] Power interface clock enable                                     */
      __IOM uint32 DACEN      : 1;            /*!< [29..29] DAC interface clock enable                                       */
      __IOM uint32 UART7ENR   : 1;            /*!< [30..30] UART7 clock enable                                               */
      __IOM uint32 UART8ENR   : 1;            /*!< [31..31] UART8 clock enable                                               */
    } bit;
  } APB1ENR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000044) APB2 peripheral clock enable register                      */
    
