Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 TIM1EN     : 1;            /*!< [0..0] TIM1 clock enable                                                  */
      __IOM uint32 TIM8EN     : 1;            /*!< [1..1] TIM8 clock enable                                                  */
            uint32            : 2;
      __IOM uint32 USART1EN   : 1;            /*!< [4..4] USART1 clock enable                                                */
      __IOM uint32 USART6EN   : 1;            /*!< [5..5] USART6 clock enable                                                */
            uint32            : 2;
      __IOM uint32 ADC1EN     : 1;            /*!< [8..8] ADC1 clock enable                                                  */
      __IOM uint32 ADC2EN     : 1;            /*!< [9..9] ADC2 clock enable                                                  */
      __IOM uint32 ADC3EN     : 1;            /*!< [10..10] ADC3 clock enable                                                */
      __IOM uint32 SDMMC1EN   : 1;            /*!< [11..11] SDMMC1 clock enable                                              */
      __IOM uint32 SPI1EN     : 1;            /*!< [12..12] SPI1 clock enable                                                */
      __IOM uint32 SPI4ENR    : 1;            /*!< [13..13] SPI4 clock enable                                                */
      __IOM uint32 SYSCFGEN   : 1;            /*!< [14..14] System configuration controller clock enable                     */
            uint32            : 1;
      __IOM uint32 TIM9EN     : 1;            /*!< [16..16] TIM9 clock enable                                                */
      __IOM uint32 TIM10EN    : 1;            /*!< [17..17] TIM10 clock enable                                               */
      __IOM uint32 TIM11EN    : 1;            /*!< [18..18] TIM11 clock enable                                               */
            uint32            : 1;
      __IOM uint32 SPI5ENR    : 1;            /*!< [20..20] SPI5 clock enable                                                */
      __IOM uint32 SPI6ENR    : 1;            /*!< [21..21] SPI6 clock enable                                                */
      __IOM uint32 SAI1EN     : 1;            /*!< [22..22] SAI1 clock enable                                                */
      __IOM uint32 SAI2EN     : 1;            /*!< [23..23] SAI2 clock enable                                                */
            uint32            : 2;
      __IOM uint32 LTDCEN     : 1;            /*!< [26..26] LTDC clock enable                                                */
            uint32            : 5;
    } bit;
  } APB2ENR;
  __IM  uint32  RESERVED3[2];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000050) AHB1 peripheral clock enable in low power mode
                                                                    register                                                   */
    
    struct {
      __IOM uint32 GPIOALPEN  : 1;            /*!< [0..0] IO port A clock enable during sleep mode                           */
      __IOM uint32 GPIOBLPEN  : 1;            /*!< [1..1] IO port B clock enable during Sleep mode                           */
      __IOM uint32 GPIOCLPEN  : 1;            /*!< [2..2] IO port C clock enable during Sleep mode                           */
      __IOM uint32 GPIODLPEN  : 1;            /*!< [3..3] IO port D clock enable during Sleep mode                           */
      __IOM uint32 GPIOELPEN  : 1;            /*!< [4..4] IO port E clock enable during Sleep mode                           */
      __IOM uint32 GPIOFLPEN  : 1;            /*!< [5..5] IO port F clock enable during Sleep mode                           */
      __IOM uint32 GPIOGLPEN  : 1;            /*!< [6..6] IO port G clock enable during Sleep mode                           */
      __IOM uint32 GPIOHLPEN  : 1;            /*!< [7..7] IO port H clock enable during Sleep mode                           */
      __IOM uint32 GPIOILPEN  : 1;            /*!< [8..8] IO port I clock enable during Sleep mode                           */
      __IOM uint32 GPIOJLPEN  : 1;            /*!< [9..9] IO port J clock enable during Sleep mode                           */
      __IOM uint32 GPIOKLPEN  : 1;            /*!< [10..10] IO port K clock enable during Sleep mode                         */
            uint32            : 1;
      __IOM uint32 CRCLPEN    : 1;            /*!< [12..12] CRC clock enable during Sleep mode                               */
            uint32            : 2;
      __IOM uint32 FLITFLPEN  : 1;            /*!< [15..15] Flash interface clock enable during Sleep mode                   */
      __IOM uint32 SRAM1LPEN  : 1;            /*!< [16..16] SRAM 1interface clock enable during Sleep mode                   */
      __IOM uint32 SRAM2LPEN  : 1;            /*!< [17..17] SRAM 2 interface clock enable during Sleep mode                  */
      __IOM uint32 BKPSRAMLPEN : 1;           /*!< [18..18] Backup SRAM interface clock enable during Sleep mode             */
      __IOM uint32 SRAM3LPEN  : 1;            /*!< [19..19] SRAM 3 interface clock enable during Sleep mode                  */
            uint32            : 1;
      __IOM uint32 DMA1LPEN   : 1;            /*!< [21..21] DMA1 clock enable during Sleep mode                              */
      __IOM uint32 DMA2LPEN   : 1;            /*!< [22..22] DMA2 clock enable during Sleep mode                              */
      __IOM uint32 DMA2DLPEN  : 1;            /*!< [23..23] DMA2D clock enable during Sleep mode                             */
            uint32            : 1;
      __IOM uint32 ETHMACLPEN : 1;            /*!< [25..25] Ethernet MAC clock enable during Sleep mode                      */
      __IOM uint32 ETHMACTXLPEN : 1;          /*!< [26..26] Ethernet transmission clock enable during Sleep mode             */
      __IOM uint32 ETHMACRXLPEN : 1;          /*!< [27..27] Ethernet reception clock enable during Sleep mode                */
      __IOM uint32 ETHMACPTPLPEN : 1;         /*!< [28..28] Ethernet PTP clock enable during Sleep mode                      */
      __IOM uint32 OTGHSLPEN  : 1;            /*!< [29..29] USB OTG HS clock enable during Sleep mode                        */
      __IOM uint32 OTGHSULPILPEN : 1;         /*!< [30..30] USB OTG HS ULPI clock enable during Sleep mode                   */
            uint32            : 1;
    } bit;
  } AHB1LPENR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000054) AHB2 peripheral clock enable in low power mode
                                                                    register                                                   */
    
