Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 DCMILPEN   : 1;            /*!< [0..0] Camera interface enable during Sleep mode                          */
            uint32            : 3;
      __IOM uint32 CRYPLPEN   : 1;            /*!< [4..4] Cryptography modules clock enable during Sleep mode                */
      __IOM uint32 HASHLPEN   : 1;            /*!< [5..5] Hash modules clock enable during Sleep mode                        */
      __IOM uint32 RNGLPEN    : 1;            /*!< [6..6] Random number generator clock enable during Sleep mode             */
      __IOM uint32 OTGFSLPEN  : 1;            /*!< [7..7] USB OTG FS clock enable during Sleep mode                          */
            uint32            : 24;
    } bit;
  } AHB2LPENR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000058) AHB3 peripheral clock enable in low power mode
                                                                    register                                                   */
    
    struct {
      __IOM uint32 FMCLPEN    : 1;            /*!< [0..0] Flexible memory controller module clock enable during
                                                     Sleep mode                                                                */
      __IOM uint32 QSPILPEN   : 1;            /*!< [1..1] Quand SPI memory controller clock enable during Sleep
                                                     mode                                                                      */
            uint32            : 30;
    } bit;
  } AHB3LPENR;
  __IM  uint32  RESERVED4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000060) APB1 peripheral clock enable in low power mode
                                                                    register                                                   */
    
    struct {
      __IOM uint32 TIM2LPEN   : 1;            /*!< [0..0] TIM2 clock enable during Sleep mode                                */
      __IOM uint32 TIM3LPEN   : 1;            /*!< [1..1] TIM3 clock enable during Sleep mode                                */
      __IOM uint32 TIM4LPEN   : 1;            /*!< [2..2] TIM4 clock enable during Sleep mode                                */
      __IOM uint32 TIM5LPEN   : 1;            /*!< [3..3] TIM5 clock enable during Sleep mode                                */
      __IOM uint32 TIM6LPEN   : 1;            /*!< [4..4] TIM6 clock enable during Sleep mode                                */
      __IOM uint32 TIM7LPEN   : 1;            /*!< [5..5] TIM7 clock enable during Sleep mode                                */
      __IOM uint32 TIM12LPEN  : 1;            /*!< [6..6] TIM12 clock enable during Sleep mode                               */
      __IOM uint32 TIM13LPEN  : 1;            /*!< [7..7] TIM13 clock enable during Sleep mode                               */
      __IOM uint32 TIM14LPEN  : 1;            /*!< [8..8] TIM14 clock enable during Sleep mode                               */
      __IOM uint32 LPTIM1LPEN : 1;            /*!< [9..9] low power timer 1 clock enable during Sleep mode                   */
            uint32            : 1;
      __IOM uint32 WWDGLPEN   : 1;            /*!< [11..11] Window watchdog clock enable during Sleep mode                   */
            uint32            : 2;
      __IOM uint32 SPI2LPEN   : 1;            /*!< [14..14] SPI2 clock enable during Sleep mode                              */
      __IOM uint32 SPI3LPEN   : 1;            /*!< [15..15] SPI3 clock enable during Sleep mode                              */
      __IOM uint32 SPDIFRXLPEN : 1;           /*!< [16..16] SPDIF-RX clock enable during sleep mode                          */
      __IOM uint32 USART2LPEN : 1;            /*!< [17..17] USART2 clock enable during Sleep mode                            */
      __IOM uint32 USART3LPEN : 1;            /*!< [18..18] USART3 clock enable during Sleep mode                            */
      __IOM uint32 UART4LPEN  : 1;            /*!< [19..19] UART4 clock enable during Sleep mode                             */
      __IOM uint32 UART5LPEN  : 1;            /*!< [20..20] UART5 clock enable during Sleep mode                             */
      __IOM uint32 I2C1LPEN   : 1;            /*!< [21..21] I2C1 clock enable during Sleep mode                              */
      __IOM uint32 I2C2LPEN   : 1;            /*!< [22..22] I2C2 clock enable during Sleep mode                              */
      __IOM uint32 I2C3LPEN   : 1;            /*!< [23..23] I2C3 clock enable during Sleep mode                              */
      __IOM uint32 I2C4LPEN   : 1;            /*!< [24..24] I2C4 clock enable during Sleep mode                              */
      __IOM uint32 CAN1LPEN   : 1;            /*!< [25..25] CAN 1 clock enable during Sleep mode                             */
      __IOM uint32 CAN2LPEN   : 1;            /*!< [26..26] CAN 2 clock enable during Sleep mode                             */
      __IOM uint32 CECLPEN    : 1;            /*!< [27..27] HDMI-CEN clock enable during Sleep mode                          */
      __IOM uint32 PWRLPEN    : 1;            /*!< [28..28] Power interface clock enable during Sleep mode                   */
      __IOM uint32 DACLPEN    : 1;            /*!< [29..29] DAC interface clock enable during Sleep mode                     */
      __IOM uint32 UART7LPEN  : 1;            /*!< [30..30] UART7 clock enable during Sleep mode                             */
      __IOM uint32 UART8LPEN  : 1;            /*!< [31..31] UART8 clock enable during Sleep mode                             */
    } bit;
  } APB1LPENR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000064) APB2 peripheral clock enabled in low power mode
                                                                    register                                                   */
    
    struct {
      __IOM uint32 TIM1LPEN   : 1;            /*!< [0..0] TIM1 clock enable during Sleep mode                                */
      __IOM uint32 TIM8LPEN   : 1;            /*!< [1..1] TIM8 clock enable during Sleep mode                                */
            uint32            : 2;
      __IOM uint32 USART1LPEN : 1;            /*!< [4..4] USART1 clock enable during Sleep mode                              */
      __IOM uint32 USART6LPEN : 1;            /*!< [5..5] USART6 clock enable during Sleep mode                              */
            uint32            : 2;
      __IOM uint32 ADC1LPEN   : 1;            /*!< [8..8] ADC1 clock enable during Sleep mode                                */
      __IOM uint32 ADC2LPEN   : 1;            /*!< [9..9] ADC2 clock enable during Sleep mode                                */
      __IOM uint32 ADC3LPEN   : 1;            /*!< [10..10] ADC 3 clock enable during Sleep mode                             */
      __IOM uint32 SDMMC1LPEN : 1;            /*!< [11..11] SDMMC1 clock enable during Sleep mode                            */
      __IOM uint32 SPI1LPEN   : 1;            /*!< [12..12] SPI 1 clock enable during Sleep mode                             */
      __IOM uint32 SPI4LPEN   : 1;            /*!< [13..13] SPI 4 clock enable during Sleep mode                             */
      __IOM uint32 SYSCFGLPEN : 1;            /*!< [14..14] System configuration controller clock enable during
                                                     Sleep mode                                                                */
            uint32            : 1;
      __IOM uint32 TIM9LPEN   : 1;            /*!< [16..16] TIM9 clock enable during sleep mode                              */
      __IOM uint32 TIM10LPEN  : 1;            /*!< [17..17] TIM10 clock enable during Sleep mode                             */
      __IOM uint32 TIM11LPEN  : 1;            /*!< [18..18] TIM11 clock enable during Sleep mode                             */
            uint32            : 1;
      __IOM uint32 SPI5LPEN   : 1;            /*!< [20..20] SPI 5 clock enable during Sleep mode                             */
      __IOM uint32 SPI6LPEN   : 1;            /*!< [21..21] SPI 6 clock enable during Sleep mode                             */
      __IOM uint32 SAI1LPEN   : 1;            /*!< [22..22] SAI1 clock enable during sleep mode                              */
      __IOM uint32 SAI2LPEN   : 1;            /*!< [23..23] SAI2 clock enable during sleep mode                              */
            uint32            : 2;
      __IOM uint32 LTDCLPEN   : 1;            /*!< [26..26] LTDC clock enable during sleep mode                              */
            uint32            : 5;
    } bit;
  } APB2LPENR;
  __IM  uint32  RESERVED5[2];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000070) Backup domain control register                             */
    
