Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 LSEON      : 1;            /*!< [0..0] External low-speed oscillator enable                               */
      __IM  uint32 LSERDY     : 1;            /*!< [1..1] External low-speed oscillator ready                                */
      __IOM uint32 LSEBYP     : 1;            /*!< [2..2] External low-speed oscillator bypass                               */
            uint32            : 5;
      __IOM uint32 RTCSEL0    : 1;            /*!< [8..8] RTC clock source selection                                         */
      __IOM uint32 RTCSEL1    : 1;            /*!< [9..9] RTC clock source selection                                         */
            uint32            : 5;
      __IOM uint32 RTCEN      : 1;            /*!< [15..15] RTC clock enable                                                 */
      __IOM uint32 BDRST      : 1;            /*!< [16..16] Backup domain software reset                                     */
            uint32            : 15;
    } bit;
  } BDCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000074) clock control & status register                            */
    
    struct {
      __IOM uint32 LSION      : 1;            /*!< [0..0] Internal low-speed oscillator enable                               */
      __IM  uint32 LSIRDY     : 1;            /*!< [1..1] Internal low-speed oscillator ready                                */
            uint32            : 22;
      __IOM uint32 RMVF       : 1;            /*!< [24..24] Remove reset flag                                                */
      __IOM uint32 BORRSTF    : 1;            /*!< [25..25] BOR reset flag                                                   */
      __IOM uint32 PADRSTF    : 1;            /*!< [26..26] PIN reset flag                                                   */
      __IOM uint32 PORRSTF    : 1;            /*!< [27..27] POR/PDR reset flag                                               */
      __IOM uint32 SFTRSTF    : 1;            /*!< [28..28] Software reset flag                                              */
      __IOM uint32 WDGRSTF    : 1;            /*!< [29..29] Independent watchdog reset flag                                  */
      __IOM uint32 WWDGRSTF   : 1;            /*!< [30..30] Window watchdog reset flag                                       */
      __IOM uint32 LPWRRSTF   : 1;            /*!< [31..31] Low-power reset flag                                             */
    } bit;
  } CSR;
  __IM  uint32  RESERVED6[2];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000080) spread spectrum clock generation register                  */
    
    struct {
      __IOM uint32 MODPER     : 13;           /*!< [12..0] Modulation period                                                 */
      __IOM uint32 INCSTEP    : 15;           /*!< [27..13] Incrementation step                                              */
            uint32            : 2;
      __IOM uint32 SPREADSEL  : 1;            /*!< [30..30] Spread Select                                                    */
      __IOM uint32 SSCGEN     : 1;            /*!< [31..31] Spread spectrum modulation enable                                */
    } bit;
  } SSCGR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000084) PLLI2S configuration register                              */
    
    struct {
            uint32            : 6;
      __IOM uint32 PLLI2SN    : 9;            /*!< [14..6] PLLI2S multiplication factor for VCO                              */
            uint32            : 9;
      __IOM uint32 PLLI2SQ    : 4;            /*!< [27..24] PLLI2S division factor for SAI1 clock                            */
      __IOM uint32 PLLI2SR    : 3;            /*!< [30..28] PLLI2S division factor for I2S clocks                            */
            uint32            : 1;
    } bit;
  } PLLI2SCFGR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000088) PLL configuration register                                 */
    
    struct {
            uint32            : 6;
      __IOM uint32 PLLSAIN    : 9;            /*!< [14..6] PLLSAI division factor for VCO                                    */
            uint32            : 1;
      __IOM uint32 PLLSAIP    : 2;            /*!< [17..16] PLLSAI division factor for 48MHz clock                           */
            uint32            : 6;
      __IOM uint32 PLLSAIQ    : 4;            /*!< [27..24] PLLSAI division factor for SAI clock                             */
      __IOM uint32 PLLSAIR    : 3;            /*!< [30..28] PLLSAI division factor for LCD clock                             */
            uint32            : 1;
    } bit;
  } PLLSAICFGR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000008C) dedicated clocks configuration register                    */
    
    struct {
      __IOM uint32 PLLI2SDIV  : 5;            /*!< [4..0] PLLI2S division factor for SAI1 clock                              */
            uint32            : 3;
      __IOM uint32 PLLSAIDIVQ : 5;            /*!< [12..8] PLLSAI division factor for SAI1 clock                             */
            uint32            : 3;
      __IOM uint32 PLLSAIDIVR : 2;            /*!< [17..16] division factor for LCD_CLK                                      */
            uint32            : 2;
      __IOM uint32 SAI1SEL    : 2;            /*!< [21..20] SAI1 clock source selection                                      */
      __IOM uint32 SAI2SEL    : 2;            /*!< [23..22] SAI2 clock source selection                                      */
      __IOM uint32 TIMPRE     : 1;            /*!< [24..24] Timers clocks prescalers selection                               */
            uint32            : 7;
    } bit;
  } DKCFGR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000090) dedicated clocks configuration register                    */
    
