Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 USART1SEL  : 2;            /*!< [1..0] USART 1 clock source selection                                     */
      __IOM uint32 USART2SEL  : 2;            /*!< [3..2] USART 2 clock source selection                                     */
      __IOM uint32 USART3SEL  : 2;            /*!< [5..4] USART 3 clock source selection                                     */
      __IOM uint32 UART4SEL   : 2;            /*!< [7..6] UART 4 clock source selection                                      */
      __IOM uint32 UART5SEL   : 2;            /*!< [9..8] UART 5 clock source selection                                      */
      __IOM uint32 USART6SEL  : 2;            /*!< [11..10] USART 6 clock source selection                                   */
      __IOM uint32 UART7SEL   : 2;            /*!< [13..12] UART 7 clock source selection                                    */
      __IOM uint32 UART8SEL   : 2;            /*!< [15..14] UART 8 clock source selection                                    */
      __IOM uint32 I2C1SEL    : 2;            /*!< [17..16] I2C1 clock source selection                                      */
      __IOM uint32 I2C2SEL    : 2;            /*!< [19..18] I2C2 clock source selection                                      */
      __IOM uint32 I2C3SEL    : 2;            /*!< [21..20] I2C3 clock source selection                                      */
      __IOM uint32 I2C4SEL    : 2;            /*!< [23..22] I2C4 clock source selection                                      */
      __IOM uint32 LPTIM1SEL  : 2;            /*!< [25..24] Low power timer 1 clock source selection                         */
      __IOM uint32 CECSEL     : 1;            /*!< [26..26] HDMI-CEC clock source selection                                  */
      __IOM uint32 CK48MSEL   : 1;            /*!< [27..27] 48MHz clock source selection                                     */
      __IOM uint32 SDMMCSEL   : 1;            /*!< [28..28] SDMMC clock source selection                                     */
            uint32            : 3;
    } bit;
  } DKCFGR2;
} RCC_Type;                                     /*!< Size = 148 (0x94)                                                         */



/* =========================================================================================================================== */
/* ================                                           GPIOD                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOD)
  */

typedef struct {                                /*!< (@ 0x40020C00) GPIOD Structure                                            */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) GPIO port mode register                                    */
    
    struct {
      __IOM uint32 MODER0     : 2;            /*!< [1..0] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 MODER1     : 2;            /*!< [3..2] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 MODER2     : 2;            /*!< [5..4] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 MODER3     : 2;            /*!< [7..6] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 MODER4     : 2;            /*!< [9..8] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 MODER5     : 2;            /*!< [11..10] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 MODER6     : 2;            /*!< [13..12] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 MODER7     : 2;            /*!< [15..14] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 MODER8     : 2;            /*!< [17..16] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 MODER9     : 2;            /*!< [19..18] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 MODER10    : 2;            /*!< [21..20] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 MODER11    : 2;            /*!< [23..22] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 MODER12    : 2;            /*!< [25..24] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 MODER13    : 2;            /*!< [27..26] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 MODER14    : 2;            /*!< [29..28] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 MODER15    : 2;            /*!< [31..30] Port x configuration bits (y = 0..15)                            */
    } bit;
  } MODER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) GPIO port output type register                             */
    
    struct {
      __IOM uint32 OT0        : 1;            /*!< [0..0] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OT1        : 1;            /*!< [1..1] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OT2        : 1;            /*!< [2..2] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OT3        : 1;            /*!< [3..3] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OT4        : 1;            /*!< [4..4] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OT5        : 1;            /*!< [5..5] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OT6        : 1;            /*!< [6..6] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OT7        : 1;            /*!< [7..7] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OT8        : 1;            /*!< [8..8] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OT9        : 1;            /*!< [9..9] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OT10       : 1;            /*!< [10..10] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OT11       : 1;            /*!< [11..11] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OT12       : 1;            /*!< [12..12] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OT13       : 1;            /*!< [13..13] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OT14       : 1;            /*!< [14..14] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OT15       : 1;            /*!< [15..15] Port x configuration bits (y = 0..15)                            */
            uint32            : 16;
    } bit;
  } OTYPER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) GPIO port output speed register                            */
    
