Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 OSPEEDR0   : 2;            /*!< [1..0] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OSPEEDR1   : 2;            /*!< [3..2] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OSPEEDR2   : 2;            /*!< [5..4] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OSPEEDR3   : 2;            /*!< [7..6] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OSPEEDR4   : 2;            /*!< [9..8] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 OSPEEDR5   : 2;            /*!< [11..10] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OSPEEDR6   : 2;            /*!< [13..12] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OSPEEDR7   : 2;            /*!< [15..14] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OSPEEDR8   : 2;            /*!< [17..16] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OSPEEDR9   : 2;            /*!< [19..18] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OSPEEDR10  : 2;            /*!< [21..20] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OSPEEDR11  : 2;            /*!< [23..22] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OSPEEDR12  : 2;            /*!< [25..24] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OSPEEDR13  : 2;            /*!< [27..26] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OSPEEDR14  : 2;            /*!< [29..28] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 OSPEEDR15  : 2;            /*!< [31..30] Port x configuration bits (y = 0..15)                            */
    } bit;
  } OSPEEDR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) GPIO port pull-up/pull-down register                       */
    
    struct {
      __IOM uint32 PUPDR0     : 2;            /*!< [1..0] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 PUPDR1     : 2;            /*!< [3..2] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 PUPDR2     : 2;            /*!< [5..4] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 PUPDR3     : 2;            /*!< [7..6] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 PUPDR4     : 2;            /*!< [9..8] Port x configuration bits (y = 0..15)                              */
      __IOM uint32 PUPDR5     : 2;            /*!< [11..10] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 PUPDR6     : 2;            /*!< [13..12] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 PUPDR7     : 2;            /*!< [15..14] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 PUPDR8     : 2;            /*!< [17..16] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 PUPDR9     : 2;            /*!< [19..18] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 PUPDR10    : 2;            /*!< [21..20] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 PUPDR11    : 2;            /*!< [23..22] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 PUPDR12    : 2;            /*!< [25..24] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 PUPDR13    : 2;            /*!< [27..26] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 PUPDR14    : 2;            /*!< [29..28] Port x configuration bits (y = 0..15)                            */
      __IOM uint32 PUPDR15    : 2;            /*!< [31..30] Port x configuration bits (y = 0..15)                            */
    } bit;
  } PUPDR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000010) GPIO port input data register                              */
    
    struct {
      __IM  uint32 IDR0       : 1;            /*!< [0..0] Port input data (y = 0..15)                                        */
      __IM  uint32 IDR1       : 1;            /*!< [1..1] Port input data (y = 0..15)                                        */
      __IM  uint32 IDR2       : 1;            /*!< [2..2] Port input data (y = 0..15)                                        */
      __IM  uint32 IDR3       : 1;            /*!< [3..3] Port input data (y = 0..15)                                        */
      __IM  uint32 IDR4       : 1;            /*!< [4..4] Port input data (y = 0..15)                                        */
      __IM  uint32 IDR5       : 1;            /*!< [5..5] Port input data (y = 0..15)                                        */
      __IM  uint32 IDR6       : 1;            /*!< [6..6] Port input data (y = 0..15)                                        */
      __IM  uint32 IDR7       : 1;            /*!< [7..7] Port input data (y = 0..15)                                        */
      __IM  uint32 IDR8       : 1;            /*!< [8..8] Port input data (y = 0..15)                                        */
      __IM  uint32 IDR9       : 1;            /*!< [9..9] Port input data (y = 0..15)                                        */
      __IM  uint32 IDR10      : 1;            /*!< [10..10] Port input data (y = 0..15)                                      */
      __IM  uint32 IDR11      : 1;            /*!< [11..11] Port input data (y = 0..15)                                      */
      __IM  uint32 IDR12      : 1;            /*!< [12..12] Port input data (y = 0..15)                                      */
      __IM  uint32 IDR13      : 1;            /*!< [13..13] Port input data (y = 0..15)                                      */
      __IM  uint32 IDR14      : 1;            /*!< [14..14] Port input data (y = 0..15)                                      */
      __IM  uint32 IDR15      : 1;            /*!< [15..15] Port input data (y = 0..15)                                      */
            uint32            : 16;
    } bit;
  } IDR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) GPIO port output data register                             */
    
