Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 ODR0       : 1;            /*!< [0..0] Port output data (y = 0..15)                                       */
      __IOM uint32 ODR1       : 1;            /*!< [1..1] Port output data (y = 0..15)                                       */
      __IOM uint32 ODR2       : 1;            /*!< [2..2] Port output data (y = 0..15)                                       */
      __IOM uint32 ODR3       : 1;            /*!< [3..3] Port output data (y = 0..15)                                       */
      __IOM uint32 ODR4       : 1;            /*!< [4..4] Port output data (y = 0..15)                                       */
      __IOM uint32 ODR5       : 1;            /*!< [5..5] Port output data (y = 0..15)                                       */
      __IOM uint32 ODR6       : 1;            /*!< [6..6] Port output data (y = 0..15)                                       */
      __IOM uint32 ODR7       : 1;            /*!< [7..7] Port output data (y = 0..15)                                       */
      __IOM uint32 ODR8       : 1;            /*!< [8..8] Port output data (y = 0..15)                                       */
      __IOM uint32 ODR9       : 1;            /*!< [9..9] Port output data (y = 0..15)                                       */
      __IOM uint32 ODR10      : 1;            /*!< [10..10] Port output data (y = 0..15)                                     */
      __IOM uint32 ODR11      : 1;            /*!< [11..11] Port output data (y = 0..15)                                     */
      __IOM uint32 ODR12      : 1;            /*!< [12..12] Port output data (y = 0..15)                                     */
      __IOM uint32 ODR13      : 1;            /*!< [13..13] Port output data (y = 0..15)                                     */
      __IOM uint32 ODR14      : 1;            /*!< [14..14] Port output data (y = 0..15)                                     */
      __IOM uint32 ODR15      : 1;            /*!< [15..15] Port output data (y = 0..15)                                     */
            uint32            : 16;
    } bit;
  } ODR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000018) GPIO port bit set/reset register                           */
    
    struct {
      __OM  uint32 BS0        : 1;            /*!< [0..0] Port x set bit y (y= 0..15)                                        */
      __OM  uint32 BS1        : 1;            /*!< [1..1] Port x set bit y (y= 0..15)                                        */
      __OM  uint32 BS2        : 1;            /*!< [2..2] Port x set bit y (y= 0..15)                                        */
      __OM  uint32 BS3        : 1;            /*!< [3..3] Port x set bit y (y= 0..15)                                        */
      __OM  uint32 BS4        : 1;            /*!< [4..4] Port x set bit y (y= 0..15)                                        */
      __OM  uint32 BS5        : 1;            /*!< [5..5] Port x set bit y (y= 0..15)                                        */
      __OM  uint32 BS6        : 1;            /*!< [6..6] Port x set bit y (y= 0..15)                                        */
      __OM  uint32 BS7        : 1;            /*!< [7..7] Port x set bit y (y= 0..15)                                        */
      __OM  uint32 BS8        : 1;            /*!< [8..8] Port x set bit y (y= 0..15)                                        */
      __OM  uint32 BS9        : 1;            /*!< [9..9] Port x set bit y (y= 0..15)                                        */
      __OM  uint32 BS10       : 1;            /*!< [10..10] Port x set bit y (y= 0..15)                                      */
      __OM  uint32 BS11       : 1;            /*!< [11..11] Port x set bit y (y= 0..15)                                      */
      __OM  uint32 BS12       : 1;            /*!< [12..12] Port x set bit y (y= 0..15)                                      */
      __OM  uint32 BS13       : 1;            /*!< [13..13] Port x set bit y (y= 0..15)                                      */
      __OM  uint32 BS14       : 1;            /*!< [14..14] Port x set bit y (y= 0..15)                                      */
      __OM  uint32 BS15       : 1;            /*!< [15..15] Port x set bit y (y= 0..15)                                      */
      __OM  uint32 BR0        : 1;            /*!< [16..16] Port x set bit y (y= 0..15)                                      */
      __OM  uint32 BR1        : 1;            /*!< [17..17] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR2        : 1;            /*!< [18..18] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR3        : 1;            /*!< [19..19] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR4        : 1;            /*!< [20..20] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR5        : 1;            /*!< [21..21] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR6        : 1;            /*!< [22..22] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR7        : 1;            /*!< [23..23] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR8        : 1;            /*!< [24..24] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR9        : 1;            /*!< [25..25] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR10       : 1;            /*!< [26..26] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR11       : 1;            /*!< [27..27] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR12       : 1;            /*!< [28..28] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR13       : 1;            /*!< [29..29] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR14       : 1;            /*!< [30..30] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32 BR15       : 1;            /*!< [31..31] Port x reset bit y (y = 0..15)                                   */
    } bit;
  } BSRR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) GPIO port configuration lock register                      */
    
