Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 LCK0       : 1;            /*!< [0..0] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32 LCK1       : 1;            /*!< [1..1] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32 LCK2       : 1;            /*!< [2..2] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32 LCK3       : 1;            /*!< [3..3] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32 LCK4       : 1;            /*!< [4..4] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32 LCK5       : 1;            /*!< [5..5] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32 LCK6       : 1;            /*!< [6..6] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32 LCK7       : 1;            /*!< [7..7] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32 LCK8       : 1;            /*!< [8..8] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32 LCK9       : 1;            /*!< [9..9] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32 LCK10      : 1;            /*!< [10..10] Port x lock bit y (y= 0..15)                                     */
      __IOM uint32 LCK11      : 1;            /*!< [11..11] Port x lock bit y (y= 0..15)                                     */
      __IOM uint32 LCK12      : 1;            /*!< [12..12] Port x lock bit y (y= 0..15)                                     */
      __IOM uint32 LCK13      : 1;            /*!< [13..13] Port x lock bit y (y= 0..15)                                     */
      __IOM uint32 LCK14      : 1;            /*!< [14..14] Port x lock bit y (y= 0..15)                                     */
      __IOM uint32 LCK15      : 1;            /*!< [15..15] Port x lock bit y (y= 0..15)                                     */
      __IOM uint32 LCKK       : 1;            /*!< [16..16] Port x lock bit y (y= 0..15)                                     */
            uint32            : 15;
    } bit;
  } LCKR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) GPIO alternate function lowregister                        */
    
    struct {
      __IOM uint32 AFRL0      : 4;            /*!< [3..0] Alternate function selection for port x bit y (y = 0..7)           */
      __IOM uint32 AFRL1      : 4;            /*!< [7..4] Alternate function selection for port x bit y (y = 0..7)           */
      __IOM uint32 AFRL2      : 4;            /*!< [11..8] Alternate function selection for port x bit y (y = 0..7)          */
      __IOM uint32 AFRL3      : 4;            /*!< [15..12] Alternate function selection for port x bit y (y =
                                                     0..7)                                                                     */
      __IOM uint32 AFRL4      : 4;            /*!< [19..16] Alternate function selection for port x bit y (y =
                                                     0..7)                                                                     */
      __IOM uint32 AFRL5      : 4;            /*!< [23..20] Alternate function selection for port x bit y (y =
                                                     0..7)                                                                     */
      __IOM uint32 AFRL6      : 4;            /*!< [27..24] Alternate function selection for port x bit y (y =
                                                     0..7)                                                                     */
      __IOM uint32 AFRL7      : 4;            /*!< [31..28] Alternate function selection for port x bit y (y =
                                                     0..7)                                                                     */
    } bit;
  } AFRL;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) GPIO alternate function high register                      */
    
    struct {
      __IOM uint32 AFRH8      : 4;            /*!< [3..0] Alternate function selection for port x bit y (y = 8..15)          */
      __IOM uint32 AFRH9      : 4;            /*!< [7..4] Alternate function selection for port x bit y (y = 8..15)          */
      __IOM uint32 AFRH10     : 4;            /*!< [11..8] Alternate function selection for port x bit y (y = 8..15)         */
      __IOM uint32 AFRH11     : 4;            /*!< [15..12] Alternate function selection for port x bit y (y =
                                                     8..15)                                                                    */
      __IOM uint32 AFRH12     : 4;            /*!< [19..16] Alternate function selection for port x bit y (y =
                                                     8..15)                                                                    */
      __IOM uint32 AFRH13     : 4;            /*!< [23..20] Alternate function selection for port x bit y (y =
                                                     8..15)                                                                    */
      __IOM uint32 AFRH14     : 4;            /*!< [27..24] Alternate function selection for port x bit y (y =
                                                     8..15)                                                                    */
      __IOM uint32 AFRH15     : 4;            /*!< [31..28] Alternate function selection for port x bit y (y =
                                                     8..15)                                                                    */
    } bit;
  } AFRH;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) GPIO port bit reset register                               */
    
    struct {
      __IOM uint32 BR0        : 1;            /*!< [0..0] Port D Reset bit 0                                                 */
      __IOM uint32 BR1        : 1;            /*!< [1..1] Port D Reset bit 1                                                 */
      __IOM uint32 BR2        : 1;            /*!< [2..2] Port D Reset bit 2                                                 */
      __IOM uint32 BR3        : 1;            /*!< [3..3] Port D Reset bit 3                                                 */
      __IOM uint32 BR4        : 1;            /*!< [4..4] Port D Reset bit 4                                                 */
      __IOM uint32 BR5        : 1;            /*!< [5..5] Port D Reset bit 5                                                 */
      __IOM uint32 BR6        : 1;            /*!< [6..6] Port D Reset bit 6                                                 */
      __IOM uint32 BR7        : 1;            /*!< [7..7] Port D Reset bit 7                                                 */
      __IOM uint32 BR8        : 1;            /*!< [8..8] Port D Reset bit 8                                                 */
      __IOM uint32 BR9        : 1;            /*!< [9..9] Port D Reset bit 9                                                 */
      __IOM uint32 BR10       : 1;            /*!< [10..10] Port D Reset bit 10                                              */
      __IOM uint32 BR11       : 1;            /*!< [11..11] Port D Reset bit 11                                              */
      __IOM uint32 BR12       : 1;            /*!< [12..12] Port D Reset bit 12                                              */
      __IOM uint32 BR13       : 1;            /*!< [13..13] Port D Reset bit 13                                              */
      __IOM uint32 BR14       : 1;            /*!< [14..14] Port D Reset bit 14                                              */
      __IOM uint32 BR15       : 1;            /*!< [15..15] Port D Reset bit 15                                              */
            uint32            : 16;
    } bit;
  } BRR;
} GPIOD_Type;                                   /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIOB                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOB)
  */

typedef struct {                                /*!< (@ 0x40020400) GPIOB Structure                                            */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) GPIO port mode register                                    */
    
