Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
typedef struct {                                /*!< (@ 0x40013800) SYSCFG Structure                                           */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) memory remap register                                      */
    
    struct {
      __IOM uint32 MEM_MODE   : 3;            /*!< [2..0] Memory mapping selection                                           */
            uint32            : 5;
      __IOM uint32 FB_MODE    : 1;            /*!< [8..8] Flash bank mode selection                                          */
            uint32            : 1;
      __IOM uint32 SWP_FMC    : 2;            /*!< [11..10] FMC memory mapping swap                                          */
            uint32            : 20;
    } bit;
  } MEMRM;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) peripheral mode configuration register                     */
    
    struct {
            uint32            : 16;
      __IOM uint32 ADC1DC2    : 1;            /*!< [16..16] ADC1DC2                                                          */
      __IOM uint32 ADC2DC2    : 1;            /*!< [17..17] ADC2DC2                                                          */
      __IOM uint32 ADC3DC2    : 1;            /*!< [18..18] ADC3DC2                                                          */
            uint32            : 4;
      __IOM uint32 MII_RMII_SEL : 1;          /*!< [23..23] Ethernet PHY interface selection                                 */
            uint32            : 8;
    } bit;
  } PMC;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) external interrupt configuration register 1                */
    
    struct {
      __IOM uint32 EXTI0      : 4;            /*!< [3..0] EXTI x configuration (x = 0 to 3)                                  */
      __IOM uint32 EXTI1      : 4;            /*!< [7..4] EXTI x configuration (x = 0 to 3)                                  */
      __IOM uint32 EXTI2      : 4;            /*!< [11..8] EXTI x configuration (x = 0 to 3)                                 */
      __IOM uint32 EXTI3      : 4;            /*!< [15..12] EXTI x configuration (x = 0 to 3)                                */
            uint32            : 16;
    } bit;
  } EXTICR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) external interrupt configuration register 2                */
    
    struct {
      __IOM uint32 EXTI4      : 4;            /*!< [3..0] EXTI x configuration (x = 4 to 7)                                  */
      __IOM uint32 EXTI5      : 4;            /*!< [7..4] EXTI x configuration (x = 4 to 7)                                  */
      __IOM uint32 EXTI6      : 4;            /*!< [11..8] EXTI x configuration (x = 4 to 7)                                 */
      __IOM uint32 EXTI7      : 4;            /*!< [15..12] EXTI x configuration (x = 4 to 7)                                */
            uint32            : 16;
    } bit;
  } EXTICR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) external interrupt configuration register 3                */
    
    struct {
      __IOM uint32 EXTI8      : 4;            /*!< [3..0] EXTI x configuration (x = 8 to 11)                                 */
      __IOM uint32 EXTI9      : 4;            /*!< [7..4] EXTI x configuration (x = 8 to 11)                                 */
      __IOM uint32 EXTI10     : 4;            /*!< [11..8] EXTI10                                                            */
      __IOM uint32 EXTI11     : 4;            /*!< [15..12] EXTI x configuration (x = 8 to 11)                               */
            uint32            : 16;
    } bit;
  } EXTICR3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) external interrupt configuration register 4                */
    
    struct {
      __IOM uint32 EXTI12     : 4;            /*!< [3..0] EXTI x configuration (x = 12 to 15)                                */
      __IOM uint32 EXTI13     : 4;            /*!< [7..4] EXTI x configuration (x = 12 to 15)                                */
      __IOM uint32 EXTI14     : 4;            /*!< [11..8] EXTI x configuration (x = 12 to 15)                               */
      __IOM uint32 EXTI15     : 4;            /*!< [15..12] EXTI x configuration (x = 12 to 15)                              */
            uint32            : 16;
    } bit;
  } EXTICR4;
  __IM  uint32  RESERVED[2];
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000020) Compensation cell control register                         */
    
    struct {
      __IM  uint32 CMP_PD     : 1;            /*!< [0..0] Compensation cell power-down                                       */
            uint32            : 7;
      __IM  uint32 READY      : 1;            /*!< [8..8] READY                                                              */
            uint32            : 23;
    } bit;
  } CMPCR;
} SYSCFG_Type;                                  /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial peripheral interface (SPI1)
  */

typedef struct {                                /*!< (@ 0x40013000) SPI1 Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register 1                                         */
    
    struct {
      __IOM uint32 CPHA       : 1;            /*!< [0..0] Clock phase                                                        */
      __IOM uint32 CPOL       : 1;            /*!< [1..1] Clock polarity                                                     */
      __IOM uint32 MSTR       : 1;            /*!< [2..2] Master selection                                                   */
      __IOM uint32 BR         : 3;            /*!< [5..3] Baud rate control                                                  */
      __IOM uint32 SPE        : 1;            /*!< [6..6] SPI enable                                                         */
      __IOM uint32 LSBFIRST   : 1;            /*!< [7..7] Frame format                                                       */
      __IOM uint32 SSI        : 1;            /*!< [8..8] Internal slave select                                              */
      __IOM uint32 SSM        : 1;            /*!< [9..9] Software slave management                                          */
      __IOM uint32 RXONLY     : 1;            /*!< [10..10] Receive only                                                     */
      __IOM uint32 CRCL       : 1;            /*!< [11..11] CRC length                                                       */
      __IOM uint32 CRCNEXT    : 1;            /*!< [12..12] CRC transfer next                                                */
      __IOM uint32 CRCEN      : 1;            /*!< [13..13] Hardware CRC calculation enable                                  */
      __IOM uint32 BIDIOE     : 1;            /*!< [14..14] Output enable in bidirectional mode                              */
      __IOM uint32 BIDIMODE   : 1;            /*!< [15..15] Bidirectional data mode enable                                   */
            uint32            : 16;
    } bit;
  } CR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) control register 2                                         */
    
