Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 RXDMAEN    : 1;            /*!< [0..0] Rx buffer DMA enable                                               */
      __IOM uint32 TXDMAEN    : 1;            /*!< [1..1] Tx buffer DMA enable                                               */
      __IOM uint32 SSOE       : 1;            /*!< [2..2] SS output enable                                                   */
      __IOM uint32 NSSP       : 1;            /*!< [3..3] NSS pulse management                                               */
      __IOM uint32 FRF        : 1;            /*!< [4..4] Frame format                                                       */
      __IOM uint32 ERRIE      : 1;            /*!< [5..5] Error interrupt enable                                             */
      __IOM uint32 RXNEIE     : 1;            /*!< [6..6] RX buffer not empty interrupt enable                               */
      __IOM uint32 TXEIE      : 1;            /*!< [7..7] Tx buffer empty interrupt enable                                   */
      __IOM uint32 DS         : 4;            /*!< [11..8] Data size                                                         */
      __IOM uint32 FRXTH      : 1;            /*!< [12..12] FIFO reception threshold                                         */
      __IOM uint32 LDMA_RX    : 1;            /*!< [13..13] Last DMA transfer for reception                                  */
      __IOM uint32 LDMA_TX    : 1;            /*!< [14..14] Last DMA transfer for transmission                               */
            uint32            : 17;
    } bit;
  } CR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) status register                                            */
    
    struct {
      __IM  uint32 RXNE       : 1;            /*!< [0..0] Receive buffer not empty                                           */
      __IM  uint32 TXE        : 1;            /*!< [1..1] Transmit buffer empty                                              */
      __IM  uint32 CHSIDE     : 1;            /*!< [2..2] Channel side                                                       */
      __IM  uint32 UDR        : 1;            /*!< [3..3] Underrun flag                                                      */
      __IOM uint32 CRCERR     : 1;            /*!< [4..4] CRC error flag                                                     */
      __IM  uint32 MODF       : 1;            /*!< [5..5] Mode fault                                                         */
      __IM  uint32 OVR        : 1;            /*!< [6..6] Overrun flag                                                       */
      __IM  uint32 BSY        : 1;            /*!< [7..7] Busy flag                                                          */
      __IM  uint32 FRE        : 1;            /*!< [8..8] Frame format error                                                 */
      __IM  uint32 FRLVL      : 2;            /*!< [10..9] FIFO reception level                                              */
      __IM  uint32 FTLVL      : 2;            /*!< [12..11] FIFO Transmission Level                                          */
            uint32            : 19;
    } bit;
  } SR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) data register                                              */
    
    struct {
      __IOM uint32 DR         : 16;           /*!< [15..0] Data register                                                     */
            uint32            : 16;
    } bit;
  } DR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) CRC polynomial register                                    */
    
    struct {
      __IOM uint32 CRCPOLY    : 16;           /*!< [15..0] CRC polynomial register                                           */
            uint32            : 16;
    } bit;
  } CRCPR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000014) RX CRC register                                            */
    
    struct {
      __IM  uint32 RxCRC      : 16;           /*!< [15..0] Rx CRC register                                                   */
            uint32            : 16;
    } bit;
  } RXCRCR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000018) TX CRC register                                            */
    
    struct {
      __IM  uint32 TxCRC      : 16;           /*!< [15..0] Tx CRC register                                                   */
            uint32            : 16;
    } bit;
  } TXCRCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) I2S configuration register                                 */
    
    struct {
      __IOM uint32 CHLEN      : 1;            /*!< [0..0] Channel length (number of bits per audio channel)                  */
      __IOM uint32 DATLEN     : 2;            /*!< [2..1] Data length to be transferred                                      */
      __IOM uint32 CKPOL      : 1;            /*!< [3..3] Steady state clock polarity                                        */
      __IOM uint32 I2SSTD     : 2;            /*!< [5..4] I2S standard selection                                             */
            uint32            : 1;
      __IOM uint32 PCMSYNC    : 1;            /*!< [7..7] PCM frame synchronization                                          */
      __IOM uint32 I2SCFG     : 2;            /*!< [9..8] I2S configuration mode                                             */
      __IOM uint32 I2SE       : 1;            /*!< [10..10] I2S Enable                                                       */
      __IOM uint32 I2SMOD     : 1;            /*!< [11..11] I2S mode selection                                               */
      __IOM uint32 ASTRTEN    : 1;            /*!< [12..12] Asynchronous start enable                                        */
            uint32            : 19;
    } bit;
  } I2SCFGR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) I2S prescaler register                                     */
    
