Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 I2SDIV     : 8;            /*!< [7..0] I2S Linear prescaler                                               */
      __IOM uint32 ODD        : 1;            /*!< [8..8] Odd factor for the prescaler                                       */
      __IOM uint32 MCKOE      : 1;            /*!< [9..9] Master clock output enable                                         */
            uint32            : 22;
    } bit;
  } I2SPR;
} SPI1_Type;                                    /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial peripheral interface (SPI2)
  */

typedef struct {                                /*!< (@ 0x40003800) SPI2 Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register 1                                         */
    
    struct {
      __IOM uint32 CPHA       : 1;            /*!< [0..0] Clock phase                                                        */
      __IOM uint32 CPOL       : 1;            /*!< [1..1] Clock polarity                                                     */
      __IOM uint32 MSTR       : 1;            /*!< [2..2] Master selection                                                   */
      __IOM uint32 BR         : 3;            /*!< [5..3] Baud rate control                                                  */
      __IOM uint32 SPE        : 1;            /*!< [6..6] SPI enable                                                         */
      __IOM uint32 LSBFIRST   : 1;            /*!< [7..7] Frame format                                                       */
      __IOM uint32 SSI        : 1;            /*!< [8..8] Internal slave select                                              */
      __IOM uint32 SSM        : 1;            /*!< [9..9] Software slave management                                          */
      __IOM uint32 RXONLY     : 1;            /*!< [10..10] Receive only                                                     */
      __IOM uint32 CRCL       : 1;            /*!< [11..11] CRC length                                                       */
      __IOM uint32 CRCNEXT    : 1;            /*!< [12..12] CRC transfer next                                                */
      __IOM uint32 CRCEN      : 1;            /*!< [13..13] Hardware CRC calculation enable                                  */
      __IOM uint32 BIDIOE     : 1;            /*!< [14..14] Output enable in bidirectional mode                              */
      __IOM uint32 BIDIMODE   : 1;            /*!< [15..15] Bidirectional data mode enable                                   */
            uint32            : 16;
    } bit;
  } CR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) control register 2                                         */
    
    struct {
      __IOM uint32 RXDMAEN    : 1;            /*!< [0..0] Rx buffer DMA enable                                               */
      __IOM uint32 TXDMAEN    : 1;            /*!< [1..1] Tx buffer DMA enable                                               */
      __IOM uint32 SSOE       : 1;            /*!< [2..2] SS output enable                                                   */
      __IOM uint32 NSSP       : 1;            /*!< [3..3] NSS pulse management                                               */
      __IOM uint32 FRF        : 1;            /*!< [4..4] Frame format                                                       */
      __IOM uint32 ERRIE      : 1;            /*!< [5..5] Error interrupt enable                                             */
      __IOM uint32 RXNEIE     : 1;            /*!< [6..6] RX buffer not empty interrupt enable                               */
      __IOM uint32 TXEIE      : 1;            /*!< [7..7] Tx buffer empty interrupt enable                                   */
      __IOM uint32 DS         : 4;            /*!< [11..8] Data size                                                         */
      __IOM uint32 FRXTH      : 1;            /*!< [12..12] FIFO reception threshold                                         */
      __IOM uint32 LDMA_RX    : 1;            /*!< [13..13] Last DMA transfer for reception                                  */
      __IOM uint32 LDMA_TX    : 1;            /*!< [14..14] Last DMA transfer for transmission                               */
            uint32            : 17;
    } bit;
  } CR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) status register                                            */
    
    struct {
      __IM  uint32 RXNE       : 1;            /*!< [0..0] Receive buffer not empty                                           */
      __IM  uint32 TXE        : 1;            /*!< [1..1] Transmit buffer empty                                              */
      __IM  uint32 CHSIDE     : 1;            /*!< [2..2] Channel side                                                       */
      __IM  uint32 UDR        : 1;            /*!< [3..3] Underrun flag                                                      */
      __IOM uint32 CRCERR     : 1;            /*!< [4..4] CRC error flag                                                     */
      __IM  uint32 MODF       : 1;            /*!< [5..5] Mode fault                                                         */
      __IM  uint32 OVR        : 1;            /*!< [6..6] Overrun flag                                                       */
      __IM  uint32 BSY        : 1;            /*!< [7..7] Busy flag                                                          */
      __IM  uint32 FRE        : 1;            /*!< [8..8] Frame format error                                                 */
      __IM  uint32 FRLVL      : 2;            /*!< [10..9] FIFO reception level                                              */
      __IM  uint32 FTLVL      : 2;            /*!< [12..11] FIFO Transmission Level                                          */
            uint32            : 19;
    } bit;
  } SR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) data register                                              */
    
