Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 DR         : 16;           /*!< [15..0] Data register                                                     */
            uint32            : 16;
    } bit;
  } DR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) CRC polynomial register                                    */
    
    struct {
      __IOM uint32 CRCPOLY    : 16;           /*!< [15..0] CRC polynomial register                                           */
            uint32            : 16;
    } bit;
  } CRCPR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000014) RX CRC register                                            */
    
    struct {
      __IM  uint32 RxCRC      : 16;           /*!< [15..0] Rx CRC register                                                   */
            uint32            : 16;
    } bit;
  } RXCRCR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000018) TX CRC register                                            */
    
    struct {
      __IM  uint32 TxCRC      : 16;           /*!< [15..0] Tx CRC register                                                   */
            uint32            : 16;
    } bit;
  } TXCRCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) I2S configuration register                                 */
    
    struct {
      __IOM uint32 CHLEN      : 1;            /*!< [0..0] Channel length (number of bits per audio channel)                  */
      __IOM uint32 DATLEN     : 2;            /*!< [2..1] Data length to be transferred                                      */
      __IOM uint32 CKPOL      : 1;            /*!< [3..3] Steady state clock polarity                                        */
      __IOM uint32 I2SSTD     : 2;            /*!< [5..4] I2S standard selection                                             */
            uint32            : 1;
      __IOM uint32 PCMSYNC    : 1;            /*!< [7..7] PCM frame synchronization                                          */
      __IOM uint32 I2SCFG     : 2;            /*!< [9..8] I2S configuration mode                                             */
      __IOM uint32 I2SE       : 1;            /*!< [10..10] I2S Enable                                                       */
      __IOM uint32 I2SMOD     : 1;            /*!< [11..11] I2S mode selection                                               */
      __IOM uint32 ASTRTEN    : 1;            /*!< [12..12] Asynchronous start enable                                        */
            uint32            : 19;
    } bit;
  } I2SCFGR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) I2S prescaler register                                     */
    
    struct {
      __IOM uint32 I2SDIV     : 8;            /*!< [7..0] I2S Linear prescaler                                               */
      __IOM uint32 ODD        : 1;            /*!< [8..8] Odd factor for the prescaler                                       */
      __IOM uint32 MCKOE      : 1;            /*!< [9..9] Master clock output enable                                         */
            uint32            : 22;
    } bit;
  } I2SPR;
} SPI2_Type;                                    /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           ADC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog-to-digital converter (ADC1)
  */

typedef struct {                                /*!< (@ 0x40012000) ADC1 Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) status register                                            */
    
    struct {
      __IOM uint32 AWD        : 1;            /*!< [0..0] Analog watchdog flag                                               */
      __IOM uint32 EOC        : 1;            /*!< [1..1] Regular channel end of conversion                                  */
      __IOM uint32 JEOC       : 1;            /*!< [2..2] Injected channel end of conversion                                 */
      __IOM uint32 JSTRT      : 1;            /*!< [3..3] Injected channel start flag                                        */
      __IOM uint32 STRT       : 1;            /*!< [4..4] Regular channel start flag                                         */
      __IOM uint32 OVR        : 1;            /*!< [5..5] Overrun                                                            */
            uint32            : 26;
    } bit;
  } SR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) control register 1                                         */
    
    struct {
      __IOM uint32 AWDCH      : 5;            /*!< [4..0] Analog watchdog channel select bits                                */
      __IOM uint32 EOCIE      : 1;            /*!< [5..5] Interrupt enable for EOC                                           */
      __IOM uint32 AWDIE      : 1;            /*!< [6..6] Analog watchdog interrupt enable                                   */
      __IOM uint32 JEOCIE     : 1;            /*!< [7..7] Interrupt enable for injected channels                             */
      __IOM uint32 SCAN       : 1;            /*!< [8..8] Scan mode                                                          */
      __IOM uint32 AWDSGL     : 1;            /*!< [9..9] Enable the watchdog on a single channel in scan mode               */
      __IOM uint32 JAUTO      : 1;            /*!< [10..10] Automatic injected group conversion                              */
      __IOM uint32 DISCEN     : 1;            /*!< [11..11] Discontinuous mode on regular channels                           */
      __IOM uint32 JDISCEN    : 1;            /*!< [12..12] Discontinuous mode on injected channels                          */
      __IOM uint32 DISCNUM    : 3;            /*!< [15..13] Discontinuous mode channel count                                 */
            uint32            : 6;
      __IOM uint32 JAWDEN     : 1;            /*!< [22..22] Analog watchdog enable on injected channels                      */
      __IOM uint32 AWDEN      : 1;            /*!< [23..23] Analog watchdog enable on regular channels                       */
      __IOM uint32 RES        : 2;            /*!< [25..24] Resolution                                                       */
      __IOM uint32 OVRIE      : 1;            /*!< [26..26] Overrun interrupt enable                                         */
            uint32            : 5;
    } bit;
  } CR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) control register 2                                         */
    
