Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 ADON       : 1;            /*!< [0..0] A/D Converter ON / OFF                                             */
      __IOM uint32 CONT       : 1;            /*!< [1..1] Continuous conversion                                              */
            uint32            : 6;
      __IOM uint32 DMA        : 1;            /*!< [8..8] Direct memory access mode (for single ADC mode)                    */
      __IOM uint32 DDS        : 1;            /*!< [9..9] DMA disable selection (for single ADC mode)                        */
      __IOM uint32 EOCS       : 1;            /*!< [10..10] End of conversion selection                                      */
      __IOM uint32 ALIGN      : 1;            /*!< [11..11] Data alignment                                                   */
            uint32            : 4;
      __IOM uint32 JEXTSEL    : 4;            /*!< [19..16] External event select for injected group                         */
      __IOM uint32 JEXTEN     : 2;            /*!< [21..20] External trigger enable for injected channels                    */
      __IOM uint32 JSWSTART   : 1;            /*!< [22..22] Start conversion of injected channels                            */
            uint32            : 1;
      __IOM uint32 EXTSEL     : 4;            /*!< [27..24] External event select for regular group                          */
      __IOM uint32 EXTEN      : 2;            /*!< [29..28] External trigger enable for regular channels                     */
      __IOM uint32 SWSTART    : 1;            /*!< [30..30] Start conversion of regular channels                             */
            uint32            : 1;
    } bit;
  } CR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) sample time register 1                                     */
    
    struct {
      __IOM uint32 SMPx_x     : 32;           /*!< [31..0] Sample time bits                                                  */
    } bit;
  } SMPR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) sample time register 2                                     */
    
    struct {
      __IOM uint32 SMPx_x     : 32;           /*!< [31..0] Sample time bits                                                  */
    } bit;
  } SMPR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) injected channel data offset register x                    */
    
    struct {
      __IOM uint32 JOFFSET1   : 12;           /*!< [11..0] Data offset for injected channel x                                */
            uint32            : 20;
    } bit;
  } JOFR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) injected channel data offset register x                    */
    
    struct {
      __IOM uint32 JOFFSET2   : 12;           /*!< [11..0] Data offset for injected channel x                                */
            uint32            : 20;
    } bit;
  } JOFR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) injected channel data offset register x                    */
    
    struct {
      __IOM uint32 JOFFSET3   : 12;           /*!< [11..0] Data offset for injected channel x                                */
            uint32            : 20;
    } bit;
  } JOFR3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) injected channel data offset register x                    */
    
    struct {
      __IOM uint32 JOFFSET4   : 12;           /*!< [11..0] Data offset for injected channel x                                */
            uint32            : 20;
    } bit;
  } JOFR4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) watchdog higher threshold register                         */
    
    struct {
      __IOM uint32 HT         : 12;           /*!< [11..0] Analog watchdog higher threshold                                  */
            uint32            : 20;
    } bit;
  } HTR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) watchdog lower threshold register                          */
    
    struct {
      __IOM uint32 LT         : 12;           /*!< [11..0] Analog watchdog lower threshold                                   */
            uint32            : 20;
    } bit;
  } LTR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) regular sequence register 1                                */
    
    struct {
      __IOM uint32 SQ13       : 5;            /*!< [4..0] 13th conversion in regular sequence                                */
      __IOM uint32 SQ14       : 5;            /*!< [9..5] 14th conversion in regular sequence                                */
      __IOM uint32 SQ15       : 5;            /*!< [14..10] 15th conversion in regular sequence                              */
      __IOM uint32 SQ16       : 5;            /*!< [19..15] 16th conversion in regular sequence                              */
      __IOM uint32 L          : 4;            /*!< [23..20] Regular channel sequence length                                  */
            uint32            : 8;
    } bit;
  } SQR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000030) regular sequence register 2                                */
    
    struct {
      __IOM uint32 SQ7        : 5;            /*!< [4..0] 7th conversion in regular sequence                                 */
      __IOM uint32 SQ8        : 5;            /*!< [9..5] 8th conversion in regular sequence                                 */
      __IOM uint32 SQ9        : 5;            /*!< [14..10] 9th conversion in regular sequence                               */
      __IOM uint32 SQ10       : 5;            /*!< [19..15] 10th conversion in regular sequence                              */
      __IOM uint32 SQ11       : 5;            /*!< [24..20] 11th conversion in regular sequence                              */
      __IOM uint32 SQ12       : 5;            /*!< [29..25] 12th conversion in regular sequence                              */
            uint32            : 2;
    } bit;
  } SQR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) regular sequence register 3                                */
    
