Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 SQ1        : 5;            /*!< [4..0] 1st conversion in regular sequence                                 */
      __IOM uint32 SQ2        : 5;            /*!< [9..5] 2nd conversion in regular sequence                                 */
      __IOM uint32 SQ3        : 5;            /*!< [14..10] 3rd conversion in regular sequence                               */
      __IOM uint32 SQ4        : 5;            /*!< [19..15] 4th conversion in regular sequence                               */
      __IOM uint32 SQ5        : 5;            /*!< [24..20] 5th conversion in regular sequence                               */
      __IOM uint32 SQ6        : 5;            /*!< [29..25] 6th conversion in regular sequence                               */
            uint32            : 2;
    } bit;
  } SQR3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000038) injected sequence register                                 */
    
    struct {
      __IOM uint32 JSQ1       : 5;            /*!< [4..0] 1st conversion in injected sequence                                */
      __IOM uint32 JSQ2       : 5;            /*!< [9..5] 2nd conversion in injected sequence                                */
      __IOM uint32 JSQ3       : 5;            /*!< [14..10] 3rd conversion in injected sequence                              */
      __IOM uint32 JSQ4       : 5;            /*!< [19..15] 4th conversion in injected sequence                              */
      __IOM uint32 JL         : 2;            /*!< [21..20] Injected sequence length                                         */
            uint32            : 10;
    } bit;
  } JSQR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000003C) injected data register x                                   */
    
    struct {
      __IM  uint32 JDATA      : 16;           /*!< [15..0] Injected data                                                     */
            uint32            : 16;
    } bit;
  } JDR1;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000040) injected data register x                                   */
    
    struct {
      __IM  uint32 JDATA      : 16;           /*!< [15..0] Injected data                                                     */
            uint32            : 16;
    } bit;
  } JDR2;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000044) injected data register x                                   */
    
    struct {
      __IM  uint32 JDATA      : 16;           /*!< [15..0] Injected data                                                     */
            uint32            : 16;
    } bit;
  } JDR3;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000048) injected data register x                                   */
    
    struct {
      __IM  uint32 JDATA      : 16;           /*!< [15..0] Injected data                                                     */
            uint32            : 16;
    } bit;
  } JDR4;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000004C) regular data register                                      */
    
    struct {
      __IM  uint32 DATA       : 16;           /*!< [15..0] Regular data                                                      */
            uint32            : 16;
    } bit;
  } DR;
} ADC1_Type;                                    /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                            DAC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Digital-to-analog converter (DAC)
  */

typedef struct {                                /*!< (@ 0x40007400) DAC Structure                                              */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register                                           */
    
    struct {
      __IOM uint32 EN1        : 1;            /*!< [0..0] DAC channel1 enable                                                */
      __IOM uint32 BOFF1      : 1;            /*!< [1..1] DAC channel1 output buffer disable                                 */
      __IOM uint32 TEN1       : 1;            /*!< [2..2] DAC channel1 trigger enable                                        */
      __IOM uint32 TSEL1      : 3;            /*!< [5..3] DAC channel1 trigger selection                                     */
      __IOM uint32 WAVE1      : 2;            /*!< [7..6] DAC channel1 noise/triangle wave generation enable                 */
      __IOM uint32 MAMP1      : 4;            /*!< [11..8] DAC channel1 mask/amplitude selector                              */
      __IOM uint32 DMAEN1     : 1;            /*!< [12..12] DAC channel1 DMA enable                                          */
      __IOM uint32 DMAUDRIE1  : 1;            /*!< [13..13] DAC channel1 DMA Underrun Interrupt enable                       */
            uint32            : 2;
      __IOM uint32 EN2        : 1;            /*!< [16..16] DAC channel2 enable                                              */
      __IOM uint32 BOFF2      : 1;            /*!< [17..17] DAC channel2 output buffer disable                               */
      __IOM uint32 TEN2       : 1;            /*!< [18..18] DAC channel2 trigger enable                                      */
      __IOM uint32 TSEL2      : 3;            /*!< [21..19] DAC channel2 trigger selection                                   */
      __IOM uint32 WAVE2      : 2;            /*!< [23..22] DAC channel2 noise/triangle wave generation enable               */
      __IOM uint32 MAMP2      : 4;            /*!< [27..24] DAC channel2 mask/amplitude selector                             */
      __IOM uint32 DMAEN2     : 1;            /*!< [28..28] DAC channel2 DMA enable                                          */
      __IOM uint32 DMAUDRIE2  : 1;            /*!< [29..29] DAC channel2 DMA underrun interrupt enable                       */
            uint32            : 2;
    } bit;
  } CR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000004) software trigger register                                  */
    
