Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __OM  uint32 SWTRIG1    : 1;            /*!< [0..0] DAC channel1 software trigger                                      */
      __OM  uint32 SWTRIG2    : 1;            /*!< [1..1] DAC channel2 software trigger                                      */
            uint32            : 30;
    } bit;
  } SWTRIGR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) channel1 12-bit right-aligned data holding register        */
    
    struct {
      __IOM uint32 DACC1DHR   : 12;           /*!< [11..0] DAC channel1 12-bit right-aligned data                            */
            uint32            : 20;
    } bit;
  } DHR12R1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) channel1 12-bit left aligned data holding register         */
    
    struct {
            uint32            : 4;
      __IOM uint32 DACC1DHR   : 12;           /*!< [15..4] DAC channel1 12-bit left-aligned data                             */
            uint32            : 16;
    } bit;
  } DHR12L1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) channel1 8-bit right aligned data holding register         */
    
    struct {
      __IOM uint32 DACC1DHR   : 8;            /*!< [7..0] DAC channel1 8-bit right-aligned data                              */
            uint32            : 24;
    } bit;
  } DHR8R1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) channel2 12-bit right aligned data holding register        */
    
    struct {
      __IOM uint32 DACC2DHR   : 12;           /*!< [11..0] DAC channel2 12-bit right-aligned data                            */
            uint32            : 20;
    } bit;
  } DHR12R2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) channel2 12-bit left aligned data holding register         */
    
    struct {
            uint32            : 4;
      __IOM uint32 DACC2DHR   : 12;           /*!< [15..4] DAC channel2 12-bit left-aligned data                             */
            uint32            : 16;
    } bit;
  } DHR12L2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) channel2 8-bit right-aligned data holding register         */
    
    struct {
      __IOM uint32 DACC2DHR   : 8;            /*!< [7..0] DAC channel2 8-bit right-aligned data                              */
            uint32            : 24;
    } bit;
  } DHR8R2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) Dual DAC 12-bit right-aligned data holding register        */
    
    struct {
      __IOM uint32 DACC1DHR   : 12;           /*!< [11..0] DAC channel1 12-bit right-aligned data                            */
            uint32            : 4;
      __IOM uint32 DACC2DHR   : 12;           /*!< [27..16] DAC channel2 12-bit right-aligned data                           */
            uint32            : 4;
    } bit;
  } DHR12RD;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) DUAL DAC 12-bit left aligned data holding register         */
    
    struct {
            uint32            : 4;
      __IOM uint32 DACC1DHR   : 12;           /*!< [15..4] DAC channel1 12-bit left-aligned data                             */
            uint32            : 4;
      __IOM uint32 DACC2DHR   : 12;           /*!< [31..20] DAC channel2 12-bit left-aligned data                            */
    } bit;
  } DHR12LD;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) DUAL DAC 8-bit right aligned data holding register         */
    
    struct {
      __IOM uint32 DACC1DHR   : 8;            /*!< [7..0] DAC channel1 8-bit right-aligned data                              */
      __IOM uint32 DACC2DHR   : 8;            /*!< [15..8] DAC channel2 8-bit right-aligned data                             */
            uint32            : 16;
    } bit;
  } DHR8RD;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000002C) channel1 data output register                              */
    
    struct {
      __IM  uint32 DACC1DOR   : 12;           /*!< [11..0] DAC channel1 data output                                          */
            uint32            : 20;
    } bit;
  } DOR1;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000030) channel2 data output register                              */
    
    struct {
      __IM  uint32 DACC2DOR   : 12;           /*!< [11..0] DAC channel2 data output                                          */
            uint32            : 20;
    } bit;
  } DOR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) status register                                            */
    
    struct {
            uint32            : 13;
      __IOM uint32 DMAUDR1    : 1;            /*!< [13..13] DAC channel1 DMA underrun flag                                   */
            uint32            : 15;
      __IOM uint32 DMAUDR2    : 1;            /*!< [29..29] DAC channel2 DMA underrun flag                                   */
            uint32            : 2;
    } bit;
  } SR;
} DAC_Type;                                     /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                            PWR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power control (PWR)
  */

typedef struct {                                /*!< (@ 0x40007000) PWR Structure                                              */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) power control register                                     */
    
