Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 LPDS       : 1;            /*!< [0..0] Low-power deep sleep                                               */
      __IOM uint32 PDDS       : 1;            /*!< [1..1] Power down deepsleep                                               */
            uint32            : 1;
      __IOM uint32 CSBF       : 1;            /*!< [3..3] Clear standby flag                                                 */
      __IOM uint32 PVDE       : 1;            /*!< [4..4] Power voltage detector enable                                      */
      __IOM uint32 PLS        : 3;            /*!< [7..5] PVD level selection                                                */
      __IOM uint32 DBP        : 1;            /*!< [8..8] Disable backup domain write protection                             */
      __IOM uint32 FPDS       : 1;            /*!< [9..9] Flash power down in Stop mode                                      */
      __IOM uint32 LPUDS      : 1;            /*!< [10..10] Low-power regulator in deepsleep under-drive mode                */
      __IOM uint32 MRUDS      : 1;            /*!< [11..11] Main regulator in deepsleep under-drive mode                     */
            uint32            : 1;
      __IOM uint32 ADCDC1     : 1;            /*!< [13..13] ADCDC1                                                           */
      __IOM uint32 VOS        : 2;            /*!< [15..14] Regulator voltage scaling output selection                       */
      __IOM uint32 ODEN       : 1;            /*!< [16..16] Over-drive enable                                                */
      __IOM uint32 ODSWEN     : 1;            /*!< [17..17] Over-drive switching enabled                                     */
      __IOM uint32 UDEN       : 2;            /*!< [19..18] Under-drive enable in stop mode                                  */
            uint32            : 12;
    } bit;
  } CR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) power control/status register                              */
    
    struct {
      __IM  uint32 WUIF       : 1;            /*!< [0..0] Wakeup internal flag                                               */
      __IM  uint32 SBF        : 1;            /*!< [1..1] Standby flag                                                       */
      __IM  uint32 PVDO       : 1;            /*!< [2..2] PVD output                                                         */
      __IM  uint32 BRR        : 1;            /*!< [3..3] Backup regulator ready                                             */
            uint32            : 5;
      __IOM uint32 BRE        : 1;            /*!< [9..9] Backup regulator enable                                            */
            uint32            : 4;
      __IOM uint32 VOSRDY     : 1;            /*!< [14..14] Regulator voltage scaling output selection ready bit             */
            uint32            : 1;
      __IOM uint32 ODRDY      : 1;            /*!< [16..16] Over-drive mode ready                                            */
      __IOM uint32 ODSWRDY    : 1;            /*!< [17..17] Over-drive mode switching ready                                  */
      __IOM uint32 UDRDY      : 2;            /*!< [19..18] Under-drive ready flag                                           */
            uint32            : 12;
    } bit;
  } CSR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) power control register                                     */
    
    struct {
      __IM  uint32 CWUPF1     : 1;            /*!< [0..0] Clear Wakeup Pin flag for PA0                                      */
      __IM  uint32 CWUPF2     : 1;            /*!< [1..1] Clear Wakeup Pin flag for PA2                                      */
      __IM  uint32 CWUPF3     : 1;            /*!< [2..2] Clear Wakeup Pin flag for PC1                                      */
      __IM  uint32 CWUPF4     : 1;            /*!< [3..3] Clear Wakeup Pin flag for PC13                                     */
      __IM  uint32 CWUPF5     : 1;            /*!< [4..4] Clear Wakeup Pin flag for PI8                                      */
      __IM  uint32 CWUPF6     : 1;            /*!< [5..5] Clear Wakeup Pin flag for PI11                                     */
            uint32            : 2;
      __IOM uint32 WUPP1      : 1;            /*!< [8..8] Wakeup pin polarity bit for PA0                                    */
      __IOM uint32 WUPP2      : 1;            /*!< [9..9] Wakeup pin polarity bit for PA2                                    */
      __IOM uint32 WUPP3      : 1;            /*!< [10..10] Wakeup pin polarity bit for PC1                                  */
      __IOM uint32 WUPP4      : 1;            /*!< [11..11] Wakeup pin polarity bit for PC13                                 */
      __IOM uint32 WUPP5      : 1;            /*!< [12..12] Wakeup pin polarity bit for PI8                                  */
      __IOM uint32 WUPP6      : 1;            /*!< [13..13] Wakeup pin polarity bit for PI11                                 */
            uint32            : 18;
    } bit;
  } CR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) power control/status register                              */
    
    struct {
      __IM  uint32 WUPF1      : 1;            /*!< [0..0] Wakeup Pin flag for PA0                                            */
      __IM  uint32 WUPF2      : 1;            /*!< [1..1] Wakeup Pin flag for PA2                                            */
      __IM  uint32 WUPF3      : 1;            /*!< [2..2] Wakeup Pin flag for PC1                                            */
      __IM  uint32 WUPF4      : 1;            /*!< [3..3] Wakeup Pin flag for PC13                                           */
      __IM  uint32 WUPF5      : 1;            /*!< [4..4] Wakeup Pin flag for PI8                                            */
      __IM  uint32 WUPF6      : 1;            /*!< [5..5] Wakeup Pin flag for PI11                                           */
            uint32            : 2;
      __IOM uint32 EWUP1      : 1;            /*!< [8..8] Enable Wakeup pin for PA0                                          */
      __IOM uint32 EWUP2      : 1;            /*!< [9..9] Enable Wakeup pin for PA2                                          */
      __IOM uint32 EWUP3      : 1;            /*!< [10..10] Enable Wakeup pin for PC1                                        */
      __IOM uint32 EWUP4      : 1;            /*!< [11..11] Enable Wakeup pin for PC13                                       */
      __IOM uint32 EWUP5      : 1;            /*!< [12..12] Enable Wakeup pin for PI8                                        */
      __IOM uint32 EWUP6      : 1;            /*!< [13..13] Enable Wakeup pin for PI11                                       */
            uint32            : 18;
    } bit;
  } CSR2;
} PWR_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                           IWDG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Independent watchdog (IWDG)
  */

typedef struct {                                /*!< (@ 0x40003000) IWDG Structure                                             */
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000000) Key register                                               */
    
