Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __OM  uint32 KEY        : 16;           /*!< [15..0] Key value (write only, read 0000h)                                */
            uint32            : 16;
    } bit;
  } KR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Prescaler register                                         */
    
    struct {
      __IOM uint32 PR         : 3;            /*!< [2..0] Prescaler divider                                                  */
            uint32            : 29;
    } bit;
  } PR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) Reload register                                            */
    
    struct {
      __IOM uint32 RL         : 12;           /*!< [11..0] Watchdog counter reload value                                     */
            uint32            : 20;
    } bit;
  } RLR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000000C) Status register                                            */
    
    struct {
      __IM  uint32 PVU        : 1;            /*!< [0..0] Watchdog prescaler value update                                    */
      __IM  uint32 RVU        : 1;            /*!< [1..1] Watchdog counter reload value update                               */
            uint32            : 30;
    } bit;
  } SR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Window register                                            */
    
    struct {
      __IOM uint32 WIN        : 12;           /*!< [11..0] Watchdog counter window value                                     */
            uint32            : 20;
    } bit;
  } WINR;
} IWDG_Type;                                    /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                           WWDG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Window watchdog (WWDG)
  */

typedef struct {                                /*!< (@ 0x40002C00) WWDG Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Control register                                           */
    
    struct {
      __IOM uint32 T          : 7;            /*!< [6..0] 7-bit counter (MSB to LSB)                                         */
      __IOM uint32 WDGA       : 1;            /*!< [7..7] Activation bit                                                     */
            uint32            : 24;
    } bit;
  } CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Configuration register                                     */
    
    struct {
      __IOM uint32 W          : 7;            /*!< [6..0] 7-bit window value                                                 */
      __IOM uint32 WDGTB0     : 1;            /*!< [7..7] Timer base                                                         */
      __IOM uint32 WDGTB1     : 1;            /*!< [8..8] Timer base                                                         */
      __IOM uint32 EWI        : 1;            /*!< [9..9] Early wakeup interrupt                                             */
            uint32            : 22;
    } bit;
  } CFR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) Status register                                            */
    
    struct {
      __IOM uint32 EWIF       : 1;            /*!< [0..0] Early wakeup interrupt flag                                        */
            uint32            : 31;
    } bit;
  } SR;
} WWDG_Type;                                    /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           C_ADC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Common ADC registers (C_ADC)
  */

typedef struct {                                /*!< (@ 0x40012300) C_ADC Structure                                            */
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000000) ADC Common status register                                 */
    
    struct {
      __IM  uint32 AWD1       : 1;            /*!< [0..0] Analog watchdog flag of ADC 1                                      */
      __IM  uint32 EOC1       : 1;            /*!< [1..1] End of conversion of ADC 1                                         */
      __IM  uint32 JEOC1      : 1;            /*!< [2..2] Injected channel end of conversion of ADC 1                        */
      __IM  uint32 JSTRT1     : 1;            /*!< [3..3] Injected channel Start flag of ADC 1                               */
      __IM  uint32 STRT1      : 1;            /*!< [4..4] Regular channel Start flag of ADC 1                                */
      __IM  uint32 OVR1       : 1;            /*!< [5..5] Overrun flag of ADC 1                                              */
            uint32            : 2;
      __IM  uint32 AWD2       : 1;            /*!< [8..8] Analog watchdog flag of ADC 2                                      */
      __IM  uint32 EOC2       : 1;            /*!< [9..9] End of conversion of ADC 2                                         */
      __IM  uint32 JEOC2      : 1;            /*!< [10..10] Injected channel end of conversion of ADC 2                      */
      __IM  uint32 JSTRT2     : 1;            /*!< [11..11] Injected channel Start flag of ADC 2                             */
      __IM  uint32 STRT2      : 1;            /*!< [12..12] Regular channel Start flag of ADC 2                              */
      __IM  uint32 OVR2       : 1;            /*!< [13..13] Overrun flag of ADC 2                                            */
            uint32            : 2;
      __IM  uint32 AWD3       : 1;            /*!< [16..16] Analog watchdog flag of ADC 3                                    */
      __IM  uint32 EOC3       : 1;            /*!< [17..17] End of conversion of ADC 3                                       */
      __IM  uint32 JEOC3      : 1;            /*!< [18..18] Injected channel end of conversion of ADC 3                      */
      __IM  uint32 JSTRT3     : 1;            /*!< [19..19] Injected channel Start flag of ADC 3                             */
      __IM  uint32 STRT3      : 1;            /*!< [20..20] Regular channel Start flag of ADC 3                              */
      __IM  uint32 OVR3       : 1;            /*!< [21..21] Overrun flag of ADC3                                             */
            uint32            : 10;
    } bit;
  } CSR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) ADC common control register                                */
    
