Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 MULT       : 5;            /*!< [4..0] Multi ADC mode selection                                           */
            uint32            : 3;
      __IOM uint32 DELAY      : 4;            /*!< [11..8] Delay between 2 sampling phases                                   */
            uint32            : 1;
      __IOM uint32 DDS        : 1;            /*!< [13..13] DMA disable selection for multi-ADC mode                         */
      __IOM uint32 DMA        : 2;            /*!< [15..14] Direct memory access mode for multi ADC mode                     */
      __IOM uint32 ADCPRE     : 2;            /*!< [17..16] ADC prescaler                                                    */
            uint32            : 4;
      __IOM uint32 VBATE      : 1;            /*!< [22..22] VBAT enable                                                      */
      __IOM uint32 TSVREFE    : 1;            /*!< [23..23] Temperature sensor and VREFINT enable                            */
            uint32            : 8;
    } bit;
  } CCR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000008) ADC common regular data register for dual and
                                                                    triple modes                                               */
    
    struct {
      __IM  uint32 DATA1      : 16;           /*!< [15..0] 1st data item of a pair of regular conversions                    */
      __IM  uint32 DATA2      : 16;           /*!< [31..16] 2nd data item of a pair of regular conversions                   */
    } bit;
  } CDR;
} C_ADC_Type;                                   /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           TIM1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced-timers (TIM1)
  */

typedef struct {                                /*!< (@ 0x40010000) TIM1 Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register 1                                         */
    
    struct {
      __IOM uint32 CEN        : 1;            /*!< [0..0] Counter enable                                                     */
      __IOM uint32 UDIS       : 1;            /*!< [1..1] Update disable                                                     */
      __IOM uint32 URS        : 1;            /*!< [2..2] Update request source                                              */
      __IOM uint32 OPM        : 1;            /*!< [3..3] One-pulse mode                                                     */
      __IOM uint32 DIR        : 1;            /*!< [4..4] Direction                                                          */
      __IOM uint32 CMS        : 2;            /*!< [6..5] Center-aligned mode selection                                      */
      __IOM uint32 ARPE       : 1;            /*!< [7..7] Auto-reload preload enable                                         */
      __IOM uint32 CKD        : 2;            /*!< [9..8] Clock division                                                     */
            uint32            : 22;
    } bit;
  } CR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) control register 2                                         */
    
    struct {
      __IOM uint32 CCPC       : 1;            /*!< [0..0] Capture/compare preloaded control                                  */
            uint32            : 1;
      __IOM uint32 CCUS       : 1;            /*!< [2..2] Capture/compare control update selection                           */
      __IOM uint32 CCDS       : 1;            /*!< [3..3] Capture/compare DMA selection                                      */
      __IOM uint32 MMS        : 3;            /*!< [6..4] Master mode selection                                              */
      __IOM uint32 TI1S       : 1;            /*!< [7..7] TI1 selection                                                      */
      __IOM uint32 OIS1       : 1;            /*!< [8..8] Output Idle state 1                                                */
      __IOM uint32 OIS1N      : 1;            /*!< [9..9] Output Idle state 1                                                */
      __IOM uint32 OIS2       : 1;            /*!< [10..10] Output Idle state 2                                              */
      __IOM uint32 OIS2N      : 1;            /*!< [11..11] Output Idle state 2                                              */
      __IOM uint32 OIS3       : 1;            /*!< [12..12] Output Idle state 3                                              */
      __IOM uint32 OIS3N      : 1;            /*!< [13..13] Output Idle state 3                                              */
      __IOM uint32 OIS4       : 1;            /*!< [14..14] Output Idle state 4                                              */
            uint32            : 17;
    } bit;
  } CR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) slave mode control register                                */
    
    struct {
      __IOM uint32 SMS        : 3;            /*!< [2..0] Slave mode selection - bit[2:0]                                    */
            uint32            : 1;
      __IOM uint32 TS         : 3;            /*!< [6..4] Trigger selection                                                  */
      __IOM uint32 MSM        : 1;            /*!< [7..7] Master/Slave mode                                                  */
      __IOM uint32 ETF        : 4;            /*!< [11..8] External trigger filter                                           */
      __IOM uint32 ETPS       : 2;            /*!< [13..12] External trigger prescaler                                       */
      __IOM uint32 ECE        : 1;            /*!< [14..14] External clock enable                                            */
      __IOM uint32 ETP        : 1;            /*!< [15..15] External trigger polarity                                        */
      __IOM uint32 SMS_3      : 1;            /*!< [16..16] Slave model selection - bit[3]                                   */
            uint32            : 15;
    } bit;
  } SMCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */
    
