Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 UIE        : 1;            /*!< [0..0] Update interrupt enable                                            */
      __IOM uint32 CC1IE      : 1;            /*!< [1..1] Capture/Compare 1 interrupt enable                                 */
      __IOM uint32 CC2IE      : 1;            /*!< [2..2] Capture/Compare 2 interrupt enable                                 */
      __IOM uint32 CC3IE      : 1;            /*!< [3..3] Capture/Compare 3 interrupt enable                                 */
      __IOM uint32 CC4IE      : 1;            /*!< [4..4] Capture/Compare 4 interrupt enable                                 */
      __IOM uint32 COMIE      : 1;            /*!< [5..5] COM interrupt enable                                               */
      __IOM uint32 TIE        : 1;            /*!< [6..6] Trigger interrupt enable                                           */
      __IOM uint32 BIE        : 1;            /*!< [7..7] Break interrupt enable                                             */
      __IOM uint32 UDE        : 1;            /*!< [8..8] Update DMA request enable                                          */
      __IOM uint32 CC1DE      : 1;            /*!< [9..9] Capture/Compare 1 DMA request enable                               */
      __IOM uint32 CC2DE      : 1;            /*!< [10..10] Capture/Compare 2 DMA request enable                             */
      __IOM uint32 CC3DE      : 1;            /*!< [11..11] Capture/Compare 3 DMA request enable                             */
      __IOM uint32 CC4DE      : 1;            /*!< [12..12] Capture/Compare 4 DMA request enable                             */
      __IOM uint32 COMDE      : 1;            /*!< [13..13] COM DMA request enable                                           */
      __IOM uint32 TDE        : 1;            /*!< [14..14] Trigger DMA request enable                                       */
            uint32            : 17;
    } bit;
  } DIER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) status register                                            */
    
    struct {
      __IOM uint32 UIF        : 1;            /*!< [0..0] Update interrupt flag                                              */
      __IOM uint32 CC1IF      : 1;            /*!< [1..1] Capture/compare 1 interrupt flag                                   */
      __IOM uint32 CC2IF      : 1;            /*!< [2..2] Capture/Compare 2 interrupt flag                                   */
      __IOM uint32 CC3IF      : 1;            /*!< [3..3] Capture/Compare 3 interrupt flag                                   */
      __IOM uint32 CC4IF      : 1;            /*!< [4..4] Capture/Compare 4 interrupt flag                                   */
      __IOM uint32 COMIF      : 1;            /*!< [5..5] COM interrupt flag                                                 */
      __IOM uint32 TIF        : 1;            /*!< [6..6] Trigger interrupt flag                                             */
      __IOM uint32 BIF        : 1;            /*!< [7..7] Break interrupt flag                                               */
            uint32            : 1;
      __IOM uint32 CC1OF      : 1;            /*!< [9..9] Capture/Compare 1 overcapture flag                                 */
      __IOM uint32 CC2OF      : 1;            /*!< [10..10] Capture/compare 2 overcapture flag                               */
      __IOM uint32 CC3OF      : 1;            /*!< [11..11] Capture/Compare 3 overcapture flag                               */
      __IOM uint32 CC4OF      : 1;            /*!< [12..12] Capture/Compare 4 overcapture flag                               */
            uint32            : 19;
    } bit;
  } SR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000014) event generation register                                  */
    
    struct {
      __OM  uint32 UG         : 1;            /*!< [0..0] Update generation                                                  */
      __OM  uint32 CC1G       : 1;            /*!< [1..1] Capture/compare 1 generation                                       */
      __OM  uint32 CC2G       : 1;            /*!< [2..2] Capture/compare 2 generation                                       */
      __OM  uint32 CC3G       : 1;            /*!< [3..3] Capture/compare 3 generation                                       */
      __OM  uint32 CC4G       : 1;            /*!< [4..4] Capture/compare 4 generation                                       */
      __OM  uint32 COMG       : 1;            /*!< [5..5] Capture/Compare control update generation                          */
      __OM  uint32 TG         : 1;            /*!< [6..6] Trigger generation                                                 */
      __OM  uint32 BG         : 1;            /*!< [7..7] Break generation                                                   */
            uint32            : 24;
    } bit;
  } EGR;
  
  union {
    union {
      __IOM uint32 reg;                       /*!< (@ 0x00000018) capture/compare mode register 1 (output mode)              */
      
      struct {
        __IOM uint32 CC1S     : 2;            /*!< [1..0] Capture/Compare 1 selection                                        */
        __IOM uint32 OC1FE    : 1;            /*!< [2..2] Output Compare 1 fast enable                                       */
        __IOM uint32 OC1PE    : 1;            /*!< [3..3] Output Compare 1 preload enable                                    */
        __IOM uint32 OC1M     : 3;            /*!< [6..4] Output Compare 1 mode                                              */
        __IOM uint32 OC1CE    : 1;            /*!< [7..7] Output Compare 1 clear enable                                      */
        __IOM uint32 CC2S     : 2;            /*!< [9..8] Capture/Compare 2 selection                                        */
        __IOM uint32 OC2FE    : 1;            /*!< [10..10] Output Compare 2 fast enable                                     */
        __IOM uint32 OC2PE    : 1;            /*!< [11..11] Output Compare 2 preload enable                                  */
        __IOM uint32 OC2M     : 3;            /*!< [14..12] Output Compare 2 mode                                            */
        __IOM uint32 OC2CE    : 1;            /*!< [15..15] Output Compare 2 clear enable                                    */
              uint32          : 16;
      } bit;
    } CCMR1_Output;
    
    union {
      __IOM uint32 reg;                       /*!< (@ 0x00000018) capture/compare mode register 1 (input mode)               */
      
