Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
      struct {
        __IOM uint32 CC1S     : 2;            /*!< [1..0] Capture/Compare 1 selection                                        */
        __IOM uint32 ICPCS    : 2;            /*!< [3..2] Input capture 1 prescaler                                          */
        __IOM uint32 IC1F     : 4;            /*!< [7..4] Input capture 1 filter                                             */
        __IOM uint32 CC2S     : 2;            /*!< [9..8] Capture/Compare 2 selection                                        */
        __IOM uint32 IC2PCS   : 2;            /*!< [11..10] Input capture 2 prescaler                                        */
        __IOM uint32 IC2F     : 4;            /*!< [15..12] Input capture 2 filter                                           */
              uint32          : 16;
      } bit;
    } CCMR1_Input;
  };
  
  union {
    union {
      __IOM uint32 reg;                       /*!< (@ 0x0000001C) capture/compare mode register 2 (output mode)              */
      
      struct {
        __IOM uint32 CC3S     : 2;            /*!< [1..0] Capture/Compare 3 selection                                        */
        __IOM uint32 OC3FE    : 1;            /*!< [2..2] Output compare 3 fast enable                                       */
        __IOM uint32 OC3PE    : 1;            /*!< [3..3] Output compare 3 preload enable                                    */
        __IOM uint32 OC3M     : 3;            /*!< [6..4] Output compare 3 mode                                              */
        __IOM uint32 OC3CE    : 1;            /*!< [7..7] Output compare 3 clear enable                                      */
        __IOM uint32 CC4S     : 2;            /*!< [9..8] Capture/Compare 4 selection                                        */
        __IOM uint32 OC4FE    : 1;            /*!< [10..10] Output compare 4 fast enable                                     */
        __IOM uint32 OC4PE    : 1;            /*!< [11..11] Output compare 4 preload enable                                  */
        __IOM uint32 OC4M     : 3;            /*!< [14..12] Output compare 4 mode                                            */
        __IOM uint32 OC4CE    : 1;            /*!< [15..15] Output compare 4 clear enable                                    */
              uint32          : 16;
      } bit;
    } CCMR2_Output;
    
    union {
      __IOM uint32 reg;                       /*!< (@ 0x0000001C) capture/compare mode register 2 (input mode)               */
      
      struct {
        __IOM uint32 CC3S     : 2;            /*!< [1..0] Capture/compare 3 selection                                        */
        __IOM uint32 IC3PSC   : 2;            /*!< [3..2] Input capture 3 prescaler                                          */
        __IOM uint32 IC3F     : 4;            /*!< [7..4] Input capture 3 filter                                             */
        __IOM uint32 CC4S     : 2;            /*!< [9..8] Capture/Compare 4 selection                                        */
        __IOM uint32 IC4PSC   : 2;            /*!< [11..10] Input capture 4 prescaler                                        */
        __IOM uint32 IC4F     : 4;            /*!< [15..12] Input capture 4 filter                                           */
              uint32          : 16;
      } bit;
    } CCMR2_Input;
  };
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) capture/compare enable register                            */
    
    struct {
      __IOM uint32 CC1E       : 1;            /*!< [0..0] Capture/Compare 1 output enable                                    */
      __IOM uint32 CC1P       : 1;            /*!< [1..1] Capture/Compare 1 output Polarity                                  */
      __IOM uint32 CC1NE      : 1;            /*!< [2..2] Capture/Compare 1 complementary output enable                      */
      __IOM uint32 CC1NP      : 1;            /*!< [3..3] Capture/Compare 1 output Polarity                                  */
      __IOM uint32 CC2E       : 1;            /*!< [4..4] Capture/Compare 2 output enable                                    */
      __IOM uint32 CC2P       : 1;            /*!< [5..5] Capture/Compare 2 output Polarity                                  */
      __IOM uint32 CC2NE      : 1;            /*!< [6..6] Capture/Compare 2 complementary output enable                      */
      __IOM uint32 CC2NP      : 1;            /*!< [7..7] Capture/Compare 2 output Polarity                                  */
      __IOM uint32 CC3E       : 1;            /*!< [8..8] Capture/Compare 3 output enable                                    */
      __IOM uint32 CC3P       : 1;            /*!< [9..9] Capture/Compare 3 output Polarity                                  */
      __IOM uint32 CC3NE      : 1;            /*!< [10..10] Capture/Compare 3 complementary output enable                    */
      __IOM uint32 CC3NP      : 1;            /*!< [11..11] Capture/Compare 3 output Polarity                                */
      __IOM uint32 CC4E       : 1;            /*!< [12..12] Capture/Compare 4 output enable                                  */
      __IOM uint32 CC4P       : 1;            /*!< [13..13] Capture/Compare 3 output Polarity                                */
            uint32            : 18;
    } bit;
  } CCER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) counter                                                    */
    
    struct {
      __IOM uint32 CNT        : 16;           /*!< [15..0] counter value                                                     */
            uint32            : 16;
    } bit;
  } CNT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) prescaler                                                  */
    
    struct {
      __IOM uint32 PSC        : 16;           /*!< [15..0] Prescaler value                                                   */
            uint32            : 16;
    } bit;
  } PSC;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) auto-reload register                                       */
    
