Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 ARR        : 16;           /*!< [15..0] Auto-reload value                                                 */
            uint32            : 16;
    } bit;
  } ARR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000030) repetition counter register                                */
    
    struct {
      __IOM uint32 REP        : 8;            /*!< [7..0] Repetition counter value                                           */
            uint32            : 24;
    } bit;
  } RCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) capture/compare register 1                                 */
    
    struct {
      __IOM uint32 CCR1       : 16;           /*!< [15..0] Capture/Compare 1 value                                           */
            uint32            : 16;
    } bit;
  } CCR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000038) capture/compare register 2                                 */
    
    struct {
      __IOM uint32 CCR2       : 16;           /*!< [15..0] Capture/Compare 2 value                                           */
            uint32            : 16;
    } bit;
  } CCR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000003C) capture/compare register 3                                 */
    
    struct {
      __IOM uint32 CCR3       : 16;           /*!< [15..0] Capture/Compare value                                             */
            uint32            : 16;
    } bit;
  } CCR3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000040) capture/compare register 4                                 */
    
    struct {
      __IOM uint32 CCR4       : 16;           /*!< [15..0] Capture/Compare value                                             */
            uint32            : 16;
    } bit;
  } CCR4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000044) break and dead-time register                               */
    
    struct {
      __IOM uint32 DTG        : 8;            /*!< [7..0] Dead-time generator setup                                          */
      __IOM uint32 LOCK       : 2;            /*!< [9..8] Lock configuration                                                 */
      __IOM uint32 OSSI       : 1;            /*!< [10..10] Off-state selection for Idle mode                                */
      __IOM uint32 OSSR       : 1;            /*!< [11..11] Off-state selection for Run mode                                 */
      __IOM uint32 BKE        : 1;            /*!< [12..12] Break enable                                                     */
      __IOM uint32 BKP        : 1;            /*!< [13..13] Break polarity                                                   */
      __IOM uint32 AOE        : 1;            /*!< [14..14] Automatic output enable                                          */
      __IOM uint32 MOE        : 1;            /*!< [15..15] Main output enable                                               */
            uint32            : 16;
    } bit;
  } BDTR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000048) DMA control register                                       */
    
    struct {
      __IOM uint32 DBA        : 5;            /*!< [4..0] DMA base address                                                   */
            uint32            : 3;
      __IOM uint32 DBL        : 5;            /*!< [12..8] DMA burst length                                                  */
            uint32            : 19;
    } bit;
  } DCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000004C) DMA address for full transfer                              */
    
    struct {
      __IOM uint32 DMAB       : 16;           /*!< [15..0] DMA register for burst accesses                                   */
            uint32            : 16;
    } bit;
  } DMAR;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000054) capture/compare mode register 3 (output mode)              */
    
    struct {
            uint32            : 2;
      __IOM uint32 OC5FE      : 1;            /*!< [2..2] Output compare 5 fast enable                                       */
      __IOM uint32 OC5PE      : 1;            /*!< [3..3] Output compare 5 preload enable                                    */
      __IOM uint32 OC5M       : 3;            /*!< [6..4] Output compare 5 mode                                              */
      __IOM uint32 OC5CE      : 1;            /*!< [7..7] Output compare 5 clear enable                                      */
            uint32            : 2;
      __IOM uint32 OC6FE      : 1;            /*!< [10..10] Output compare 6 fast enable                                     */
      __IOM uint32 OC6PE      : 1;            /*!< [11..11] Output compare 6 preload enable                                  */
      __IOM uint32 OC6M       : 3;            /*!< [14..12] Output compare 6 mode                                            */
      __IOM uint32 OC6CE      : 1;            /*!< [15..15] Output compare 6 clear enable                                    */
      __IOM uint32 OC5M3      : 1;            /*!< [16..16] Output Compare 5 mode                                            */
            uint32            : 7;
      __IOM uint32 OC6M3      : 1;            /*!< [24..24] Output Compare 6 mode                                            */
            uint32            : 7;
    } bit;
  } CCMR3_Output;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000058) capture/compare register 5                                 */
    
    struct {
      __IOM uint32 CCR5       : 16;           /*!< [15..0] Capture/Compare 5 value                                           */
            uint32            : 13;
      __IOM uint32 GC5C1      : 1;            /*!< [29..29] Group Channel 5 and Channel 1                                    */
      __IOM uint32 GC5C2      : 1;            /*!< [30..30] Group Channel 5 and Channel 2                                    */
      __IOM uint32 GC5C3      : 1;            /*!< [31..31] Group Channel 5 and Channel 3                                    */
    } bit;
  } CCR5;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000005C) capture/compare register 6                                 */
    
