Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 CCR6       : 16;           /*!< [15..0] Capture/Compare 6 value                                           */
            uint32            : 16;
    } bit;
  } CRR6;
} TIM1_Type;                                    /*!< Size = 96 (0x60)                                                          */



/* =========================================================================================================================== */
/* ================                                           TIM2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General purpose timers (TIM2)
  */

typedef struct {                                /*!< (@ 0x40000000) TIM2 Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register 1                                         */
    
    struct {
      __IOM uint32 CEN        : 1;            /*!< [0..0] Counter enable                                                     */
      __IOM uint32 UDIS       : 1;            /*!< [1..1] Update disable                                                     */
      __IOM uint32 URS        : 1;            /*!< [2..2] Update request source                                              */
      __IOM uint32 OPM        : 1;            /*!< [3..3] One-pulse mode                                                     */
      __IOM uint32 DIR        : 1;            /*!< [4..4] Direction                                                          */
      __IOM uint32 CMS        : 2;            /*!< [6..5] Center-aligned mode selection                                      */
      __IOM uint32 ARPE       : 1;            /*!< [7..7] Auto-reload preload enable                                         */
      __IOM uint32 CKD        : 2;            /*!< [9..8] Clock division                                                     */
            uint32            : 22;
    } bit;
  } CR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) control register 2                                         */
    
    struct {
            uint32            : 3;
      __IOM uint32 CCDS       : 1;            /*!< [3..3] Capture/compare DMA selection                                      */
      __IOM uint32 MMS        : 3;            /*!< [6..4] Master mode selection                                              */
      __IOM uint32 TI1S       : 1;            /*!< [7..7] TI1 selection                                                      */
            uint32            : 24;
    } bit;
  } CR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) slave mode control register                                */
    
    struct {
      __IOM uint32 SMS        : 3;            /*!< [2..0] Slave mode selection                                               */
            uint32            : 1;
      __IOM uint32 TS         : 3;            /*!< [6..4] Trigger selection                                                  */
      __IOM uint32 MSM        : 1;            /*!< [7..7] Master/Slave mode                                                  */
      __IOM uint32 ETF        : 4;            /*!< [11..8] External trigger filter                                           */
      __IOM uint32 ETPS       : 2;            /*!< [13..12] External trigger prescaler                                       */
      __IOM uint32 ECE        : 1;            /*!< [14..14] External clock enable                                            */
      __IOM uint32 ETP        : 1;            /*!< [15..15] External trigger polarity                                        */
      __IOM uint32 SMS_3      : 1;            /*!< [16..16] Slave model selection - bit[3]                                   */
            uint32            : 15;
    } bit;
  } SMCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */
    
    struct {
      __IOM uint32 UIE        : 1;            /*!< [0..0] Update interrupt enable                                            */
      __IOM uint32 CC1IE      : 1;            /*!< [1..1] Capture/Compare 1 interrupt enable                                 */
      __IOM uint32 CC2IE      : 1;            /*!< [2..2] Capture/Compare 2 interrupt enable                                 */
      __IOM uint32 CC3IE      : 1;            /*!< [3..3] Capture/Compare 3 interrupt enable                                 */
      __IOM uint32 CC4IE      : 1;            /*!< [4..4] Capture/Compare 4 interrupt enable                                 */
            uint32            : 1;
      __IOM uint32 TIE        : 1;            /*!< [6..6] Trigger interrupt enable                                           */
            uint32            : 1;
      __IOM uint32 UDE        : 1;            /*!< [8..8] Update DMA request enable                                          */
      __IOM uint32 CC1DE      : 1;            /*!< [9..9] Capture/Compare 1 DMA request enable                               */
      __IOM uint32 CC2DE      : 1;            /*!< [10..10] Capture/Compare 2 DMA request enable                             */
      __IOM uint32 CC3DE      : 1;            /*!< [11..11] Capture/Compare 3 DMA request enable                             */
      __IOM uint32 CC4DE      : 1;            /*!< [12..12] Capture/Compare 4 DMA request enable                             */
            uint32            : 1;
      __IOM uint32 TDE        : 1;            /*!< [14..14] Trigger DMA request enable                                       */
            uint32            : 17;
    } bit;
  } DIER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) status register                                            */
    
