Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 UIF        : 1;            /*!< [0..0] Update interrupt flag                                              */
      __IOM uint32 CC1IF      : 1;            /*!< [1..1] Capture/compare 1 interrupt flag                                   */
      __IOM uint32 CC2IF      : 1;            /*!< [2..2] Capture/Compare 2 interrupt flag                                   */
      __IOM uint32 CC3IF      : 1;            /*!< [3..3] Capture/Compare 3 interrupt flag                                   */
      __IOM uint32 CC4IF      : 1;            /*!< [4..4] Capture/Compare 4 interrupt flag                                   */
            uint32            : 1;
      __IOM uint32 TIF        : 1;            /*!< [6..6] Trigger interrupt flag                                             */
            uint32            : 2;
      __IOM uint32 CC1OF      : 1;            /*!< [9..9] Capture/Compare 1 overcapture flag                                 */
      __IOM uint32 CC2OF      : 1;            /*!< [10..10] Capture/compare 2 overcapture flag                               */
      __IOM uint32 CC3OF      : 1;            /*!< [11..11] Capture/Compare 3 overcapture flag                               */
      __IOM uint32 CC4OF      : 1;            /*!< [12..12] Capture/Compare 4 overcapture flag                               */
            uint32            : 19;
    } bit;
  } SR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000014) event generation register                                  */
    
    struct {
      __OM  uint32 UG         : 1;            /*!< [0..0] Update generation                                                  */
      __OM  uint32 CC1G       : 1;            /*!< [1..1] Capture/compare 1 generation                                       */
      __OM  uint32 CC2G       : 1;            /*!< [2..2] Capture/compare 2 generation                                       */
      __OM  uint32 CC3G       : 1;            /*!< [3..3] Capture/compare 3 generation                                       */
      __OM  uint32 CC4G       : 1;            /*!< [4..4] Capture/compare 4 generation                                       */
            uint32            : 1;
      __OM  uint32 TG         : 1;            /*!< [6..6] Trigger generation                                                 */
            uint32            : 25;
    } bit;
  } EGR;
  
  union {
    union {
      __IOM uint32 reg;                       /*!< (@ 0x00000018) capture/compare mode register 1 (output mode)              */
      
      struct {
        __IOM uint32 CC1S     : 2;            /*!< [1..0] CC1S                                                               */
        __IOM uint32 OC1FE    : 1;            /*!< [2..2] OC1FE                                                              */
        __IOM uint32 OC1PE    : 1;            /*!< [3..3] OC1PE                                                              */
        __IOM uint32 OC1M     : 3;            /*!< [6..4] OC1M                                                               */
        __IOM uint32 OC1CE    : 1;            /*!< [7..7] OC1CE                                                              */
        __IOM uint32 CC2S     : 2;            /*!< [9..8] CC2S                                                               */
        __IOM uint32 OC2FE    : 1;            /*!< [10..10] OC2FE                                                            */
        __IOM uint32 OC2PE    : 1;            /*!< [11..11] OC2PE                                                            */
        __IOM uint32 OC2M     : 3;            /*!< [14..12] OC2M                                                             */
        __IOM uint32 OC2CE    : 1;            /*!< [15..15] OC2CE                                                            */
              uint32          : 16;
      } bit;
    } CCMR1_Output;
    
    union {
      __IOM uint32 reg;                       /*!< (@ 0x00000018) capture/compare mode register 1 (input mode)               */
      
      struct {
        __IOM uint32 CC1S     : 2;            /*!< [1..0] Capture/Compare 1 selection                                        */
        __IOM uint32 ICPCS    : 2;            /*!< [3..2] Input capture 1 prescaler                                          */
        __IOM uint32 IC1F     : 4;            /*!< [7..4] Input capture 1 filter                                             */
        __IOM uint32 CC2S     : 2;            /*!< [9..8] Capture/Compare 2 selection                                        */
        __IOM uint32 IC2PCS   : 2;            /*!< [11..10] Input capture 2 prescaler                                        */
        __IOM uint32 IC2F     : 4;            /*!< [15..12] Input capture 2 filter                                           */
              uint32          : 16;
      } bit;
    } CCMR1_Input;
  };
  
  union {
    union {
      __IOM uint32 reg;                       /*!< (@ 0x0000001C) capture/compare mode register 2 (output mode)              */
      
      struct {
        __IOM uint32 CC3S     : 2;            /*!< [1..0] CC3S                                                               */
        __IOM uint32 OC3FE    : 1;            /*!< [2..2] OC3FE                                                              */
        __IOM uint32 OC3PE    : 1;            /*!< [3..3] OC3PE                                                              */
        __IOM uint32 OC3M     : 3;            /*!< [6..4] OC3M                                                               */
        __IOM uint32 OC3CE    : 1;            /*!< [7..7] OC3CE                                                              */
        __IOM uint32 CC4S     : 2;            /*!< [9..8] CC4S                                                               */
        __IOM uint32 OC4FE    : 1;            /*!< [10..10] OC4FE                                                            */
        __IOM uint32 OC4PE    : 1;            /*!< [11..11] OC4PE                                                            */
        __IOM uint32 OC4M     : 3;            /*!< [14..12] OC4M                                                             */
        __IOM uint32 O24CE    : 1;            /*!< [15..15] O24CE                                                            */
              uint32          : 16;
      } bit;
    } CCMR2_Output;
    
    union {
      __IOM uint32 reg;                       /*!< (@ 0x0000001C) capture/compare mode register 2 (input mode)               */
      
