Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
      struct {
        __IOM uint32 CC3S     : 2;            /*!< [1..0] Capture/compare 3 selection                                        */
        __IOM uint32 IC3PSC   : 2;            /*!< [3..2] Input capture 3 prescaler                                          */
        __IOM uint32 IC3F     : 4;            /*!< [7..4] Input capture 3 filter                                             */
        __IOM uint32 CC4S     : 2;            /*!< [9..8] Capture/Compare 4 selection                                        */
        __IOM uint32 IC4PSC   : 2;            /*!< [11..10] Input capture 4 prescaler                                        */
        __IOM uint32 IC4F     : 4;            /*!< [15..12] Input capture 4 filter                                           */
              uint32          : 16;
      } bit;
    } CCMR2_Input;
  };
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) capture/compare enable register                            */
    
    struct {
      __IOM uint32 CC1E       : 1;            /*!< [0..0] Capture/Compare 1 output enable                                    */
      __IOM uint32 CC1P       : 1;            /*!< [1..1] Capture/Compare 1 output Polarity                                  */
            uint32            : 1;
      __IOM uint32 CC1NP      : 1;            /*!< [3..3] Capture/Compare 1 output Polarity                                  */
      __IOM uint32 CC2E       : 1;            /*!< [4..4] Capture/Compare 2 output enable                                    */
      __IOM uint32 CC2P       : 1;            /*!< [5..5] Capture/Compare 2 output Polarity                                  */
            uint32            : 1;
      __IOM uint32 CC2NP      : 1;            /*!< [7..7] Capture/Compare 2 output Polarity                                  */
      __IOM uint32 CC3E       : 1;            /*!< [8..8] Capture/Compare 3 output enable                                    */
      __IOM uint32 CC3P       : 1;            /*!< [9..9] Capture/Compare 3 output Polarity                                  */
            uint32            : 1;
      __IOM uint32 CC3NP      : 1;            /*!< [11..11] Capture/Compare 3 output Polarity                                */
      __IOM uint32 CC4E       : 1;            /*!< [12..12] Capture/Compare 4 output enable                                  */
      __IOM uint32 CC4P       : 1;            /*!< [13..13] Capture/Compare 3 output Polarity                                */
            uint32            : 1;
      __IOM uint32 CC4NP      : 1;            /*!< [15..15] Capture/Compare 4 output Polarity                                */
            uint32            : 16;
    } bit;
  } CCER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) counter                                                    */
    
    struct {
      __IOM uint32 CNT_L      : 16;           /*!< [15..0] Low counter value                                                 */
      __IOM uint32 CNT_H      : 16;           /*!< [31..16] High counter value                                               */
    } bit;
  } CNT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) prescaler                                                  */
    
    struct {
      __IOM uint32 PSC        : 16;           /*!< [15..0] Prescaler value                                                   */
            uint32            : 16;
    } bit;
  } PSC;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) auto-reload register                                       */
    
    struct {
      __IOM uint32 ARR_L      : 16;           /*!< [15..0] Low Auto-reload value                                             */
      __IOM uint32 ARR_H      : 16;           /*!< [31..16] High Auto-reload value                                           */
    } bit;
  } ARR;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) capture/compare register 1                                 */
    
    struct {
      __IOM uint32 CCR1_L     : 16;           /*!< [15..0] Low Capture/Compare 1 value                                       */
      __IOM uint32 CCR1_H     : 16;           /*!< [31..16] High Capture/Compare 1 value                                     */
    } bit;
  } CCR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000038) capture/compare register 2                                 */
    
    struct {
      __IOM uint32 CCR2_L     : 16;           /*!< [15..0] Low Capture/Compare 2 value                                       */
      __IOM uint32 CCR2_H     : 16;           /*!< [31..16] High Capture/Compare 2 value                                     */
    } bit;
  } CCR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000003C) capture/compare register 3                                 */
    
    struct {
      __IOM uint32 CCR3_L     : 16;           /*!< [15..0] Low Capture/Compare value                                         */
      __IOM uint32 CCR3_H     : 16;           /*!< [31..16] High Capture/Compare value                                       */
    } bit;
  } CCR3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000040) capture/compare register 4                                 */
    
    struct {
      __IOM uint32 CCR4_L     : 16;           /*!< [15..0] Low Capture/Compare value                                         */
      __IOM uint32 CCR4_H     : 16;           /*!< [31..16] High Capture/Compare value                                       */
    } bit;
  } CCR4;
  __IM  uint32  RESERVED1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000048) DMA control register                                       */
    
    struct {
      __IOM uint32 DBA        : 5;            /*!< [4..0] DMA base address                                                   */
            uint32            : 3;
      __IOM uint32 DBL        : 5;            /*!< [12..8] DMA burst length                                                  */
            uint32            : 19;
    } bit;
  } DCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000004C) DMA address for full transfer                              */
    
