Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
      struct {
        __IOM uint32 CC1S     : 2;            /*!< [1..0] Capture/Compare 1 selection                                        */
        __IOM uint32 ICPCS    : 2;            /*!< [3..2] Input capture 1 prescaler                                          */
        __IOM uint32 IC1F     : 3;            /*!< [6..4] Input capture 1 filter                                             */
              uint32          : 1;
        __IOM uint32 CC2S     : 2;            /*!< [9..8] Capture/Compare 2 selection                                        */
        __IOM uint32 IC2PCS   : 2;            /*!< [11..10] Input capture 2 prescaler                                        */
        __IOM uint32 IC2F     : 3;            /*!< [14..12] Input capture 2 filter                                           */
              uint32          : 17;
      } bit;
    } CCMR1_Input;
  };
  __IM  uint32  RESERVED1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) capture/compare enable register                            */
    
    struct {
      __IOM uint32 CC1E       : 1;            /*!< [0..0] Capture/Compare 1 output enable                                    */
      __IOM uint32 CC1P       : 1;            /*!< [1..1] Capture/Compare 1 output Polarity                                  */
            uint32            : 1;
      __IOM uint32 CC1NP      : 1;            /*!< [3..3] Capture/Compare 1 output Polarity                                  */
      __IOM uint32 CC2E       : 1;            /*!< [4..4] Capture/Compare 2 output enable                                    */
      __IOM uint32 CC2P       : 1;            /*!< [5..5] Capture/Compare 2 output Polarity                                  */
            uint32            : 1;
      __IOM uint32 CC2NP      : 1;            /*!< [7..7] Capture/Compare 2 output Polarity                                  */
            uint32            : 24;
    } bit;
  } CCER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) counter                                                    */
    
    struct {
      __IOM uint32 CNT        : 16;           /*!< [15..0] counter value                                                     */
            uint32            : 16;
    } bit;
  } CNT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) prescaler                                                  */
    
    struct {
      __IOM uint32 PSC        : 16;           /*!< [15..0] Prescaler value                                                   */
            uint32            : 16;
    } bit;
  } PSC;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) auto-reload register                                       */
    
    struct {
      __IOM uint32 ARR        : 16;           /*!< [15..0] Auto-reload value                                                 */
            uint32            : 16;
    } bit;
  } ARR;
  __IM  uint32  RESERVED2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) capture/compare register 1                                 */
    
    struct {
      __IOM uint32 CCR1       : 16;           /*!< [15..0] Capture/Compare 1 value                                           */
            uint32            : 16;
    } bit;
  } CCR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000038) capture/compare register 2                                 */
    
    struct {
      __IOM uint32 CCR2       : 16;           /*!< [15..0] Capture/Compare 2 value                                           */
            uint32            : 16;
    } bit;
  } CCR2;
} TIM9_Type;                                    /*!< Size = 60 (0x3c)                                                          */



/* =========================================================================================================================== */
/* ================                                           TIM10                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose-timers (TIM10)
  */

typedef struct {                                /*!< (@ 0x40014400) TIM10 Structure                                            */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register 1                                         */
    
    struct {
      __IOM uint32 CEN        : 1;            /*!< [0..0] Counter enable                                                     */
      __IOM uint32 UDIS       : 1;            /*!< [1..1] Update disable                                                     */
      __IOM uint32 URS        : 1;            /*!< [2..2] Update request source                                              */
            uint32            : 4;
      __IOM uint32 ARPE       : 1;            /*!< [7..7] Auto-reload preload enable                                         */
      __IOM uint32 CKD        : 2;            /*!< [9..8] Clock division                                                     */
            uint32            : 22;
    } bit;
  } CR1;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) slave mode control register                                */
    
    struct {
      __IOM uint32 SMS        : 3;            /*!< [2..0] Slave mode selection                                               */
            uint32            : 1;
      __IOM uint32 TS         : 3;            /*!< [6..4] Trigger selection                                                  */
      __IOM uint32 MSM        : 1;            /*!< [7..7] Master/slave mode                                                  */
      __IOM uint32 ETF        : 4;            /*!< [11..8] External trigger filter                                           */
      __IOM uint32 ETPS       : 2;            /*!< [13..12] External trigger prescaler                                       */
      __IOM uint32 ECE        : 1;            /*!< [14..14] External clock enable                                            */
      __IOM uint32 ETP        : 1;            /*!< [15..15] External trigger polarity                                        */
      __IOM uint32 SMS3       : 1;            /*!< [16..16] Slave mode selection                                             */
            uint32            : 15;
    } bit;
  } SMCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */
    
