Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 UIE        : 1;            /*!< [0..0] Update interrupt enable                                            */
      __IOM uint32 CC1IE      : 1;            /*!< [1..1] Capture/Compare 1 interrupt enable                                 */
            uint32            : 30;
    } bit;
  } DIER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) status register                                            */
    
    struct {
      __IOM uint32 UIF        : 1;            /*!< [0..0] Update interrupt flag                                              */
      __IOM uint32 CC1IF      : 1;            /*!< [1..1] Capture/compare 1 interrupt flag                                   */
            uint32            : 7;
      __IOM uint32 CC1OF      : 1;            /*!< [9..9] Capture/Compare 1 overcapture flag                                 */
            uint32            : 22;
    } bit;
  } SR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000014) event generation register                                  */
    
    struct {
      __OM  uint32 UG         : 1;            /*!< [0..0] Update generation                                                  */
      __OM  uint32 CC1G       : 1;            /*!< [1..1] Capture/compare 1 generation                                       */
            uint32            : 30;
    } bit;
  } EGR;
  
  union {
    union {
      __IOM uint32 reg;                       /*!< (@ 0x00000018) capture/compare mode register 1 (output mode)              */
      
      struct {
        __IOM uint32 CC1S     : 2;            /*!< [1..0] Capture/Compare 1 selection                                        */
        __IOM uint32 OC1FE    : 1;            /*!< [2..2] Output Compare 1 fast enable                                       */
        __IOM uint32 OC1PE    : 1;            /*!< [3..3] Output Compare 1 preload enable                                    */
        __IOM uint32 OC1M     : 3;            /*!< [6..4] Output Compare 1 mode                                              */
              uint32          : 25;
      } bit;
    } CCMR1_Output;
    
    union {
      __IOM uint32 reg;                       /*!< (@ 0x00000018) capture/compare mode register 1 (input mode)               */
      
      struct {
        __IOM uint32 CC1S     : 2;            /*!< [1..0] Capture/Compare 1 selection                                        */
        __IOM uint32 ICPCS    : 2;            /*!< [3..2] Input capture 1 prescaler                                          */
        __IOM uint32 IC1F     : 4;            /*!< [7..4] Input capture 1 filter                                             */
              uint32          : 24;
      } bit;
    } CCMR1_Input;
  };
  __IM  uint32  RESERVED1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) capture/compare enable register                            */
    
    struct {
      __IOM uint32 CC1E       : 1;            /*!< [0..0] Capture/Compare 1 output enable                                    */
      __IOM uint32 CC1P       : 1;            /*!< [1..1] Capture/Compare 1 output Polarity                                  */
            uint32            : 1;
      __IOM uint32 CC1NP      : 1;            /*!< [3..3] Capture/Compare 1 output Polarity                                  */
            uint32            : 28;
    } bit;
  } CCER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) counter                                                    */
    
    struct {
      __IOM uint32 CNT        : 16;           /*!< [15..0] counter value                                                     */
            uint32            : 16;
    } bit;
  } CNT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) prescaler                                                  */
    
    struct {
      __IOM uint32 PSC        : 16;           /*!< [15..0] Prescaler value                                                   */
            uint32            : 16;
    } bit;
  } PSC;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) auto-reload register                                       */
    
    struct {
      __IOM uint32 ARR        : 16;           /*!< [15..0] Auto-reload value                                                 */
            uint32            : 16;
    } bit;
  } ARR;
  __IM  uint32  RESERVED2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) capture/compare register 1                                 */
    
    struct {
      __IOM uint32 CCR1       : 16;           /*!< [15..0] Capture/Compare 1 value                                           */
            uint32            : 16;
    } bit;
  } CCR1;
  __IM  uint32  RESERVED3[6];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000050) option register                                            */
    
    struct {
      __IOM uint32 TI1_RMP    : 2;            /*!< [1..0] TIM11 Input 1 remapping capability                                 */
            uint32            : 30;
    } bit;
  } OR;
} TIM10_Type;                                   /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                           TIM6                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Basic timers (TIM6)
  */

typedef struct {                                /*!< (@ 0x40001000) TIM6 Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register 1                                         */
    
