Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 CEN        : 1;            /*!< [0..0] Counter enable                                                     */
      __IOM uint32 UDIS       : 1;            /*!< [1..1] Update disable                                                     */
      __IOM uint32 URS        : 1;            /*!< [2..2] Update request source                                              */
      __IOM uint32 OPM        : 1;            /*!< [3..3] One-pulse mode                                                     */
            uint32            : 3;
      __IOM uint32 ARPE       : 1;            /*!< [7..7] Auto-reload preload enable                                         */
            uint32            : 24;
    } bit;
  } CR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) control register 2                                         */
    
    struct {
            uint32            : 4;
      __IOM uint32 MMS        : 3;            /*!< [6..4] Master mode selection                                              */
            uint32            : 25;
    } bit;
  } CR2;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */
    
    struct {
      __IOM uint32 UIE        : 1;            /*!< [0..0] Update interrupt enable                                            */
            uint32            : 7;
      __IOM uint32 UDE        : 1;            /*!< [8..8] Update DMA request enable                                          */
            uint32            : 23;
    } bit;
  } DIER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) status register                                            */
    
    struct {
      __IOM uint32 UIF        : 1;            /*!< [0..0] Update interrupt flag                                              */
            uint32            : 31;
    } bit;
  } SR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000014) event generation register                                  */
    
    struct {
      __OM  uint32 UG         : 1;            /*!< [0..0] Update generation                                                  */
            uint32            : 31;
    } bit;
  } EGR;
  __IM  uint32  RESERVED1[3];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) counter                                                    */
    
    struct {
      __IOM uint32 CNT        : 16;           /*!< [15..0] Low counter value                                                 */
            uint32            : 16;
    } bit;
  } CNT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) prescaler                                                  */
    
    struct {
      __IOM uint32 PSC        : 16;           /*!< [15..0] Prescaler value                                                   */
            uint32            : 16;
    } bit;
  } PSC;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) auto-reload register                                       */
    
    struct {
      __IOM uint32 ARR        : 16;           /*!< [15..0] Low Auto-reload value                                             */
            uint32            : 16;
    } bit;
  } ARR;
} TIM6_Type;                                    /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                       Ethernet_MAC                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief Ethernet: media access control       (MAC) (Ethernet_MAC)
  */

typedef struct {                                /*!< (@ 0x40028000) Ethernet_MAC Structure                                     */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Ethernet MAC configuration register                        */
    
    struct {
            uint32            : 2;
      __IOM uint32 RE         : 1;            /*!< [2..2] RE                                                                 */
      __IOM uint32 TE         : 1;            /*!< [3..3] TE                                                                 */
      __IOM uint32 DC         : 1;            /*!< [4..4] DC                                                                 */
      __IOM uint32 BL         : 2;            /*!< [6..5] BL                                                                 */
      __IOM uint32 APCS       : 1;            /*!< [7..7] APCS                                                               */
            uint32            : 1;
      __IOM uint32 RD         : 1;            /*!< [9..9] RD                                                                 */
      __IOM uint32 IPCO       : 1;            /*!< [10..10] IPCO                                                             */
      __IOM uint32 DM         : 1;            /*!< [11..11] DM                                                               */
      __IOM uint32 LM         : 1;            /*!< [12..12] LM                                                               */
      __IOM uint32 ROD        : 1;            /*!< [13..13] ROD                                                              */
      __IOM uint32 FES        : 1;            /*!< [14..14] FES                                                              */
            uint32            : 1;
      __IOM uint32 CSD        : 1;            /*!< [16..16] CSD                                                              */
      __IOM uint32 IFG        : 3;            /*!< [19..17] IFG                                                              */
            uint32            : 2;
      __IOM uint32 JD         : 1;            /*!< [22..22] JD                                                               */
      __IOM uint32 WD         : 1;            /*!< [23..23] WD                                                               */
            uint32            : 1;
      __IOM uint32 CSTF       : 1;            /*!< [25..25] CSTF                                                             */
            uint32            : 6;
    } bit;
  } MACCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Ethernet MAC frame filter register                         */
    
