Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 PM         : 1;            /*!< [0..0] PM                                                                 */
      __IOM uint32 HU         : 1;            /*!< [1..1] HU                                                                 */
      __IOM uint32 HM         : 1;            /*!< [2..2] HM                                                                 */
      __IOM uint32 DAIF       : 1;            /*!< [3..3] DAIF                                                               */
      __IOM uint32 RAM        : 1;            /*!< [4..4] RAM                                                                */
      __IOM uint32 BFD        : 1;            /*!< [5..5] BFD                                                                */
      __IOM uint32 PCF        : 1;            /*!< [6..6] PCF                                                                */
      __IOM uint32 SAIF       : 1;            /*!< [7..7] SAIF                                                               */
      __IOM uint32 SAF        : 1;            /*!< [8..8] SAF                                                                */
      __IOM uint32 HPF        : 1;            /*!< [9..9] HPF                                                                */
            uint32            : 21;
      __IOM uint32 RA         : 1;            /*!< [31..31] RA                                                               */
    } bit;
  } MACFFR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) Ethernet MAC hash table high register                      */
    
    struct {
      __IOM uint32 HTH        : 32;           /*!< [31..0] HTH                                                               */
    } bit;
  } MACHTHR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) Ethernet MAC hash table low register                       */
    
    struct {
      __IOM uint32 HTL        : 32;           /*!< [31..0] HTL                                                               */
    } bit;
  } MACHTLR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Ethernet MAC MII address register                          */
    
    struct {
      __IOM uint32 MB         : 1;            /*!< [0..0] MB                                                                 */
      __IOM uint32 MW         : 1;            /*!< [1..1] MW                                                                 */
      __IOM uint32 CR         : 3;            /*!< [4..2] CR                                                                 */
            uint32            : 1;
      __IOM uint32 MR         : 5;            /*!< [10..6] MR                                                                */
      __IOM uint32 PA         : 5;            /*!< [15..11] PA                                                               */
            uint32            : 16;
    } bit;
  } MACMIIAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) Ethernet MAC MII data register                             */
    
    struct {
      __IOM uint32 TD         : 16;           /*!< [15..0] TD                                                                */
            uint32            : 16;
    } bit;
  } MACMIIDR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) Ethernet MAC flow control register                         */
    
    struct {
      __IOM uint32 FCB        : 1;            /*!< [0..0] FCB                                                                */
      __IOM uint32 TFCE       : 1;            /*!< [1..1] TFCE                                                               */
      __IOM uint32 RFCE       : 1;            /*!< [2..2] RFCE                                                               */
      __IOM uint32 UPFD       : 1;            /*!< [3..3] UPFD                                                               */
      __IOM uint32 PLT        : 2;            /*!< [5..4] PLT                                                                */
            uint32            : 1;
      __IOM uint32 ZQPD       : 1;            /*!< [7..7] ZQPD                                                               */
            uint32            : 8;
      __IOM uint32 PT         : 16;           /*!< [31..16] PT                                                               */
    } bit;
  } MACFCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) Ethernet MAC VLAN tag register                             */
    
    struct {
      __IOM uint32 VLANTI     : 16;           /*!< [15..0] VLANTI                                                            */
      __IOM uint32 VLANTC     : 1;            /*!< [16..16] VLANTC                                                           */
            uint32            : 15;
    } bit;
  } MACVLANTR;
  __IM  uint32  RESERVED[3];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) Ethernet MAC PMT control and status register               */
    
    struct {
      __IOM uint32 PD         : 1;            /*!< [0..0] PD                                                                 */
      __IOM uint32 MPE        : 1;            /*!< [1..1] MPE                                                                */
      __IOM uint32 WFE        : 1;            /*!< [2..2] WFE                                                                */
            uint32            : 2;
      __IOM uint32 MPR        : 1;            /*!< [5..5] MPR                                                                */
      __IOM uint32 WFR        : 1;            /*!< [6..6] WFR                                                                */
            uint32            : 2;
      __IOM uint32 GU         : 1;            /*!< [9..9] GU                                                                 */
            uint32            : 21;
      __IOM uint32 WFFRPR     : 1;            /*!< [31..31] WFFRPR                                                           */
    } bit;
  } MACPMTCSR;
  __IM  uint32  RESERVED1;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000034) Ethernet MAC debug register                                */
    
