Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 CR         : 1;            /*!< [0..0] CR                                                                 */
      __IM  uint32 CSR        : 1;            /*!< [1..1] CSR                                                                */
      __IM  uint32 ROR        : 1;            /*!< [2..2] ROR                                                                */
      __IM  uint32 MCF        : 1;            /*!< [3..3] MCF                                                                */
      __IM  uint32 MCP        : 1;            /*!< [4..4] MCP                                                                */
      __IM  uint32 MCFHP      : 1;            /*!< [5..5] MCFHP                                                              */
            uint32            : 26;
    } bit;
  } MACDBGR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000038) Ethernet MAC interrupt status register                     */
    
    struct {
            uint32            : 3;
      __IM  uint32 PMTS       : 1;            /*!< [3..3] PMTS                                                               */
      __IM  uint32 MMCS       : 1;            /*!< [4..4] MMCS                                                               */
      __IM  uint32 MMCRS      : 1;            /*!< [5..5] MMCRS                                                              */
      __IM  uint32 MMCTS      : 1;            /*!< [6..6] MMCTS                                                              */
            uint32            : 2;
      __IOM uint32 TSTS       : 1;            /*!< [9..9] TSTS                                                               */
            uint32            : 22;
    } bit;
  } MACSR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000003C) Ethernet MAC interrupt mask register                       */
    
    struct {
            uint32            : 3;
      __IOM uint32 PMTIM      : 1;            /*!< [3..3] PMTIM                                                              */
            uint32            : 5;
      __IOM uint32 TSTIM      : 1;            /*!< [9..9] TSTIM                                                              */
            uint32            : 22;
    } bit;
  } MACIMR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000040) Ethernet MAC address 0 high register                       */
    
    struct {
      __IOM uint32 MACA0H     : 16;           /*!< [15..0] MAC address0 high                                                 */
            uint32            : 15;
      __IM  uint32 MO         : 1;            /*!< [31..31] Always 1                                                         */
    } bit;
  } MACA0HR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000044) Ethernet MAC address 0 low register                        */
    
    struct {
      __IOM uint32 MACA0L     : 32;           /*!< [31..0] 0                                                                 */
    } bit;
  } MACA0LR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000048) Ethernet MAC address 1 high register                       */
    
    struct {
      __IOM uint32 MACA1H     : 16;           /*!< [15..0] MACA1H                                                            */
            uint32            : 8;
      __IOM uint32 MBC        : 6;            /*!< [29..24] MBC                                                              */
      __IOM uint32 SA         : 1;            /*!< [30..30] SA                                                               */
      __IOM uint32 AE         : 1;            /*!< [31..31] AE                                                               */
    } bit;
  } MACA1HR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000004C) Ethernet MAC address1 low register                         */
    
    struct {
      __IOM uint32 MACA1LR    : 32;           /*!< [31..0] MACA1LR                                                           */
    } bit;
  } MACA1LR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000050) Ethernet MAC address 2 high register                       */
    
    struct {
      __IOM uint32 MAC2AH     : 16;           /*!< [15..0] MAC2AH                                                            */
            uint32            : 8;
      __IOM uint32 MBC        : 6;            /*!< [29..24] MBC                                                              */
      __IOM uint32 SA         : 1;            /*!< [30..30] SA                                                               */
      __IOM uint32 AE         : 1;            /*!< [31..31] AE                                                               */
    } bit;
  } MACA2HR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000054) Ethernet MAC address 2 low register                        */
    
    struct {
      __IOM uint32 MACA2L     : 31;           /*!< [30..0] MACA2L                                                            */
            uint32            : 1;
    } bit;
  } MACA2LR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000058) Ethernet MAC address 3 high register                       */
    
    struct {
      __IOM uint32 MACA3H     : 16;           /*!< [15..0] MACA3H                                                            */
            uint32            : 8;
      __IOM uint32 MBC        : 6;            /*!< [29..24] MBC                                                              */
      __IOM uint32 SA         : 1;            /*!< [30..30] SA                                                               */
      __IOM uint32 AE         : 1;            /*!< [31..31] AE                                                               */
    } bit;
  } MACA3HR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000005C) Ethernet MAC address 3 low register                        */
    
