Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 MBCA3L     : 32;           /*!< [31..0] MBCA3L                                                            */
    } bit;
  } MACA3LR;
  __IOM uint32  MACRWUFFER;                   /*!< (@ 0x00000060) Ethernet MAC remote wakeup frame filter register           */
} Ethernet_MAC_Type;                            /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                       Ethernet_MMC                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief Ethernet: MAC management counters (Ethernet_MMC)
  */

typedef struct {                                /*!< (@ 0x40028100) Ethernet_MMC Structure                                     */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Ethernet MMC control register                              */
    
    struct {
      __IOM uint32 CR         : 1;            /*!< [0..0] CR                                                                 */
      __IOM uint32 CSR        : 1;            /*!< [1..1] CSR                                                                */
      __IOM uint32 ROR        : 1;            /*!< [2..2] ROR                                                                */
      __IOM uint32 MCF        : 1;            /*!< [3..3] MCF                                                                */
      __IOM uint32 MCP        : 1;            /*!< [4..4] MCP                                                                */
      __IOM uint32 MCFHP      : 1;            /*!< [5..5] MCFHP                                                              */
            uint32            : 26;
    } bit;
  } MMCCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Ethernet MMC receive interrupt register                    */
    
    struct {
            uint32            : 5;
      __IOM uint32 RFCES      : 1;            /*!< [5..5] RFCES                                                              */
      __IOM uint32 RFAES      : 1;            /*!< [6..6] RFAES                                                              */
            uint32            : 10;
      __IOM uint32 RGUFS      : 1;            /*!< [17..17] RGUFS                                                            */
            uint32            : 14;
    } bit;
  } MMCRIR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000008) Ethernet MMC transmit interrupt register                   */
    
    struct {
            uint32            : 14;
      __IM  uint32 TGFSCS     : 1;            /*!< [14..14] TGFSCS                                                           */
      __IM  uint32 TGFMSCS    : 1;            /*!< [15..15] TGFMSCS                                                          */
            uint32            : 5;
      __IM  uint32 TGFS       : 1;            /*!< [21..21] TGFS                                                             */
            uint32            : 10;
    } bit;
  } MMCTIR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) Ethernet MMC receive interrupt mask register               */
    
    struct {
            uint32            : 5;
      __IOM uint32 RFCEM      : 1;            /*!< [5..5] RFCEM                                                              */
      __IOM uint32 RFAEM      : 1;            /*!< [6..6] RFAEM                                                              */
            uint32            : 10;
      __IOM uint32 RGUFM      : 1;            /*!< [17..17] RGUFM                                                            */
            uint32            : 14;
    } bit;
  } MMCRIMR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Ethernet MMC transmit interrupt mask register              */
    
    struct {
            uint32            : 14;
      __IOM uint32 TGFSCM     : 1;            /*!< [14..14] TGFSCM                                                           */
      __IOM uint32 TGFMSCM    : 1;            /*!< [15..15] TGFMSCM                                                          */
      __IOM uint32 TGFM       : 1;            /*!< [16..16] TGFM                                                             */
            uint32            : 15;
    } bit;
  } MMCTIMR;
  __IM  uint32  RESERVED[14];
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000004C) Ethernet MMC transmitted good frames after a
                                                                    single collision counter                                   */
    
    struct {
      __IM  uint32 TGFSCC     : 32;           /*!< [31..0] TGFSCC                                                            */
    } bit;
  } MMCTGFSCCR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000050) Ethernet MMC transmitted good frames after more
                                                                    than a single collision                                    */
    
    struct {
      __IM  uint32 TGFMSCC    : 32;           /*!< [31..0] TGFMSCC                                                           */
    } bit;
  } MMCTGFMSCCR;
  __IM  uint32  RESERVED1[5];
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000068) Ethernet MMC transmitted good frames counter
                                                                    register                                                   */
    
    struct {
      __IM  uint32 TGFC       : 32;           /*!< [31..0] HTL                                                               */
    } bit;
  } MMCTGFCR;
  __IM  uint32  RESERVED2[10];
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000094) Ethernet MMC received frames with CRC error counter
                                                                    register                                                   */
    
