Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 RFCFC      : 32;           /*!< [31..0] RFCFC                                                             */
    } bit;
  } MMCRFCECR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000098) Ethernet MMC received frames with alignment error
                                                                    counter register                                           */
    
    struct {
      __IM  uint32 RFAEC      : 32;           /*!< [31..0] RFAEC                                                             */
    } bit;
  } MMCRFAECR;
  __IM  uint32  RESERVED3[10];
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x000000C4) MMC received good unicast frames counter register          */
    
    struct {
      __IM  uint32 RGUFC      : 32;           /*!< [31..0] RGUFC                                                             */
    } bit;
  } MMCRGUFCR;
} Ethernet_MMC_Type;                            /*!< Size = 200 (0xc8)                                                         */



/* =========================================================================================================================== */
/* ================                                       Ethernet_PTP                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief Ethernet: Precision time protocol (Ethernet_PTP)
  */

typedef struct {                                /*!< (@ 0x40028700) Ethernet_PTP Structure                                     */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Ethernet PTP time stamp control register                   */
    
    struct {
      __IOM uint32 TSE        : 1;            /*!< [0..0] TSE                                                                */
      __IOM uint32 TSFCU      : 1;            /*!< [1..1] TSFCU                                                              */
      __IOM uint32 TSSTI      : 1;            /*!< [2..2] TSSTI                                                              */
      __IOM uint32 TSSTU      : 1;            /*!< [3..3] TSSTU                                                              */
      __IOM uint32 TSITE      : 1;            /*!< [4..4] TSITE                                                              */
      __IOM uint32 TTSARU     : 1;            /*!< [5..5] TTSARU                                                             */
            uint32            : 2;
      __IOM uint32 TSSARFE    : 1;            /*!< [8..8] TSSARFE                                                            */
      __IOM uint32 TSSSR      : 1;            /*!< [9..9] TSSSR                                                              */
      __IOM uint32 TSPTPPSV2E : 1;            /*!< [10..10] TSPTPPSV2E                                                       */
      __IOM uint32 TSSPTPOEFE : 1;            /*!< [11..11] TSSPTPOEFE                                                       */
      __IOM uint32 TSSIPV6FE  : 1;            /*!< [12..12] TSSIPV6FE                                                        */
      __IOM uint32 TSSIPV4FE  : 1;            /*!< [13..13] TSSIPV4FE                                                        */
      __IOM uint32 TSSEME     : 1;            /*!< [14..14] TSSEME                                                           */
      __IOM uint32 TSSMRME    : 1;            /*!< [15..15] TSSMRME                                                          */
      __IOM uint32 TSCNT      : 2;            /*!< [17..16] TSCNT                                                            */
      __IOM uint32 TSPFFMAE   : 1;            /*!< [18..18] TSPFFMAE                                                         */
            uint32            : 13;
    } bit;
  } PTPTSCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Ethernet PTP subsecond increment register                  */
    
    struct {
      __IOM uint32 STSSI      : 8;            /*!< [7..0] STSSI                                                              */
            uint32            : 24;
    } bit;
  } PTPSSIR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000008) Ethernet PTP time stamp high register                      */
    
    struct {
      __IM  uint32 STS        : 32;           /*!< [31..0] STS                                                               */
    } bit;
  } PTPTSHR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000000C) Ethernet PTP time stamp low register                       */
    
    struct {
      __IM  uint32 STSS       : 31;           /*!< [30..0] STSS                                                              */
      __IM  uint32 STPNS      : 1;            /*!< [31..31] STPNS                                                            */
    } bit;
  } PTPTSLR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Ethernet PTP time stamp high update register               */
    
    struct {
      __IOM uint32 TSUS       : 32;           /*!< [31..0] TSUS                                                              */
    } bit;
  } PTPTSHUR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) Ethernet PTP time stamp low update register                */
    
    struct {
      __IOM uint32 TSUSS      : 31;           /*!< [30..0] TSUSS                                                             */
      __IOM uint32 TSUPNS     : 1;            /*!< [31..31] TSUPNS                                                           */
    } bit;
  } PTPTSLUR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) Ethernet PTP time stamp addend register                    */
    
    struct {
      __IOM uint32 TSA        : 32;           /*!< [31..0] TSA                                                               */
    } bit;
  } PTPTSAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) Ethernet PTP target time high register                     */
    
