Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 TTSH       : 32;           /*!< [31..0] 0                                                                 */
    } bit;
  } PTPTTHR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) Ethernet PTP target time low register                      */
    
    struct {
      __IOM uint32 TTSL       : 32;           /*!< [31..0] TTSL                                                              */
    } bit;
  } PTPTTLR;
  __IM  uint32  RESERVED;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000028) Ethernet PTP time stamp status register                    */
    
    struct {
      __IM  uint32 TSSO       : 1;            /*!< [0..0] TSSO                                                               */
      __IM  uint32 TSTTR      : 1;            /*!< [1..1] TSTTR                                                              */
            uint32            : 30;
    } bit;
  } PTPTSSR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000002C) Ethernet PTP PPS control register                          */
    
    struct {
      __IM  uint32 TSSO       : 1;            /*!< [0..0] TSSO                                                               */
      __IM  uint32 TSTTR      : 1;            /*!< [1..1] TSTTR                                                              */
            uint32            : 30;
    } bit;
  } PTPPPSCR;
} Ethernet_PTP_Type;                            /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                       Ethernet_DMA                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief Ethernet: DMA controller operation (Ethernet_DMA)
  */

typedef struct {                                /*!< (@ 0x40029000) Ethernet_DMA Structure                                     */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Ethernet DMA bus mode register                             */
    
    struct {
      __IOM uint32 SR         : 1;            /*!< [0..0] SR                                                                 */
      __IOM uint32 DA         : 1;            /*!< [1..1] DA                                                                 */
      __IOM uint32 DSL        : 5;            /*!< [6..2] DSL                                                                */
      __IOM uint32 EDFE       : 1;            /*!< [7..7] EDFE                                                               */
      __IOM uint32 PBL        : 6;            /*!< [13..8] PBL                                                               */
      __IOM uint32 RTPR       : 2;            /*!< [15..14] RTPR                                                             */
      __IOM uint32 FB         : 1;            /*!< [16..16] FB                                                               */
      __IOM uint32 RDP        : 6;            /*!< [22..17] RDP                                                              */
      __IOM uint32 USP        : 1;            /*!< [23..23] USP                                                              */
      __IOM uint32 FPM        : 1;            /*!< [24..24] FPM                                                              */
      __IOM uint32 AAB        : 1;            /*!< [25..25] AAB                                                              */
      __IOM uint32 MB         : 1;            /*!< [26..26] MB                                                               */
            uint32            : 5;
    } bit;
  } DMABMR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Ethernet DMA transmit poll demand register                 */
    
    struct {
      __IOM uint32 TPD        : 32;           /*!< [31..0] TPD                                                               */
    } bit;
  } DMATPDR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) EHERNET DMA receive poll demand register                   */
    
    struct {
      __IOM uint32 RPD        : 32;           /*!< [31..0] RPD                                                               */
    } bit;
  } DMARPDR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) Ethernet DMA receive descriptor list address
                                                                    register                                                   */
    
    struct {
      __IOM uint32 SRL        : 32;           /*!< [31..0] SRL                                                               */
    } bit;
  } DMARDLAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Ethernet DMA transmit descriptor list address
                                                                    register                                                   */
    
    struct {
      __IOM uint32 STL        : 32;           /*!< [31..0] STL                                                               */
    } bit;
  } DMATDLAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) Ethernet DMA status register                               */
    
    struct {
      __IOM uint32 TS         : 1;            /*!< [0..0] TS                                                                 */
      __IOM uint32 TPSS       : 1;            /*!< [1..1] TPSS                                                               */
      __IOM uint32 TBUS       : 1;            /*!< [2..2] TBUS                                                               */
      __IOM uint32 TJTS       : 1;            /*!< [3..3] TJTS                                                               */
      __IOM uint32 ROS        : 1;            /*!< [4..4] ROS                                                                */
      __IOM uint32 TUS        : 1;            /*!< [5..5] TUS                                                                */
      __IOM uint32 RS         : 1;            /*!< [6..6] RS                                                                 */
      __IOM uint32 RBUS       : 1;            /*!< [7..7] RBUS                                                               */
      __IOM uint32 RPSS       : 1;            /*!< [8..8] RPSS                                                               */
      __IOM uint32 PWTS       : 1;            /*!< [9..9] PWTS                                                               */
      __IOM uint32 ETS        : 1;            /*!< [10..10] ETS                                                              */
            uint32            : 2;
      __IOM uint32 FBES       : 1;            /*!< [13..13] FBES                                                             */
      __IOM uint32 ERS        : 1;            /*!< [14..14] ERS                                                              */
      __IOM uint32 AIS        : 1;            /*!< [15..15] AIS                                                              */
      __IOM uint32 NIS        : 1;            /*!< [16..16] NIS                                                              */
      __IM  uint32 RPS        : 3;            /*!< [19..17] RPS                                                              */
      __IM  uint32 TPS        : 3;            /*!< [22..20] TPS                                                              */
      __IM  uint32 EBS        : 3;            /*!< [25..23] EBS                                                              */
            uint32            : 1;
      __IM  uint32 MMCS       : 1;            /*!< [27..27] MMCS                                                             */
      __IM  uint32 PMTS       : 1;            /*!< [28..28] PMTS                                                             */
      __IM  uint32 TSTS       : 1;            /*!< [29..29] TSTS                                                             */
            uint32            : 2;
    } bit;
  } DMASR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) Ethernet DMA operation mode register                       */
    
