Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
            uint32            : 1;
      __IOM uint32 SR         : 1;            /*!< [1..1] SR                                                                 */
      __IOM uint32 OSF        : 1;            /*!< [2..2] OSF                                                                */
      __IOM uint32 RTC        : 2;            /*!< [4..3] RTC                                                                */
            uint32            : 1;
      __IOM uint32 FUGF       : 1;            /*!< [6..6] FUGF                                                               */
      __IOM uint32 FEF        : 1;            /*!< [7..7] FEF                                                                */
            uint32            : 5;
      __IOM uint32 ST         : 1;            /*!< [13..13] ST                                                               */
      __IOM uint32 TTC        : 3;            /*!< [16..14] TTC                                                              */
            uint32            : 3;
      __IOM uint32 FTF        : 1;            /*!< [20..20] FTF                                                              */
      __IOM uint32 TSF        : 1;            /*!< [21..21] TSF                                                              */
            uint32            : 2;
      __IOM uint32 DFRF       : 1;            /*!< [24..24] DFRF                                                             */
      __IOM uint32 RSF        : 1;            /*!< [25..25] RSF                                                              */
      __IOM uint32 DTCEFD     : 1;            /*!< [26..26] DTCEFD                                                           */
            uint32            : 5;
    } bit;
  } DMAOMR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) Ethernet DMA interrupt enable register                     */
    
    struct {
      __IOM uint32 TIE        : 1;            /*!< [0..0] TIE                                                                */
      __IOM uint32 TPSIE      : 1;            /*!< [1..1] TPSIE                                                              */
      __IOM uint32 TBUIE      : 1;            /*!< [2..2] TBUIE                                                              */
      __IOM uint32 TJTIE      : 1;            /*!< [3..3] TJTIE                                                              */
      __IOM uint32 ROIE       : 1;            /*!< [4..4] ROIE                                                               */
      __IOM uint32 TUIE       : 1;            /*!< [5..5] TUIE                                                               */
      __IOM uint32 RIE        : 1;            /*!< [6..6] RIE                                                                */
      __IOM uint32 RBUIE      : 1;            /*!< [7..7] RBUIE                                                              */
      __IOM uint32 RPSIE      : 1;            /*!< [8..8] RPSIE                                                              */
      __IOM uint32 RWTIE      : 1;            /*!< [9..9] RWTIE                                                              */
      __IOM uint32 ETIE       : 1;            /*!< [10..10] ETIE                                                             */
            uint32            : 2;
      __IOM uint32 FBEIE      : 1;            /*!< [13..13] FBEIE                                                            */
      __IOM uint32 ERIE       : 1;            /*!< [14..14] ERIE                                                             */
      __IOM uint32 AISE       : 1;            /*!< [15..15] AISE                                                             */
      __IOM uint32 NISE       : 1;            /*!< [16..16] NISE                                                             */
            uint32            : 15;
    } bit;
  } DMAIER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) Ethernet DMA missed frame and buffer overflow
                                                                    counter register                                           */
    
    struct {
      __IOM uint32 MFC        : 16;           /*!< [15..0] MFC                                                               */
      __IOM uint32 OMFC       : 1;            /*!< [16..16] OMFC                                                             */
      __IOM uint32 MFA        : 11;           /*!< [27..17] MFA                                                              */
      __IOM uint32 OFOC       : 1;            /*!< [28..28] OFOC                                                             */
            uint32            : 3;
    } bit;
  } DMAMFBOCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) Ethernet DMA receive status watchdog timer register        */
    
    struct {
      __IOM uint32 RSWTC      : 8;            /*!< [7..0] RSWTC                                                              */
            uint32            : 24;
    } bit;
  } DMARSWTR;
  __IM  uint32  RESERVED[8];
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000048) Ethernet DMA current host transmit descriptor
                                                                    register                                                   */
    
    struct {
      __IM  uint32 HTDAP      : 32;           /*!< [31..0] HTDAP                                                             */
    } bit;
  } DMACHTDR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000004C) Ethernet DMA current host receive descriptor
                                                                    register                                                   */
    
    struct {
      __IM  uint32 HRDAP      : 32;           /*!< [31..0] HRDAP                                                             */
    } bit;
  } DMACHRDR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000050) Ethernet DMA current host transmit buffer address
                                                                    register                                                   */
    
