Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 HTBAP      : 32;           /*!< [31..0] HTBAP                                                             */
    } bit;
  } DMACHTBAR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000054) Ethernet DMA current host receive buffer address
                                                                    register                                                   */
    
    struct {
      __IM  uint32 HRBAP      : 32;           /*!< [31..0] HRBAP                                                             */
    } bit;
  } DMACHRBAR;
} Ethernet_DMA_Type;                            /*!< Size = 88 (0x58)                                                          */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Cryptographic processor (CRC)
  */

typedef struct {                                /*!< (@ 0x40023000) CRC Structure                                              */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Data register                                              */
    
    struct {
      __IOM uint32 DR         : 32;           /*!< [31..0] Data Register                                                     */
    } bit;
  } DR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Independent Data register                                  */
    
    struct {
      __IOM uint32 IDR        : 8;            /*!< [7..0] Independent Data register                                          */
            uint32            : 24;
    } bit;
  } IDR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000008) Control register                                           */
    
    struct {
      __OM  uint32 CR         : 1;            /*!< [0..0] Control regidter                                                   */
            uint32            : 31;
    } bit;
  } CR;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Initial CRC value                                          */
    
    struct {
      __IOM uint32 CRC_INIT   : 32;           /*!< [31..0] Programmable initial CRC value                                    */
    } bit;
  } INIT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) CRC polynomial                                             */
    
    struct {
      __IOM uint32 POL        : 32;           /*!< [31..0] Programmable polynomial                                           */
    } bit;
  } POL;
} CRC_Type;                                     /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                           CAN1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Controller area network (CAN1)
  */

typedef struct {                                /*!< (@ 0x40006400) CAN1 Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) master control register                                    */
    
    struct {
      __IOM uint32 INRQ       : 1;            /*!< [0..0] INRQ                                                               */
      __IOM uint32 SLEEP      : 1;            /*!< [1..1] SLEEP                                                              */
      __IOM uint32 TXFP       : 1;            /*!< [2..2] TXFP                                                               */
      __IOM uint32 RFLM       : 1;            /*!< [3..3] RFLM                                                               */
      __IOM uint32 NART       : 1;            /*!< [4..4] NART                                                               */
      __IOM uint32 AWUM       : 1;            /*!< [5..5] AWUM                                                               */
      __IOM uint32 ABOM       : 1;            /*!< [6..6] ABOM                                                               */
      __IOM uint32 TTCM       : 1;            /*!< [7..7] TTCM                                                               */
            uint32            : 7;
      __IOM uint32 RESET      : 1;            /*!< [15..15] RESET                                                            */
      __IOM uint32 DBF        : 1;            /*!< [16..16] DBF                                                              */
            uint32            : 15;
    } bit;
  } MCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) master status register                                     */
    
    struct {
      __IM  uint32 INAK       : 1;            /*!< [0..0] INAK                                                               */
      __IM  uint32 SLAK       : 1;            /*!< [1..1] SLAK                                                               */
      __IOM uint32 ERRI       : 1;            /*!< [2..2] ERRI                                                               */
      __IOM uint32 WKUI       : 1;            /*!< [3..3] WKUI                                                               */
      __IOM uint32 SLAKI      : 1;            /*!< [4..4] SLAKI                                                              */
            uint32            : 3;
      __IM  uint32 TXM        : 1;            /*!< [8..8] TXM                                                                */
      __IM  uint32 RXM        : 1;            /*!< [9..9] RXM                                                                */
      __IM  uint32 SAMP       : 1;            /*!< [10..10] SAMP                                                             */
      __IM  uint32 RX         : 1;            /*!< [11..11] RX                                                               */
            uint32            : 20;
    } bit;
  } MSR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) transmit status register                                   */
    
