Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 RQCP0      : 1;            /*!< [0..0] RQCP0                                                              */
      __IOM uint32 TXOK0      : 1;            /*!< [1..1] TXOK0                                                              */
      __IOM uint32 ALST0      : 1;            /*!< [2..2] ALST0                                                              */
      __IOM uint32 TERR0      : 1;            /*!< [3..3] TERR0                                                              */
            uint32            : 3;
      __IOM uint32 ABRQ0      : 1;            /*!< [7..7] ABRQ0                                                              */
      __IOM uint32 RQCP1      : 1;            /*!< [8..8] RQCP1                                                              */
      __IOM uint32 TXOK1      : 1;            /*!< [9..9] TXOK1                                                              */
      __IOM uint32 ALST1      : 1;            /*!< [10..10] ALST1                                                            */
      __IOM uint32 TERR1      : 1;            /*!< [11..11] TERR1                                                            */
            uint32            : 3;
      __IOM uint32 ABRQ1      : 1;            /*!< [15..15] ABRQ1                                                            */
      __IOM uint32 RQCP2      : 1;            /*!< [16..16] RQCP2                                                            */
      __IOM uint32 TXOK2      : 1;            /*!< [17..17] TXOK2                                                            */
      __IOM uint32 ALST2      : 1;            /*!< [18..18] ALST2                                                            */
      __IOM uint32 TERR2      : 1;            /*!< [19..19] TERR2                                                            */
            uint32            : 3;
      __IOM uint32 ABRQ2      : 1;            /*!< [23..23] ABRQ2                                                            */
      __IM  uint32 CODE       : 2;            /*!< [25..24] CODE                                                             */
      __IM  uint32 TME0       : 1;            /*!< [26..26] Lowest priority flag for mailbox 0                               */
      __IM  uint32 TME1       : 1;            /*!< [27..27] Lowest priority flag for mailbox 1                               */
      __IM  uint32 TME2       : 1;            /*!< [28..28] Lowest priority flag for mailbox 2                               */
      __IM  uint32 LOW0       : 1;            /*!< [29..29] Lowest priority flag for mailbox 0                               */
      __IM  uint32 LOW1       : 1;            /*!< [30..30] Lowest priority flag for mailbox 1                               */
      __IM  uint32 LOW2       : 1;            /*!< [31..31] Lowest priority flag for mailbox 2                               */
    } bit;
  } TSR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) receive FIFO 0 register                                    */
    
    struct {
      __IM  uint32 FMP0       : 2;            /*!< [1..0] FMP0                                                               */
            uint32            : 1;
      __IOM uint32 FULL0      : 1;            /*!< [3..3] FULL0                                                              */
      __IOM uint32 FOVR0      : 1;            /*!< [4..4] FOVR0                                                              */
      __IOM uint32 RFOM0      : 1;            /*!< [5..5] RFOM0                                                              */
            uint32            : 26;
    } bit;
  } RF0R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) receive FIFO 1 register                                    */
    
    struct {
      __IM  uint32 FMP1       : 2;            /*!< [1..0] FMP1                                                               */
            uint32            : 1;
      __IOM uint32 FULL1      : 1;            /*!< [3..3] FULL1                                                              */
      __IOM uint32 FOVR1      : 1;            /*!< [4..4] FOVR1                                                              */
      __IOM uint32 RFOM1      : 1;            /*!< [5..5] RFOM1                                                              */
            uint32            : 26;
    } bit;
  } RF1R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) interrupt enable register                                  */
    
    struct {
      __IOM uint32 TMEIE      : 1;            /*!< [0..0] TMEIE                                                              */
      __IOM uint32 FMPIE0     : 1;            /*!< [1..1] FMPIE0                                                             */
      __IOM uint32 FFIE0      : 1;            /*!< [2..2] FFIE0                                                              */
      __IOM uint32 FOVIE0     : 1;            /*!< [3..3] FOVIE0                                                             */
      __IOM uint32 FMPIE1     : 1;            /*!< [4..4] FMPIE1                                                             */
      __IOM uint32 FFIE1      : 1;            /*!< [5..5] FFIE1                                                              */
      __IOM uint32 FOVIE1     : 1;            /*!< [6..6] FOVIE1                                                             */
            uint32            : 1;
      __IOM uint32 EWGIE      : 1;            /*!< [8..8] EWGIE                                                              */
      __IOM uint32 EPVIE      : 1;            /*!< [9..9] EPVIE                                                              */
      __IOM uint32 BOFIE      : 1;            /*!< [10..10] BOFIE                                                            */
      __IOM uint32 LECIE      : 1;            /*!< [11..11] LECIE                                                            */
            uint32            : 3;
      __IOM uint32 ERRIE      : 1;            /*!< [15..15] ERRIE                                                            */
      __IOM uint32 WKUIE      : 1;            /*!< [16..16] WKUIE                                                            */
      __IOM uint32 SLKIE      : 1;            /*!< [17..17] SLKIE                                                            */
            uint32            : 14;
    } bit;
  } IER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) interrupt enable register                                  */
    
