Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 EWGF       : 1;            /*!< [0..0] EWGF                                                               */
      __IM  uint32 EPVF       : 1;            /*!< [1..1] EPVF                                                               */
      __IM  uint32 BOFF       : 1;            /*!< [2..2] BOFF                                                               */
            uint32            : 1;
      __IOM uint32 LEC        : 3;            /*!< [6..4] LEC                                                                */
            uint32            : 9;
      __IM  uint32 TEC        : 8;            /*!< [23..16] TEC                                                              */
      __IM  uint32 REC        : 8;            /*!< [31..24] REC                                                              */
    } bit;
  } ESR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) bit timing register                                        */
    
    struct {
      __IOM uint32 BRP        : 10;           /*!< [9..0] BRP                                                                */
            uint32            : 6;
      __IOM uint32 TS1        : 4;            /*!< [19..16] TS1                                                              */
      __IOM uint32 TS2        : 3;            /*!< [22..20] TS2                                                              */
            uint32            : 1;
      __IOM uint32 SJW        : 2;            /*!< [25..24] SJW                                                              */
            uint32            : 4;
      __IOM uint32 LBKM       : 1;            /*!< [30..30] LBKM                                                             */
      __IOM uint32 SILM       : 1;            /*!< [31..31] SILM                                                             */
    } bit;
  } BTR;
  __IM  uint32  RESERVED[88];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000180) TX mailbox identifier register                             */
    
    struct {
      __IOM uint32 TXRQ       : 1;            /*!< [0..0] TXRQ                                                               */
      __IOM uint32 RTR        : 1;            /*!< [1..1] RTR                                                                */
      __IOM uint32 IDE        : 1;            /*!< [2..2] IDE                                                                */
      __IOM uint32 EXID       : 18;           /*!< [20..3] EXID                                                              */
      __IOM uint32 STID       : 11;           /*!< [31..21] STID                                                             */
    } bit;
  } TI0R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000184) mailbox data length control and time stamp register        */
    
    struct {
      __IOM uint32 DLC        : 4;            /*!< [3..0] DLC                                                                */
            uint32            : 4;
      __IOM uint32 TGT        : 1;            /*!< [8..8] TGT                                                                */
            uint32            : 7;
      __IOM uint32 TIME       : 16;           /*!< [31..16] TIME                                                             */
    } bit;
  } TDT0R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000188) mailbox data low register                                  */
    
    struct {
      __IOM uint32 DATA0      : 8;            /*!< [7..0] DATA0                                                              */
      __IOM uint32 DATA1      : 8;            /*!< [15..8] DATA1                                                             */
      __IOM uint32 DATA2      : 8;            /*!< [23..16] DATA2                                                            */
      __IOM uint32 DATA3      : 8;            /*!< [31..24] DATA3                                                            */
    } bit;
  } TDL0R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000018C) mailbox data high register                                 */
    
    struct {
      __IOM uint32 DATA4      : 8;            /*!< [7..0] DATA4                                                              */
      __IOM uint32 DATA5      : 8;            /*!< [15..8] DATA5                                                             */
      __IOM uint32 DATA6      : 8;            /*!< [23..16] DATA6                                                            */
      __IOM uint32 DATA7      : 8;            /*!< [31..24] DATA7                                                            */
    } bit;
  } TDH0R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000190) mailbox identifier register                                */
    
    struct {
      __IOM uint32 TXRQ       : 1;            /*!< [0..0] TXRQ                                                               */
      __IOM uint32 RTR        : 1;            /*!< [1..1] RTR                                                                */
      __IOM uint32 IDE        : 1;            /*!< [2..2] IDE                                                                */
      __IOM uint32 EXID       : 18;           /*!< [20..3] EXID                                                              */
      __IOM uint32 STID       : 11;           /*!< [31..21] STID                                                             */
    } bit;
  } TI1R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000194) mailbox data length control and time stamp register        */
    
    struct {
      __IOM uint32 DLC        : 4;            /*!< [3..0] DLC                                                                */
            uint32            : 4;
      __IOM uint32 TGT        : 1;            /*!< [8..8] TGT                                                                */
            uint32            : 7;
      __IOM uint32 TIME       : 16;           /*!< [31..16] TIME                                                             */
    } bit;
  } TDT1R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000198) mailbox data low register                                  */
    
