Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 DATA0      : 8;            /*!< [7..0] DATA0                                                              */
      __IOM uint32 DATA1      : 8;            /*!< [15..8] DATA1                                                             */
      __IOM uint32 DATA2      : 8;            /*!< [23..16] DATA2                                                            */
      __IOM uint32 DATA3      : 8;            /*!< [31..24] DATA3                                                            */
    } bit;
  } TDL1R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000019C) mailbox data high register                                 */
    
    struct {
      __IOM uint32 DATA4      : 8;            /*!< [7..0] DATA4                                                              */
      __IOM uint32 DATA5      : 8;            /*!< [15..8] DATA5                                                             */
      __IOM uint32 DATA6      : 8;            /*!< [23..16] DATA6                                                            */
      __IOM uint32 DATA7      : 8;            /*!< [31..24] DATA7                                                            */
    } bit;
  } TDH1R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001A0) mailbox identifier register                                */
    
    struct {
      __IOM uint32 TXRQ       : 1;            /*!< [0..0] TXRQ                                                               */
      __IOM uint32 RTR        : 1;            /*!< [1..1] RTR                                                                */
      __IOM uint32 IDE        : 1;            /*!< [2..2] IDE                                                                */
      __IOM uint32 EXID       : 18;           /*!< [20..3] EXID                                                              */
      __IOM uint32 STID       : 11;           /*!< [31..21] STID                                                             */
    } bit;
  } TI2R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001A4) mailbox data length control and time stamp register        */
    
    struct {
      __IOM uint32 DLC        : 4;            /*!< [3..0] DLC                                                                */
            uint32            : 4;
      __IOM uint32 TGT        : 1;            /*!< [8..8] TGT                                                                */
            uint32            : 7;
      __IOM uint32 TIME       : 16;           /*!< [31..16] TIME                                                             */
    } bit;
  } TDT2R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001A8) mailbox data low register                                  */
    
    struct {
      __IOM uint32 DATA0      : 8;            /*!< [7..0] DATA0                                                              */
      __IOM uint32 DATA1      : 8;            /*!< [15..8] DATA1                                                             */
      __IOM uint32 DATA2      : 8;            /*!< [23..16] DATA2                                                            */
      __IOM uint32 DATA3      : 8;            /*!< [31..24] DATA3                                                            */
    } bit;
  } TDL2R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001AC) mailbox data high register                                 */
    
    struct {
      __IOM uint32 DATA4      : 8;            /*!< [7..0] DATA4                                                              */
      __IOM uint32 DATA5      : 8;            /*!< [15..8] DATA5                                                             */
      __IOM uint32 DATA6      : 8;            /*!< [23..16] DATA6                                                            */
      __IOM uint32 DATA7      : 8;            /*!< [31..24] DATA7                                                            */
    } bit;
  } TDH2R;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x000001B0) receive FIFO mailbox identifier register                   */
    
    struct {
            uint32            : 1;
      __IM  uint32 RTR        : 1;            /*!< [1..1] RTR                                                                */
      __IM  uint32 IDE        : 1;            /*!< [2..2] IDE                                                                */
      __IM  uint32 EXID       : 18;           /*!< [20..3] EXID                                                              */
      __IM  uint32 STID       : 11;           /*!< [31..21] STID                                                             */
    } bit;
  } RI0R;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x000001B4) mailbox data high register                                 */
    
    struct {
      __IM  uint32 DLC        : 4;            /*!< [3..0] DLC                                                                */
            uint32            : 4;
      __IM  uint32 FMI        : 8;            /*!< [15..8] FMI                                                               */
      __IM  uint32 TIME       : 16;           /*!< [31..16] TIME                                                             */
    } bit;
  } RDT0R;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x000001B8) mailbox data high register                                 */
    
    struct {
      __IM  uint32 DATA0      : 8;            /*!< [7..0] DATA0                                                              */
      __IM  uint32 DATA1      : 8;            /*!< [15..8] DATA1                                                             */
      __IM  uint32 DATA2      : 8;            /*!< [23..16] DATA2                                                            */
      __IM  uint32 DATA3      : 8;            /*!< [31..24] DATA3                                                            */
    } bit;
  } RDL0R;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x000001BC) receive FIFO mailbox data high register                    */
    
