Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 DATA4      : 8;            /*!< [7..0] DATA4                                                              */
      __IM  uint32 DATA5      : 8;            /*!< [15..8] DATA5                                                             */
      __IM  uint32 DATA6      : 8;            /*!< [23..16] DATA6                                                            */
      __IM  uint32 DATA7      : 8;            /*!< [31..24] DATA7                                                            */
    } bit;
  } RDH0R;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x000001C0) mailbox data high register                                 */
    
    struct {
            uint32            : 1;
      __IM  uint32 RTR        : 1;            /*!< [1..1] RTR                                                                */
      __IM  uint32 IDE        : 1;            /*!< [2..2] IDE                                                                */
      __IM  uint32 EXID       : 18;           /*!< [20..3] EXID                                                              */
      __IM  uint32 STID       : 11;           /*!< [31..21] STID                                                             */
    } bit;
  } RI1R;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x000001C4) mailbox data high register                                 */
    
    struct {
      __IM  uint32 DLC        : 4;            /*!< [3..0] DLC                                                                */
            uint32            : 4;
      __IM  uint32 FMI        : 8;            /*!< [15..8] FMI                                                               */
      __IM  uint32 TIME       : 16;           /*!< [31..16] TIME                                                             */
    } bit;
  } RDT1R;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x000001C8) mailbox data high register                                 */
    
    struct {
      __IM  uint32 DATA0      : 8;            /*!< [7..0] DATA0                                                              */
      __IM  uint32 DATA1      : 8;            /*!< [15..8] DATA1                                                             */
      __IM  uint32 DATA2      : 8;            /*!< [23..16] DATA2                                                            */
      __IM  uint32 DATA3      : 8;            /*!< [31..24] DATA3                                                            */
    } bit;
  } RDL1R;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x000001CC) mailbox data high register                                 */
    
    struct {
      __IM  uint32 DATA4      : 8;            /*!< [7..0] DATA4                                                              */
      __IM  uint32 DATA5      : 8;            /*!< [15..8] DATA5                                                             */
      __IM  uint32 DATA6      : 8;            /*!< [23..16] DATA6                                                            */
      __IM  uint32 DATA7      : 8;            /*!< [31..24] DATA7                                                            */
    } bit;
  } RDH1R;
  __IM  uint32  RESERVED1[12];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000200) filter master register                                     */
    
    struct {
      __IOM uint32 FINIT      : 1;            /*!< [0..0] FINIT                                                              */
            uint32            : 7;
      __IOM uint32 CAN2SB     : 6;            /*!< [13..8] CAN2SB                                                            */
            uint32            : 18;
    } bit;
  } FMR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000204) filter mode register                                       */
    
    struct {
      __IOM uint32 FBM0       : 1;            /*!< [0..0] Filter mode                                                        */
      __IOM uint32 FBM1       : 1;            /*!< [1..1] Filter mode                                                        */
      __IOM uint32 FBM2       : 1;            /*!< [2..2] Filter mode                                                        */
      __IOM uint32 FBM3       : 1;            /*!< [3..3] Filter mode                                                        */
      __IOM uint32 FBM4       : 1;            /*!< [4..4] Filter mode                                                        */
      __IOM uint32 FBM5       : 1;            /*!< [5..5] Filter mode                                                        */
      __IOM uint32 FBM6       : 1;            /*!< [6..6] Filter mode                                                        */
      __IOM uint32 FBM7       : 1;            /*!< [7..7] Filter mode                                                        */
      __IOM uint32 FBM8       : 1;            /*!< [8..8] Filter mode                                                        */
      __IOM uint32 FBM9       : 1;            /*!< [9..9] Filter mode                                                        */
      __IOM uint32 FBM10      : 1;            /*!< [10..10] Filter mode                                                      */
      __IOM uint32 FBM11      : 1;            /*!< [11..11] Filter mode                                                      */
      __IOM uint32 FBM12      : 1;            /*!< [12..12] Filter mode                                                      */
      __IOM uint32 FBM13      : 1;            /*!< [13..13] Filter mode                                                      */
      __IOM uint32 FBM14      : 1;            /*!< [14..14] Filter mode                                                      */
      __IOM uint32 FBM15      : 1;            /*!< [15..15] Filter mode                                                      */
      __IOM uint32 FBM16      : 1;            /*!< [16..16] Filter mode                                                      */
      __IOM uint32 FBM17      : 1;            /*!< [17..17] Filter mode                                                      */
      __IOM uint32 FBM18      : 1;            /*!< [18..18] Filter mode                                                      */
      __IOM uint32 FBM19      : 1;            /*!< [19..19] Filter mode                                                      */
      __IOM uint32 FBM20      : 1;            /*!< [20..20] Filter mode                                                      */
      __IOM uint32 FBM21      : 1;            /*!< [21..21] Filter mode                                                      */
      __IOM uint32 FBM22      : 1;            /*!< [22..22] Filter mode                                                      */
      __IOM uint32 FBM23      : 1;            /*!< [23..23] Filter mode                                                      */
      __IOM uint32 FBM24      : 1;            /*!< [24..24] Filter mode                                                      */
      __IOM uint32 FBM25      : 1;            /*!< [25..25] Filter mode                                                      */
      __IOM uint32 FBM26      : 1;            /*!< [26..26] Filter mode                                                      */
      __IOM uint32 FBM27      : 1;            /*!< [27..27] Filter mode                                                      */
            uint32            : 4;
    } bit;
  } FM1R;
  __IM  uint32  RESERVED2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000020C) filter scale register                                      */
    
