Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 FSC0       : 1;            /*!< [0..0] Filter scale configuration                                         */
      __IOM uint32 FSC1       : 1;            /*!< [1..1] Filter scale configuration                                         */
      __IOM uint32 FSC2       : 1;            /*!< [2..2] Filter scale configuration                                         */
      __IOM uint32 FSC3       : 1;            /*!< [3..3] Filter scale configuration                                         */
      __IOM uint32 FSC4       : 1;            /*!< [4..4] Filter scale configuration                                         */
      __IOM uint32 FSC5       : 1;            /*!< [5..5] Filter scale configuration                                         */
      __IOM uint32 FSC6       : 1;            /*!< [6..6] Filter scale configuration                                         */
      __IOM uint32 FSC7       : 1;            /*!< [7..7] Filter scale configuration                                         */
      __IOM uint32 FSC8       : 1;            /*!< [8..8] Filter scale configuration                                         */
      __IOM uint32 FSC9       : 1;            /*!< [9..9] Filter scale configuration                                         */
      __IOM uint32 FSC10      : 1;            /*!< [10..10] Filter scale configuration                                       */
      __IOM uint32 FSC11      : 1;            /*!< [11..11] Filter scale configuration                                       */
      __IOM uint32 FSC12      : 1;            /*!< [12..12] Filter scale configuration                                       */
      __IOM uint32 FSC13      : 1;            /*!< [13..13] Filter scale configuration                                       */
      __IOM uint32 FSC14      : 1;            /*!< [14..14] Filter scale configuration                                       */
      __IOM uint32 FSC15      : 1;            /*!< [15..15] Filter scale configuration                                       */
      __IOM uint32 FSC16      : 1;            /*!< [16..16] Filter scale configuration                                       */
      __IOM uint32 FSC17      : 1;            /*!< [17..17] Filter scale configuration                                       */
      __IOM uint32 FSC18      : 1;            /*!< [18..18] Filter scale configuration                                       */
      __IOM uint32 FSC19      : 1;            /*!< [19..19] Filter scale configuration                                       */
      __IOM uint32 FSC20      : 1;            /*!< [20..20] Filter scale configuration                                       */
      __IOM uint32 FSC21      : 1;            /*!< [21..21] Filter scale configuration                                       */
      __IOM uint32 FSC22      : 1;            /*!< [22..22] Filter scale configuration                                       */
      __IOM uint32 FSC23      : 1;            /*!< [23..23] Filter scale configuration                                       */
      __IOM uint32 FSC24      : 1;            /*!< [24..24] Filter scale configuration                                       */
      __IOM uint32 FSC25      : 1;            /*!< [25..25] Filter scale configuration                                       */
      __IOM uint32 FSC26      : 1;            /*!< [26..26] Filter scale configuration                                       */
      __IOM uint32 FSC27      : 1;            /*!< [27..27] Filter scale configuration                                       */
            uint32            : 4;
    } bit;
  } FS1R;
  __IM  uint32  RESERVED3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000214) filter FIFO assignment register                            */
    
    struct {
      __IOM uint32 FFA0       : 1;            /*!< [0..0] Filter FIFO assignment for filter 0                                */
      __IOM uint32 FFA1       : 1;            /*!< [1..1] Filter FIFO assignment for filter 1                                */
      __IOM uint32 FFA2       : 1;            /*!< [2..2] Filter FIFO assignment for filter 2                                */
      __IOM uint32 FFA3       : 1;            /*!< [3..3] Filter FIFO assignment for filter 3                                */
      __IOM uint32 FFA4       : 1;            /*!< [4..4] Filter FIFO assignment for filter 4                                */
      __IOM uint32 FFA5       : 1;            /*!< [5..5] Filter FIFO assignment for filter 5                                */
      __IOM uint32 FFA6       : 1;            /*!< [6..6] Filter FIFO assignment for filter 6                                */
      __IOM uint32 FFA7       : 1;            /*!< [7..7] Filter FIFO assignment for filter 7                                */
      __IOM uint32 FFA8       : 1;            /*!< [8..8] Filter FIFO assignment for filter 8                                */
      __IOM uint32 FFA9       : 1;            /*!< [9..9] Filter FIFO assignment for filter 9                                */
      __IOM uint32 FFA10      : 1;            /*!< [10..10] Filter FIFO assignment for filter 10                             */
      __IOM uint32 FFA11      : 1;            /*!< [11..11] Filter FIFO assignment for filter 11                             */
      __IOM uint32 FFA12      : 1;            /*!< [12..12] Filter FIFO assignment for filter 12                             */
      __IOM uint32 FFA13      : 1;            /*!< [13..13] Filter FIFO assignment for filter 13                             */
      __IOM uint32 FFA14      : 1;            /*!< [14..14] Filter FIFO assignment for filter 14                             */
      __IOM uint32 FFA15      : 1;            /*!< [15..15] Filter FIFO assignment for filter 15                             */
      __IOM uint32 FFA16      : 1;            /*!< [16..16] Filter FIFO assignment for filter 16                             */
      __IOM uint32 FFA17      : 1;            /*!< [17..17] Filter FIFO assignment for filter 17                             */
      __IOM uint32 FFA18      : 1;            /*!< [18..18] Filter FIFO assignment for filter 18                             */
      __IOM uint32 FFA19      : 1;            /*!< [19..19] Filter FIFO assignment for filter 19                             */
      __IOM uint32 FFA20      : 1;            /*!< [20..20] Filter FIFO assignment for filter 20                             */
      __IOM uint32 FFA21      : 1;            /*!< [21..21] Filter FIFO assignment for filter 21                             */
      __IOM uint32 FFA22      : 1;            /*!< [22..22] Filter FIFO assignment for filter 22                             */
      __IOM uint32 FFA23      : 1;            /*!< [23..23] Filter FIFO assignment for filter 23                             */
      __IOM uint32 FFA24      : 1;            /*!< [24..24] Filter FIFO assignment for filter 24                             */
      __IOM uint32 FFA25      : 1;            /*!< [25..25] Filter FIFO assignment for filter 25                             */
      __IOM uint32 FFA26      : 1;            /*!< [26..26] Filter FIFO assignment for filter 26                             */
      __IOM uint32 FFA27      : 1;            /*!< [27..27] Filter FIFO assignment for filter 27                             */
            uint32            : 4;
    } bit;
  } FFA1R;
  __IM  uint32  RESERVED4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000021C) filter activation register                                 */
    
