Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 FACT0      : 1;            /*!< [0..0] Filter active                                                      */
      __IOM uint32 FACT1      : 1;            /*!< [1..1] Filter active                                                      */
      __IOM uint32 FACT2      : 1;            /*!< [2..2] Filter active                                                      */
      __IOM uint32 FACT3      : 1;            /*!< [3..3] Filter active                                                      */
      __IOM uint32 FACT4      : 1;            /*!< [4..4] Filter active                                                      */
      __IOM uint32 FACT5      : 1;            /*!< [5..5] Filter active                                                      */
      __IOM uint32 FACT6      : 1;            /*!< [6..6] Filter active                                                      */
      __IOM uint32 FACT7      : 1;            /*!< [7..7] Filter active                                                      */
      __IOM uint32 FACT8      : 1;            /*!< [8..8] Filter active                                                      */
      __IOM uint32 FACT9      : 1;            /*!< [9..9] Filter active                                                      */
      __IOM uint32 FACT10     : 1;            /*!< [10..10] Filter active                                                    */
      __IOM uint32 FACT11     : 1;            /*!< [11..11] Filter active                                                    */
      __IOM uint32 FACT12     : 1;            /*!< [12..12] Filter active                                                    */
      __IOM uint32 FACT13     : 1;            /*!< [13..13] Filter active                                                    */
      __IOM uint32 FACT14     : 1;            /*!< [14..14] Filter active                                                    */
      __IOM uint32 FACT15     : 1;            /*!< [15..15] Filter active                                                    */
      __IOM uint32 FACT16     : 1;            /*!< [16..16] Filter active                                                    */
      __IOM uint32 FACT17     : 1;            /*!< [17..17] Filter active                                                    */
      __IOM uint32 FACT18     : 1;            /*!< [18..18] Filter active                                                    */
      __IOM uint32 FACT19     : 1;            /*!< [19..19] Filter active                                                    */
      __IOM uint32 FACT20     : 1;            /*!< [20..20] Filter active                                                    */
      __IOM uint32 FACT21     : 1;            /*!< [21..21] Filter active                                                    */
      __IOM uint32 FACT22     : 1;            /*!< [22..22] Filter active                                                    */
      __IOM uint32 FACT23     : 1;            /*!< [23..23] Filter active                                                    */
      __IOM uint32 FACT24     : 1;            /*!< [24..24] Filter active                                                    */
      __IOM uint32 FACT25     : 1;            /*!< [25..25] Filter active                                                    */
      __IOM uint32 FACT26     : 1;            /*!< [26..26] Filter active                                                    */
      __IOM uint32 FACT27     : 1;            /*!< [27..27] Filter active                                                    */
            uint32            : 4;
    } bit;
  } FA1R;
  __IM  uint32  RESERVED5[8];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000240) Filter bank 0 register 1                                   */
    
    struct {
      __IOM uint32 FB0        : 1;            /*!< [0..0] Filter bits                                                        */
      __IOM uint32 FB1        : 1;            /*!< [1..1] Filter bits                                                        */
      __IOM uint32 FB2        : 1;            /*!< [2..2] Filter bits                                                        */
      __IOM uint32 FB3        : 1;            /*!< [3..3] Filter bits                                                        */
      __IOM uint32 FB4        : 1;            /*!< [4..4] Filter bits                                                        */
      __IOM uint32 FB5        : 1;            /*!< [5..5] Filter bits                                                        */
      __IOM uint32 FB6        : 1;            /*!< [6..6] Filter bits                                                        */
      __IOM uint32 FB7        : 1;            /*!< [7..7] Filter bits                                                        */
      __IOM uint32 FB8        : 1;            /*!< [8..8] Filter bits                                                        */
      __IOM uint32 FB9        : 1;            /*!< [9..9] Filter bits                                                        */
      __IOM uint32 FB10       : 1;            /*!< [10..10] Filter bits                                                      */
      __IOM uint32 FB11       : 1;            /*!< [11..11] Filter bits                                                      */
      __IOM uint32 FB12       : 1;            /*!< [12..12] Filter bits                                                      */
      __IOM uint32 FB13       : 1;            /*!< [13..13] Filter bits                                                      */
      __IOM uint32 FB14       : 1;            /*!< [14..14] Filter bits                                                      */
      __IOM uint32 FB15       : 1;            /*!< [15..15] Filter bits                                                      */
      __IOM uint32 FB16       : 1;            /*!< [16..16] Filter bits                                                      */
      __IOM uint32 FB17       : 1;            /*!< [17..17] Filter bits                                                      */
      __IOM uint32 FB18       : 1;            /*!< [18..18] Filter bits                                                      */
      __IOM uint32 FB19       : 1;            /*!< [19..19] Filter bits                                                      */
      __IOM uint32 FB20       : 1;            /*!< [20..20] Filter bits                                                      */
      __IOM uint32 FB21       : 1;            /*!< [21..21] Filter bits                                                      */
      __IOM uint32 FB22       : 1;            /*!< [22..22] Filter bits                                                      */
      __IOM uint32 FB23       : 1;            /*!< [23..23] Filter bits                                                      */
      __IOM uint32 FB24       : 1;            /*!< [24..24] Filter bits                                                      */
      __IOM uint32 FB25       : 1;            /*!< [25..25] Filter bits                                                      */
      __IOM uint32 FB26       : 1;            /*!< [26..26] Filter bits                                                      */
      __IOM uint32 FB27       : 1;            /*!< [27..27] Filter bits                                                      */
      __IOM uint32 FB28       : 1;            /*!< [28..28] Filter bits                                                      */
      __IOM uint32 FB29       : 1;            /*!< [29..29] Filter bits                                                      */
      __IOM uint32 FB30       : 1;            /*!< [30..30] Filter bits                                                      */
      __IOM uint32 FB31       : 1;            /*!< [31..31] Filter bits                                                      */
    } bit;
  } F0R1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000244) Filter bank 0 register 2                                   */
    
