Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 FB0        : 1;            /*!< [0..0] Filter bits                                                        */
      __IOM uint32 FB1        : 1;            /*!< [1..1] Filter bits                                                        */
      __IOM uint32 FB2        : 1;            /*!< [2..2] Filter bits                                                        */
      __IOM uint32 FB3        : 1;            /*!< [3..3] Filter bits                                                        */
      __IOM uint32 FB4        : 1;            /*!< [4..4] Filter bits                                                        */
      __IOM uint32 FB5        : 1;            /*!< [5..5] Filter bits                                                        */
      __IOM uint32 FB6        : 1;            /*!< [6..6] Filter bits                                                        */
      __IOM uint32 FB7        : 1;            /*!< [7..7] Filter bits                                                        */
      __IOM uint32 FB8        : 1;            /*!< [8..8] Filter bits                                                        */
      __IOM uint32 FB9        : 1;            /*!< [9..9] Filter bits                                                        */
      __IOM uint32 FB10       : 1;            /*!< [10..10] Filter bits                                                      */
      __IOM uint32 FB11       : 1;            /*!< [11..11] Filter bits                                                      */
      __IOM uint32 FB12       : 1;            /*!< [12..12] Filter bits                                                      */
      __IOM uint32 FB13       : 1;            /*!< [13..13] Filter bits                                                      */
      __IOM uint32 FB14       : 1;            /*!< [14..14] Filter bits                                                      */
      __IOM uint32 FB15       : 1;            /*!< [15..15] Filter bits                                                      */
      __IOM uint32 FB16       : 1;            /*!< [16..16] Filter bits                                                      */
      __IOM uint32 FB17       : 1;            /*!< [17..17] Filter bits                                                      */
      __IOM uint32 FB18       : 1;            /*!< [18..18] Filter bits                                                      */
      __IOM uint32 FB19       : 1;            /*!< [19..19] Filter bits                                                      */
      __IOM uint32 FB20       : 1;            /*!< [20..20] Filter bits                                                      */
      __IOM uint32 FB21       : 1;            /*!< [21..21] Filter bits                                                      */
      __IOM uint32 FB22       : 1;            /*!< [22..22] Filter bits                                                      */
      __IOM uint32 FB23       : 1;            /*!< [23..23] Filter bits                                                      */
      __IOM uint32 FB24       : 1;            /*!< [24..24] Filter bits                                                      */
      __IOM uint32 FB25       : 1;            /*!< [25..25] Filter bits                                                      */
      __IOM uint32 FB26       : 1;            /*!< [26..26] Filter bits                                                      */
      __IOM uint32 FB27       : 1;            /*!< [27..27] Filter bits                                                      */
      __IOM uint32 FB28       : 1;            /*!< [28..28] Filter bits                                                      */
      __IOM uint32 FB29       : 1;            /*!< [29..29] Filter bits                                                      */
      __IOM uint32 FB30       : 1;            /*!< [30..30] Filter bits                                                      */
      __IOM uint32 FB31       : 1;            /*!< [31..31] Filter bits                                                      */
    } bit;
  } F27R2;
} CAN1_Type;                                    /*!< Size = 800 (0x320)                                                        */



/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief FLASH (FLASH)
  */

typedef struct {                                /*!< (@ 0x40023C00) FLASH Structure                                            */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Flash access control register                              */
    
    struct {
      __IOM uint32 LATENCY    : 4;            /*!< [3..0] Latency                                                            */
            uint32            : 4;
      __IOM uint32 PRFTEN     : 1;            /*!< [8..8] Prefetch enable                                                    */
      __IOM uint32 ARTEN      : 1;            /*!< [9..9] ART Accelerator Enable                                             */
            uint32            : 1;
      __IOM uint32 ARTRST     : 1;            /*!< [11..11] ART Accelerator reset                                            */
            uint32            : 20;
    } bit;
  } ACR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000004) Flash key register                                         */
    
    struct {
      __OM  uint32 KEY        : 32;           /*!< [31..0] FPEC key                                                          */
    } bit;
  } KEYR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000008) Flash option key register                                  */
    
