Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __OM  uint32 OPTKEY     : 32;           /*!< [31..0] Option byte key                                                   */
    } bit;
  } OPTKEYR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) Status register                                            */
    
    struct {
      __IOM uint32 EOP        : 1;            /*!< [0..0] End of operation                                                   */
      __IOM uint32 OPERR      : 1;            /*!< [1..1] Operation error                                                    */
            uint32            : 2;
      __IOM uint32 WRPERR     : 1;            /*!< [4..4] Write protection error                                             */
      __IOM uint32 PGAERR     : 1;            /*!< [5..5] Programming alignment error                                        */
      __IOM uint32 PGPERR     : 1;            /*!< [6..6] Programming parallelism error                                      */
      __IOM uint32 ERSERR     : 1;            /*!< [7..7] Programming sequence error                                         */
            uint32            : 8;
      __IM  uint32 BSY        : 1;            /*!< [16..16] Busy                                                             */
            uint32            : 15;
    } bit;
  } SR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Control register                                           */
    
    struct {
      __IOM uint32 PG         : 1;            /*!< [0..0] Programming                                                        */
      __IOM uint32 SER        : 1;            /*!< [1..1] Sector Erase                                                       */
      __IOM uint32 MER        : 1;            /*!< [2..2] Mass Erase of sectors 0 to 11                                      */
      __IOM uint32 SNB        : 4;            /*!< [6..3] Sector number                                                      */
            uint32            : 1;
      __IOM uint32 PSIZE      : 2;            /*!< [9..8] Program size                                                       */
            uint32            : 6;
      __IOM uint32 STRT       : 1;            /*!< [16..16] Start                                                            */
            uint32            : 7;
      __IOM uint32 EOPIE      : 1;            /*!< [24..24] End of operation interrupt enable                                */
      __IOM uint32 ERRIE      : 1;            /*!< [25..25] Error interrupt enable                                           */
            uint32            : 5;
      __IOM uint32 LOCK       : 1;            /*!< [31..31] Lock                                                             */
    } bit;
  } CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) Flash option control register                              */
    
    struct {
      __IOM uint32 OPTLOCK    : 1;            /*!< [0..0] Option lock                                                        */
      __IOM uint32 OPTSTRT    : 1;            /*!< [1..1] Option start                                                       */
      __IOM uint32 BOR_LEV    : 2;            /*!< [3..2] BOR reset Level                                                    */
      __IOM uint32 WWDG_SW    : 1;            /*!< [4..4] User option bytes                                                  */
      __IOM uint32 IWDG_SW    : 1;            /*!< [5..5] User option bytes                                                  */
      __IOM uint32 nRST_STOP  : 1;            /*!< [6..6] User option bytes                                                  */
      __IOM uint32 nRST_STDBY : 1;            /*!< [7..7] User option bytes                                                  */
      __IOM uint32 RDP        : 8;            /*!< [15..8] Read protect                                                      */
      __IOM uint32 nWRP       : 8;            /*!< [23..16] Not write protect                                                */
            uint32            : 6;
      __IOM uint32 IWDG_STDBY : 1;            /*!< [30..30] Independent watchdog counter freeze in standby mode              */
      __IOM uint32 IWDG_STOP  : 1;            /*!< [31..31] Independent watchdog counter freeze in Stop mode                 */
    } bit;
  } OPTCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) Flash option control register 1                            */
    
    struct {
      __IOM uint32 BOOT_ADD0  : 16;           /*!< [15..0] Boot base address when Boot pin =0                                */
      __IOM uint32 BOOT_ADD1  : 16;           /*!< [31..16] Boot base address when Boot pin =1                               */
    } bit;
  } OPTCR1;
} FLASH_Type;                                   /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                           EXTI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief External interrupt/event       controller (EXTI)
  */

typedef struct {                                /*!< (@ 0x40013C00) EXTI Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Interrupt mask register (EXTI_IMR)                         */
    
    struct {
      __IOM uint32 MR0        : 1;            /*!< [0..0] Interrupt Mask on line 0                                           */
      __IOM uint32 MR1        : 1;            /*!< [1..1] Interrupt Mask on line 1                                           */
      __IOM uint32 MR2        : 1;            /*!< [2..2] Interrupt Mask on line 2                                           */
      __IOM uint32 MR3        : 1;            /*!< [3..3] Interrupt Mask on line 3                                           */
      __IOM uint32 MR4        : 1;            /*!< [4..4] Interrupt Mask on line 4                                           */
      __IOM uint32 MR5        : 1;            /*!< [5..5] Interrupt Mask on line 5                                           */
      __IOM uint32 MR6        : 1;            /*!< [6..6] Interrupt Mask on line 6                                           */
      __IOM uint32 MR7        : 1;            /*!< [7..7] Interrupt Mask on line 7                                           */
      __IOM uint32 MR8        : 1;            /*!< [8..8] Interrupt Mask on line 8                                           */
      __IOM uint32 MR9        : 1;            /*!< [9..9] Interrupt Mask on line 9                                           */
      __IOM uint32 MR10       : 1;            /*!< [10..10] Interrupt Mask on line 10                                        */
      __IOM uint32 MR11       : 1;            /*!< [11..11] Interrupt Mask on line 11                                        */
      __IOM uint32 MR12       : 1;            /*!< [12..12] Interrupt Mask on line 12                                        */
      __IOM uint32 MR13       : 1;            /*!< [13..13] Interrupt Mask on line 13                                        */
      __IOM uint32 MR14       : 1;            /*!< [14..14] Interrupt Mask on line 14                                        */
      __IOM uint32 MR15       : 1;            /*!< [15..15] Interrupt Mask on line 15                                        */
      __IOM uint32 MR16       : 1;            /*!< [16..16] Interrupt Mask on line 16                                        */
      __IOM uint32 MR17       : 1;            /*!< [17..17] Interrupt Mask on line 17                                        */
      __IOM uint32 MR18       : 1;            /*!< [18..18] Interrupt Mask on line 18                                        */
      __IOM uint32 MR19       : 1;            /*!< [19..19] Interrupt Mask on line 19                                        */
      __IOM uint32 MR20       : 1;            /*!< [20..20] Interrupt Mask on line 20                                        */
      __IOM uint32 MR21       : 1;            /*!< [21..21] Interrupt Mask on line 21                                        */
      __IOM uint32 MR22       : 1;            /*!< [22..22] Interrupt Mask on line 22                                        */
            uint32            : 9;
    } bit;
  } IMR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Event mask register (EXTI_EMR)                             */
    
