Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 MR0        : 1;            /*!< [0..0] Event Mask on line 0                                               */
      __IOM uint32 MR1        : 1;            /*!< [1..1] Event Mask on line 1                                               */
      __IOM uint32 MR2        : 1;            /*!< [2..2] Event Mask on line 2                                               */
      __IOM uint32 MR3        : 1;            /*!< [3..3] Event Mask on line 3                                               */
      __IOM uint32 MR4        : 1;            /*!< [4..4] Event Mask on line 4                                               */
      __IOM uint32 MR5        : 1;            /*!< [5..5] Event Mask on line 5                                               */
      __IOM uint32 MR6        : 1;            /*!< [6..6] Event Mask on line 6                                               */
      __IOM uint32 MR7        : 1;            /*!< [7..7] Event Mask on line 7                                               */
      __IOM uint32 MR8        : 1;            /*!< [8..8] Event Mask on line 8                                               */
      __IOM uint32 MR9        : 1;            /*!< [9..9] Event Mask on line 9                                               */
      __IOM uint32 MR10       : 1;            /*!< [10..10] Event Mask on line 10                                            */
      __IOM uint32 MR11       : 1;            /*!< [11..11] Event Mask on line 11                                            */
      __IOM uint32 MR12       : 1;            /*!< [12..12] Event Mask on line 12                                            */
      __IOM uint32 MR13       : 1;            /*!< [13..13] Event Mask on line 13                                            */
      __IOM uint32 MR14       : 1;            /*!< [14..14] Event Mask on line 14                                            */
      __IOM uint32 MR15       : 1;            /*!< [15..15] Event Mask on line 15                                            */
      __IOM uint32 MR16       : 1;            /*!< [16..16] Event Mask on line 16                                            */
      __IOM uint32 MR17       : 1;            /*!< [17..17] Event Mask on line 17                                            */
      __IOM uint32 MR18       : 1;            /*!< [18..18] Event Mask on line 18                                            */
      __IOM uint32 MR19       : 1;            /*!< [19..19] Event Mask on line 19                                            */
      __IOM uint32 MR20       : 1;            /*!< [20..20] Event Mask on line 20                                            */
      __IOM uint32 MR21       : 1;            /*!< [21..21] Event Mask on line 21                                            */
      __IOM uint32 MR22       : 1;            /*!< [22..22] Event Mask on line 22                                            */
            uint32            : 9;
    } bit;
  } EMR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) Rising Trigger selection register (EXTI_RTSR)              */
    
    struct {
      __IOM uint32 TR0        : 1;            /*!< [0..0] Rising trigger event configuration of line 0                       */
      __IOM uint32 TR1        : 1;            /*!< [1..1] Rising trigger event configuration of line 1                       */
      __IOM uint32 TR2        : 1;            /*!< [2..2] Rising trigger event configuration of line 2                       */
      __IOM uint32 TR3        : 1;            /*!< [3..3] Rising trigger event configuration of line 3                       */
      __IOM uint32 TR4        : 1;            /*!< [4..4] Rising trigger event configuration of line 4                       */
      __IOM uint32 TR5        : 1;            /*!< [5..5] Rising trigger event configuration of line 5                       */
      __IOM uint32 TR6        : 1;            /*!< [6..6] Rising trigger event configuration of line 6                       */
      __IOM uint32 TR7        : 1;            /*!< [7..7] Rising trigger event configuration of line 7                       */
      __IOM uint32 TR8        : 1;            /*!< [8..8] Rising trigger event configuration of line 8                       */
      __IOM uint32 TR9        : 1;            /*!< [9..9] Rising trigger event configuration of line 9                       */
      __IOM uint32 TR10       : 1;            /*!< [10..10] Rising trigger event configuration of line 10                    */
      __IOM uint32 TR11       : 1;            /*!< [11..11] Rising trigger event configuration of line 11                    */
      __IOM uint32 TR12       : 1;            /*!< [12..12] Rising trigger event configuration of line 12                    */
      __IOM uint32 TR13       : 1;            /*!< [13..13] Rising trigger event configuration of line 13                    */
      __IOM uint32 TR14       : 1;            /*!< [14..14] Rising trigger event configuration of line 14                    */
      __IOM uint32 TR15       : 1;            /*!< [15..15] Rising trigger event configuration of line 15                    */
      __IOM uint32 TR16       : 1;            /*!< [16..16] Rising trigger event configuration of line 16                    */
      __IOM uint32 TR17       : 1;            /*!< [17..17] Rising trigger event configuration of line 17                    */
      __IOM uint32 TR18       : 1;            /*!< [18..18] Rising trigger event configuration of line 18                    */
      __IOM uint32 TR19       : 1;            /*!< [19..19] Rising trigger event configuration of line 19                    */
      __IOM uint32 TR20       : 1;            /*!< [20..20] Rising trigger event configuration of line 20                    */
      __IOM uint32 TR21       : 1;            /*!< [21..21] Rising trigger event configuration of line 21                    */
      __IOM uint32 TR22       : 1;            /*!< [22..22] Rising trigger event configuration of line 22                    */
            uint32            : 9;
    } bit;
  } RTSR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) Falling Trigger selection register (EXTI_FTSR)             */
    
