Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 TR0        : 1;            /*!< [0..0] Falling trigger event configuration of line 0                      */
      __IOM uint32 TR1        : 1;            /*!< [1..1] Falling trigger event configuration of line 1                      */
      __IOM uint32 TR2        : 1;            /*!< [2..2] Falling trigger event configuration of line 2                      */
      __IOM uint32 TR3        : 1;            /*!< [3..3] Falling trigger event configuration of line 3                      */
      __IOM uint32 TR4        : 1;            /*!< [4..4] Falling trigger event configuration of line 4                      */
      __IOM uint32 TR5        : 1;            /*!< [5..5] Falling trigger event configuration of line 5                      */
      __IOM uint32 TR6        : 1;            /*!< [6..6] Falling trigger event configuration of line 6                      */
      __IOM uint32 TR7        : 1;            /*!< [7..7] Falling trigger event configuration of line 7                      */
      __IOM uint32 TR8        : 1;            /*!< [8..8] Falling trigger event configuration of line 8                      */
      __IOM uint32 TR9        : 1;            /*!< [9..9] Falling trigger event configuration of line 9                      */
      __IOM uint32 TR10       : 1;            /*!< [10..10] Falling trigger event configuration of line 10                   */
      __IOM uint32 TR11       : 1;            /*!< [11..11] Falling trigger event configuration of line 11                   */
      __IOM uint32 TR12       : 1;            /*!< [12..12] Falling trigger event configuration of line 12                   */
      __IOM uint32 TR13       : 1;            /*!< [13..13] Falling trigger event configuration of line 13                   */
      __IOM uint32 TR14       : 1;            /*!< [14..14] Falling trigger event configuration of line 14                   */
      __IOM uint32 TR15       : 1;            /*!< [15..15] Falling trigger event configuration of line 15                   */
      __IOM uint32 TR16       : 1;            /*!< [16..16] Falling trigger event configuration of line 16                   */
      __IOM uint32 TR17       : 1;            /*!< [17..17] Falling trigger event configuration of line 17                   */
      __IOM uint32 TR18       : 1;            /*!< [18..18] Falling trigger event configuration of line 18                   */
      __IOM uint32 TR19       : 1;            /*!< [19..19] Falling trigger event configuration of line 19                   */
      __IOM uint32 TR20       : 1;            /*!< [20..20] Falling trigger event configuration of line 20                   */
      __IOM uint32 TR21       : 1;            /*!< [21..21] Falling trigger event configuration of line 21                   */
      __IOM uint32 TR22       : 1;            /*!< [22..22] Falling trigger event configuration of line 22                   */
            uint32            : 9;
    } bit;
  } FTSR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Software interrupt event register (EXTI_SWIER)             */
    
    struct {
      __IOM uint32 SWIER0     : 1;            /*!< [0..0] Software Interrupt on line 0                                       */
      __IOM uint32 SWIER1     : 1;            /*!< [1..1] Software Interrupt on line 1                                       */
      __IOM uint32 SWIER2     : 1;            /*!< [2..2] Software Interrupt on line 2                                       */
      __IOM uint32 SWIER3     : 1;            /*!< [3..3] Software Interrupt on line 3                                       */
      __IOM uint32 SWIER4     : 1;            /*!< [4..4] Software Interrupt on line 4                                       */
      __IOM uint32 SWIER5     : 1;            /*!< [5..5] Software Interrupt on line 5                                       */
      __IOM uint32 SWIER6     : 1;            /*!< [6..6] Software Interrupt on line 6                                       */
      __IOM uint32 SWIER7     : 1;            /*!< [7..7] Software Interrupt on line 7                                       */
      __IOM uint32 SWIER8     : 1;            /*!< [8..8] Software Interrupt on line 8                                       */
      __IOM uint32 SWIER9     : 1;            /*!< [9..9] Software Interrupt on line 9                                       */
      __IOM uint32 SWIER10    : 1;            /*!< [10..10] Software Interrupt on line 10                                    */
      __IOM uint32 SWIER11    : 1;            /*!< [11..11] Software Interrupt on line 11                                    */
      __IOM uint32 SWIER12    : 1;            /*!< [12..12] Software Interrupt on line 12                                    */
      __IOM uint32 SWIER13    : 1;            /*!< [13..13] Software Interrupt on line 13                                    */
      __IOM uint32 SWIER14    : 1;            /*!< [14..14] Software Interrupt on line 14                                    */
      __IOM uint32 SWIER15    : 1;            /*!< [15..15] Software Interrupt on line 15                                    */
      __IOM uint32 SWIER16    : 1;            /*!< [16..16] Software Interrupt on line 16                                    */
      __IOM uint32 SWIER17    : 1;            /*!< [17..17] Software Interrupt on line 17                                    */
      __IOM uint32 SWIER18    : 1;            /*!< [18..18] Software Interrupt on line 18                                    */
      __IOM uint32 SWIER19    : 1;            /*!< [19..19] Software Interrupt on line 19                                    */
      __IOM uint32 SWIER20    : 1;            /*!< [20..20] Software Interrupt on line 20                                    */
      __IOM uint32 SWIER21    : 1;            /*!< [21..21] Software Interrupt on line 21                                    */
      __IOM uint32 SWIER22    : 1;            /*!< [22..22] Software Interrupt on line 22                                    */
            uint32            : 9;
    } bit;
  } SWIER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) Pending register (EXTI_PR)                                 */
    
