Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 PR0        : 1;            /*!< [0..0] Pending bit 0                                                      */
      __IOM uint32 PR1        : 1;            /*!< [1..1] Pending bit 1                                                      */
      __IOM uint32 PR2        : 1;            /*!< [2..2] Pending bit 2                                                      */
      __IOM uint32 PR3        : 1;            /*!< [3..3] Pending bit 3                                                      */
      __IOM uint32 PR4        : 1;            /*!< [4..4] Pending bit 4                                                      */
      __IOM uint32 PR5        : 1;            /*!< [5..5] Pending bit 5                                                      */
      __IOM uint32 PR6        : 1;            /*!< [6..6] Pending bit 6                                                      */
      __IOM uint32 PR7        : 1;            /*!< [7..7] Pending bit 7                                                      */
      __IOM uint32 PR8        : 1;            /*!< [8..8] Pending bit 8                                                      */
      __IOM uint32 PR9        : 1;            /*!< [9..9] Pending bit 9                                                      */
      __IOM uint32 PR10       : 1;            /*!< [10..10] Pending bit 10                                                   */
      __IOM uint32 PR11       : 1;            /*!< [11..11] Pending bit 11                                                   */
      __IOM uint32 PR12       : 1;            /*!< [12..12] Pending bit 12                                                   */
      __IOM uint32 PR13       : 1;            /*!< [13..13] Pending bit 13                                                   */
      __IOM uint32 PR14       : 1;            /*!< [14..14] Pending bit 14                                                   */
      __IOM uint32 PR15       : 1;            /*!< [15..15] Pending bit 15                                                   */
      __IOM uint32 PR16       : 1;            /*!< [16..16] Pending bit 16                                                   */
      __IOM uint32 PR17       : 1;            /*!< [17..17] Pending bit 17                                                   */
      __IOM uint32 PR18       : 1;            /*!< [18..18] Pending bit 18                                                   */
      __IOM uint32 PR19       : 1;            /*!< [19..19] Pending bit 19                                                   */
      __IOM uint32 PR20       : 1;            /*!< [20..20] Pending bit 20                                                   */
      __IOM uint32 PR21       : 1;            /*!< [21..21] Pending bit 21                                                   */
      __IOM uint32 PR22       : 1;            /*!< [22..22] Pending bit 22                                                   */
            uint32            : 9;
    } bit;
  } PR;
} EXTI_Type;                                    /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                           LTDC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief LCD-TFT Controller (LTDC)
  */

typedef struct {                                /*!< (@ 0x40016800) LTDC Structure                                             */
  __IM  uint32  RESERVED[2];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) Synchronization Size Configuration Register                */
    
    struct {
      __IOM uint32 VSH        : 11;           /*!< [10..0] Vertical Synchronization Height (in units of horizontal
                                                     scan line)                                                                */
            uint32            : 5;
      __IOM uint32 HSW        : 10;           /*!< [25..16] Horizontal Synchronization Width (in units of pixel
                                                     clock period)                                                             */
            uint32            : 6;
    } bit;
  } SSCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) Back Porch Configuration Register                          */
    
    struct {
      __IOM uint32 AVBP       : 11;           /*!< [10..0] Accumulated Vertical back porch (in units of horizontal
                                                     scan line)                                                                */
            uint32            : 5;
      __IOM uint32 AHBP       : 10;           /*!< [25..16] Accumulated Horizontal back porch (in units of pixel
                                                     clock period)                                                             */
            uint32            : 6;
    } bit;
  } BPCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Active Width Configuration Register                        */
    
    struct {
      __IOM uint32 AAH        : 11;           /*!< [10..0] Accumulated Active Height (in units of horizontal scan
                                                     line)                                                                     */
            uint32            : 5;
      __IOM uint32 AAV        : 10;           /*!< [25..16] AAV                                                              */
            uint32            : 6;
    } bit;
  } AWCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) Total Width Configuration Register                         */
    
    struct {
      __IOM uint32 TOTALH     : 11;           /*!< [10..0] Total Height (in units of horizontal scan line)                   */
            uint32            : 5;
      __IOM uint32 TOTALW     : 10;           /*!< [25..16] Total Width (in units of pixel clock period)                     */
            uint32            : 6;
    } bit;
  } TWCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) Global Control Register                                    */
    
