Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 LTDCEN     : 1;            /*!< [0..0] LCD-TFT controller enable bit                                      */
            uint32            : 3;
      __IM  uint32 DBW        : 3;            /*!< [6..4] Dither Blue Width                                                  */
            uint32            : 1;
      __IM  uint32 DGW        : 3;            /*!< [10..8] Dither Green Width                                                */
            uint32            : 1;
      __IM  uint32 DRW        : 3;            /*!< [14..12] Dither Red Width                                                 */
            uint32            : 1;
      __IOM uint32 DEN        : 1;            /*!< [16..16] Dither Enable                                                    */
            uint32            : 11;
      __IOM uint32 PCPOL      : 1;            /*!< [28..28] Pixel Clock Polarity                                             */
      __IOM uint32 DEPOL      : 1;            /*!< [29..29] Data Enable Polarity                                             */
      __IOM uint32 VSPOL      : 1;            /*!< [30..30] Vertical Synchronization Polarity                                */
      __IOM uint32 HSPOL      : 1;            /*!< [31..31] Horizontal Synchronization Polarity                              */
    } bit;
  } GCR;
  __IM  uint32  RESERVED1[2];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) Shadow Reload Configuration Register                       */
    
    struct {
      __IOM uint32 IMR        : 1;            /*!< [0..0] Immediate Reload                                                   */
      __IOM uint32 VBR        : 1;            /*!< [1..1] Vertical Blanking Reload                                           */
            uint32            : 30;
    } bit;
  } SRCR;
  __IM  uint32  RESERVED2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) Background Color Configuration Register                    */
    
    struct {
      __IOM uint32 BC         : 24;           /*!< [23..0] Background Color Red value                                        */
            uint32            : 8;
    } bit;
  } BCCR;
  __IM  uint32  RESERVED3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) Interrupt Enable Register                                  */
    
    struct {
      __IOM uint32 LIE        : 1;            /*!< [0..0] Line Interrupt Enable                                              */
      __IOM uint32 FUIE       : 1;            /*!< [1..1] FIFO Underrun Interrupt Enable                                     */
      __IOM uint32 TERRIE     : 1;            /*!< [2..2] Transfer Error Interrupt Enable                                    */
      __IOM uint32 RRIE       : 1;            /*!< [3..3] Register Reload interrupt enable                                   */
            uint32            : 28;
    } bit;
  } IER;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000038) Interrupt Status Register                                  */
    
    struct {
      __IM  uint32 LIF        : 1;            /*!< [0..0] Line Interrupt flag                                                */
      __IM  uint32 FUIF       : 1;            /*!< [1..1] FIFO Underrun Interrupt flag                                       */
      __IM  uint32 TERRIF     : 1;            /*!< [2..2] Transfer Error interrupt flag                                      */
      __IM  uint32 RRIF       : 1;            /*!< [3..3] Register Reload Interrupt Flag                                     */
            uint32            : 28;
    } bit;
  } ISR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x0000003C) Interrupt Clear Register                                   */
    
    struct {
      __OM  uint32 CLIF       : 1;            /*!< [0..0] Clears the Line Interrupt Flag                                     */
      __OM  uint32 CFUIF      : 1;            /*!< [1..1] Clears the FIFO Underrun Interrupt flag                            */
      __OM  uint32 CTERRIF    : 1;            /*!< [2..2] Clears the Transfer Error Interrupt Flag                           */
      __OM  uint32 CRRIF      : 1;            /*!< [3..3] Clears Register Reload Interrupt Flag                              */
            uint32            : 28;
    } bit;
  } ICR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000040) Line Interrupt Position Configuration Register             */
    
    struct {
      __IOM uint32 LIPOS      : 11;           /*!< [10..0] Line Interrupt Position                                           */
            uint32            : 21;
    } bit;
  } LIPCR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000044) Current Position Status Register                           */
    
    struct {
      __IM  uint32 CYPOS      : 16;           /*!< [15..0] Current Y Position                                                */
      __IM  uint32 CXPOS      : 16;           /*!< [31..16] Current X Position                                               */
    } bit;
  } CPSR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000048) Current Display Status Register                            */
    
    struct {
      __IM  uint32 VDES       : 1;            /*!< [0..0] Vertical Data Enable display Status                                */
      __IM  uint32 HDES       : 1;            /*!< [1..1] Horizontal Data Enable display Status                              */
      __IM  uint32 VSYNCS     : 1;            /*!< [2..2] Vertical Synchronization display Status                            */
      __IM  uint32 HSYNCS     : 1;            /*!< [3..3] Horizontal Synchronization display Status                          */
            uint32            : 28;
    } bit;
  } CDSR;
  __IM  uint32  RESERVED4[14];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000084) Layerx Control Register                                    */
    
