Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 LEN        : 1;            /*!< [0..0] Layer Enable                                                       */
      __IOM uint32 COLKEN     : 1;            /*!< [1..1] Color Keying Enable                                                */
            uint32            : 2;
      __IOM uint32 CLUTEN     : 1;            /*!< [4..4] Color Look-Up Table Enable                                         */
            uint32            : 27;
    } bit;
  } L1CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000088) Layerx Window Horizontal Position Configuration
                                                                    Register                                                   */
    
    struct {
      __IOM uint32 WHSTPOS    : 12;           /*!< [11..0] Window Horizontal Start Position                                  */
            uint32            : 4;
      __IOM uint32 WHSPPOS    : 12;           /*!< [27..16] Window Horizontal Stop Position                                  */
            uint32            : 4;
    } bit;
  } L1WHPCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000008C) Layerx Window Vertical Position Configuration
                                                                    Register                                                   */
    
    struct {
      __IOM uint32 WVSTPOS    : 11;           /*!< [10..0] Window Vertical Start Position                                    */
            uint32            : 5;
      __IOM uint32 WVSPPOS    : 11;           /*!< [26..16] Window Vertical Stop Position                                    */
            uint32            : 5;
    } bit;
  } L1WVPCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000090) Layerx Color Keying Configuration Register                 */
    
    struct {
      __IOM uint32 CKBLUE     : 8;            /*!< [7..0] Color Key Blue value                                               */
      __IOM uint32 CKGREEN    : 8;            /*!< [15..8] Color Key Green value                                             */
      __IOM uint32 CKRED      : 8;            /*!< [23..16] Color Key Red value                                              */
            uint32            : 8;
    } bit;
  } L1CKCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000094) Layerx Pixel Format Configuration Register                 */
    
    struct {
      __IOM uint32 PF         : 3;            /*!< [2..0] Pixel Format                                                       */
            uint32            : 29;
    } bit;
  } L1PFCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000098) Layerx Constant Alpha Configuration Register               */
    
    struct {
      __IOM uint32 CONSTA     : 8;            /*!< [7..0] Constant Alpha                                                     */
            uint32            : 24;
    } bit;
  } L1CACR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000009C) Layerx Default Color Configuration Register                */
    
    struct {
      __IOM uint32 DCBLUE     : 8;            /*!< [7..0] Default Color Blue                                                 */
      __IOM uint32 DCGREEN    : 8;            /*!< [15..8] Default Color Green                                               */
      __IOM uint32 DCRED      : 8;            /*!< [23..16] Default Color Red                                                */
      __IOM uint32 DCALPHA    : 8;            /*!< [31..24] Default Color Alpha                                              */
    } bit;
  } L1DCCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000A0) Layerx Blending Factors Configuration Register             */
    
    struct {
      __IOM uint32 BF2        : 3;            /*!< [2..0] Blending Factor 2                                                  */
            uint32            : 5;
      __IOM uint32 BF1        : 3;            /*!< [10..8] Blending Factor 1                                                 */
            uint32            : 21;
    } bit;
  } L1BFCR;
  __IM  uint32  RESERVED5[2];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000AC) Layerx Color Frame Buffer Address Register                 */
    
    struct {
      __IOM uint32 CFBADD     : 32;           /*!< [31..0] Color Frame Buffer Start Address                                  */
    } bit;
  } L1CFBAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000B0) Layerx Color Frame Buffer Length Register                  */
    
    struct {
      __IOM uint32 CFBLL      : 13;           /*!< [12..0] Color Frame Buffer Line Length                                    */
            uint32            : 3;
      __IOM uint32 CFBP       : 13;           /*!< [28..16] Color Frame Buffer Pitch in bytes                                */
            uint32            : 3;
    } bit;
  } L1CFBLR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000B4) Layerx ColorFrame Buffer Line Number Register              */
    
    struct {
      __IOM uint32 CFBLNBR    : 11;           /*!< [10..0] Frame Buffer Line Number                                          */
            uint32            : 21;
    } bit;
  } L1CFBLNR;
  __IM  uint32  RESERVED6[3];
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x000000C4) Layerx CLUT Write Register                                 */
    
    struct {
      __OM  uint32 BLUE       : 8;            /*!< [7..0] Blue value                                                         */
      __OM  uint32 GREEN      : 8;            /*!< [15..8] Green value                                                       */
      __OM  uint32 RED        : 8;            /*!< [23..16] Red value                                                        */
      __OM  uint32 CLUTADD    : 8;            /*!< [31..24] CLUT Address                                                     */
    } bit;
  } L1CLUTWR;
  __IM  uint32  RESERVED7[15];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000104) Layerx Control Register                                    */
    
