Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 LEN        : 1;            /*!< [0..0] Layer Enable                                                       */
      __IOM uint32 COLKEN     : 1;            /*!< [1..1] Color Keying Enable                                                */
            uint32            : 2;
      __IOM uint32 CLUTEN     : 1;            /*!< [4..4] Color Look-Up Table Enable                                         */
            uint32            : 27;
    } bit;
  } L2CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000108) Layerx Window Horizontal Position Configuration
                                                                    Register                                                   */
    
    struct {
      __IOM uint32 WHSTPOS    : 12;           /*!< [11..0] Window Horizontal Start Position                                  */
            uint32            : 4;
      __IOM uint32 WHSPPOS    : 12;           /*!< [27..16] Window Horizontal Stop Position                                  */
            uint32            : 4;
    } bit;
  } L2WHPCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000010C) Layerx Window Vertical Position Configuration
                                                                    Register                                                   */
    
    struct {
      __IOM uint32 WVSTPOS    : 11;           /*!< [10..0] Window Vertical Start Position                                    */
            uint32            : 5;
      __IOM uint32 WVSPPOS    : 11;           /*!< [26..16] Window Vertical Stop Position                                    */
            uint32            : 5;
    } bit;
  } L2WVPCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000110) Layerx Color Keying Configuration Register                 */
    
    struct {
      __IOM uint32 CKBLUE     : 8;            /*!< [7..0] Color Key Blue value                                               */
      __IOM uint32 CKGREEN    : 7;            /*!< [14..8] Color Key Green value                                             */
      __IOM uint32 CKRED      : 9;            /*!< [23..15] Color Key Red value                                              */
            uint32            : 8;
    } bit;
  } L2CKCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000114) Layerx Pixel Format Configuration Register                 */
    
    struct {
      __IOM uint32 PF         : 3;            /*!< [2..0] Pixel Format                                                       */
            uint32            : 29;
    } bit;
  } L2PFCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000118) Layerx Constant Alpha Configuration Register               */
    
    struct {
      __IOM uint32 CONSTA     : 8;            /*!< [7..0] Constant Alpha                                                     */
            uint32            : 24;
    } bit;
  } L2CACR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000011C) Layerx Default Color Configuration Register                */
    
    struct {
      __IOM uint32 DCBLUE     : 8;            /*!< [7..0] Default Color Blue                                                 */
      __IOM uint32 DCGREEN    : 8;            /*!< [15..8] Default Color Green                                               */
      __IOM uint32 DCRED      : 8;            /*!< [23..16] Default Color Red                                                */
      __IOM uint32 DCALPHA    : 8;            /*!< [31..24] Default Color Alpha                                              */
    } bit;
  } L2DCCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000120) Layerx Blending Factors Configuration Register             */
    
    struct {
      __IOM uint32 BF2        : 3;            /*!< [2..0] Blending Factor 2                                                  */
            uint32            : 5;
      __IOM uint32 BF1        : 3;            /*!< [10..8] Blending Factor 1                                                 */
            uint32            : 21;
    } bit;
  } L2BFCR;
  __IM  uint32  RESERVED8[2];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000012C) Layerx Color Frame Buffer Address Register                 */
    
    struct {
      __IOM uint32 CFBADD     : 32;           /*!< [31..0] Color Frame Buffer Start Address                                  */
    } bit;
  } L2CFBAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000130) Layerx Color Frame Buffer Length Register                  */
    
    struct {
      __IOM uint32 CFBLL      : 13;           /*!< [12..0] Color Frame Buffer Line Length                                    */
            uint32            : 3;
      __IOM uint32 CFBP       : 13;           /*!< [28..16] Color Frame Buffer Pitch in bytes                                */
            uint32            : 3;
    } bit;
  } L2CFBLR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000134) Layerx ColorFrame Buffer Line Number Register              */
    
    struct {
      __IOM uint32 CFBLNBR    : 11;           /*!< [10..0] Frame Buffer Line Number                                          */
            uint32            : 21;
    } bit;
  } L2CFBLNR;
  __IM  uint32  RESERVED9[3];
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000144) Layerx CLUT Write Register                                 */
    
    struct {
      __OM  uint32 BLUE       : 8;            /*!< [7..0] Blue value                                                         */
      __OM  uint32 GREEN      : 8;            /*!< [15..8] Green value                                                       */
      __OM  uint32 RED        : 8;            /*!< [23..16] Red value                                                        */
      __OM  uint32 CLUTADD    : 8;            /*!< [31..24] CLUT Address                                                     */
    } bit;
  } L2CLUTWR;
} LTDC_Type;                                    /*!< Size = 328 (0x148)                                                        */



/* =========================================================================================================================== */
/* ================                                           SAI1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial audio interface (SAI1)
  */

typedef struct {                                /*!< (@ 0x40015800) SAI1 Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Global configuration register                              */
    
