Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 SYNCIN     : 2;            /*!< [1..0] Synchronization inputs                                             */
            uint32            : 2;
      __IOM uint32 SYNCOUT    : 2;            /*!< [5..4] Synchronization outputs                                            */
            uint32            : 26;
    } bit;
  } GCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) AConfiguration register 1                                  */
    
    struct {
      __IOM uint32 MODE       : 2;            /*!< [1..0] Audio block mode                                                   */
      __IOM uint32 PRTCFG     : 2;            /*!< [3..2] Protocol configuration                                             */
            uint32            : 1;
      __IOM uint32 DS         : 3;            /*!< [7..5] Data size                                                          */
      __IOM uint32 LSBFIRST   : 1;            /*!< [8..8] Least significant bit first                                        */
      __IOM uint32 CKSTR      : 1;            /*!< [9..9] Clock strobing edge                                                */
      __IOM uint32 SYNCEN     : 2;            /*!< [11..10] Synchronization enable                                           */
      __IOM uint32 MONO       : 1;            /*!< [12..12] Mono mode                                                        */
      __IOM uint32 OutDri     : 1;            /*!< [13..13] Output drive                                                     */
            uint32            : 2;
      __IOM uint32 SAIAEN     : 1;            /*!< [16..16] Audio block A enable                                             */
      __IOM uint32 DMAEN      : 1;            /*!< [17..17] DMA enable                                                       */
            uint32            : 1;
      __IOM uint32 NODIV      : 1;            /*!< [19..19] No divider                                                       */
      __IOM uint32 MCJDIV     : 4;            /*!< [23..20] Master clock divider                                             */
            uint32            : 8;
    } bit;
  } ACR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) AConfiguration register 2                                  */
    
    struct {
      __IOM uint32 FTH        : 3;            /*!< [2..0] FIFO threshold                                                     */
      __IOM uint32 FFLUS      : 1;            /*!< [3..3] FIFO flush                                                         */
      __IOM uint32 TRIS       : 1;            /*!< [4..4] Tristate management on data line                                   */
      __IOM uint32 MUTE       : 1;            /*!< [5..5] Mute                                                               */
      __IOM uint32 MUTEVAL    : 1;            /*!< [6..6] Mute value                                                         */
      __IOM uint32 MUTECN     : 6;            /*!< [12..7] Mute counter                                                      */
      __IOM uint32 CPL        : 1;            /*!< [13..13] Complement bit                                                   */
      __IOM uint32 COMP       : 2;            /*!< [15..14] Companding mode                                                  */
            uint32            : 16;
    } bit;
  } ACR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) AFRCR                                                      */
    
    struct {
      __IOM uint32 FRL        : 8;            /*!< [7..0] Frame length                                                       */
      __IOM uint32 FSALL      : 7;            /*!< [14..8] Frame synchronization active level length                         */
            uint32            : 1;
      __IOM uint32 FSDEF      : 1;            /*!< [16..16] Frame synchronization definition                                 */
      __IOM uint32 FSPOL      : 1;            /*!< [17..17] Frame synchronization polarity                                   */
      __IOM uint32 FSOFF      : 1;            /*!< [18..18] Frame synchronization offset                                     */
            uint32            : 13;
    } bit;
  } AFRCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) ASlot register                                             */
    
    struct {
      __IOM uint32 FBOFF      : 5;            /*!< [4..0] First bit offset                                                   */
            uint32            : 1;
      __IOM uint32 SLOTSZ     : 2;            /*!< [7..6] Slot size                                                          */
      __IOM uint32 NBSLOT     : 4;            /*!< [11..8] Number of slots in an audio frame                                 */
            uint32            : 4;
      __IOM uint32 SLOTEN     : 16;           /*!< [31..16] Slot enable                                                      */
    } bit;
  } ASLOTR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) AInterrupt mask register2                                  */
    
    struct {
      __IOM uint32 OVRUDRIE   : 1;            /*!< [0..0] Overrun/underrun interrupt enable                                  */
      __IOM uint32 MUTEDET    : 1;            /*!< [1..1] Mute detection interrupt enable                                    */
      __IOM uint32 WCKCFG     : 1;            /*!< [2..2] Wrong clock configuration interrupt enable                         */
      __IOM uint32 FREQIE     : 1;            /*!< [3..3] FIFO request interrupt enable                                      */
      __IOM uint32 CNRDYIE    : 1;            /*!< [4..4] Codec not ready interrupt enable                                   */
      __IOM uint32 AFSDETIE   : 1;            /*!< [5..5] Anticipated frame synchronization detection interrupt
                                                     enable                                                                    */
      __IOM uint32 LFSDET     : 1;            /*!< [6..6] Late frame synchronization detection interrupt enable              */
            uint32            : 25;
    } bit;
  } AIM;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) AStatus register                                           */
    
