Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 FBOFF      : 5;            /*!< [4..0] First bit offset                                                   */
            uint32            : 1;
      __IOM uint32 SLOTSZ     : 2;            /*!< [7..6] Slot size                                                          */
      __IOM uint32 NBSLOT     : 4;            /*!< [11..8] Number of slots in an audio frame                                 */
            uint32            : 4;
      __IOM uint32 SLOTEN     : 16;           /*!< [31..16] Slot enable                                                      */
    } bit;
  } BSLOTR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) BInterrupt mask register2                                  */
    
    struct {
      __IOM uint32 OVRUDRIE   : 1;            /*!< [0..0] Overrun/underrun interrupt enable                                  */
      __IOM uint32 MUTEDET    : 1;            /*!< [1..1] Mute detection interrupt enable                                    */
      __IOM uint32 WCKCFG     : 1;            /*!< [2..2] Wrong clock configuration interrupt enable                         */
      __IOM uint32 FREQIE     : 1;            /*!< [3..3] FIFO request interrupt enable                                      */
      __IOM uint32 CNRDYIE    : 1;            /*!< [4..4] Codec not ready interrupt enable                                   */
      __IOM uint32 AFSDETIE   : 1;            /*!< [5..5] Anticipated frame synchronization detection interrupt
                                                     enable                                                                    */
      __IOM uint32 LFSDETIE   : 1;            /*!< [6..6] Late frame synchronization detection interrupt enable              */
            uint32            : 25;
    } bit;
  } BIM;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000038) BStatus register                                           */
    
    struct {
      __IM  uint32 OVRUDR     : 1;            /*!< [0..0] Overrun / underrun                                                 */
      __IM  uint32 MUTEDET    : 1;            /*!< [1..1] Mute detection                                                     */
      __IM  uint32 WCKCFG     : 1;            /*!< [2..2] Wrong clock configuration flag                                     */
      __IM  uint32 FREQ       : 1;            /*!< [3..3] FIFO request                                                       */
      __IM  uint32 CNRDY      : 1;            /*!< [4..4] Codec not ready                                                    */
      __IM  uint32 AFSDET     : 1;            /*!< [5..5] Anticipated frame synchronization detection                        */
      __IM  uint32 LFSDET     : 1;            /*!< [6..6] Late frame synchronization detection                               */
            uint32            : 9;
      __IM  uint32 FLVL       : 3;            /*!< [18..16] FIFO level threshold                                             */
            uint32            : 13;
    } bit;
  } BSR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x0000003C) BClear flag register                                       */
    
    struct {
      __OM  uint32 OVRUDR     : 1;            /*!< [0..0] Clear overrun / underrun                                           */
      __OM  uint32 MUTEDET    : 1;            /*!< [1..1] Mute detection flag                                                */
      __OM  uint32 WCKCFG     : 1;            /*!< [2..2] Clear wrong clock configuration flag                               */
            uint32            : 1;
      __OM  uint32 CNRDY      : 1;            /*!< [4..4] Clear codec not ready flag                                         */
      __OM  uint32 CAFSDET    : 1;            /*!< [5..5] Clear anticipated frame synchronization detection flag             */
      __OM  uint32 LFSDET     : 1;            /*!< [6..6] Clear late frame synchronization detection flag                    */
            uint32            : 25;
    } bit;
  } BCLRFR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000040) BData register                                             */
    
    struct {
      __IOM uint32 DATA       : 32;           /*!< [31..0] Data                                                              */
    } bit;
  } BDR;
} SAI1_Type;                                    /*!< Size = 68 (0x44)                                                          */



/* =========================================================================================================================== */
/* ================                                           DMA2D                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA2D controller (DMA2D)
  */

typedef struct {                                /*!< (@ 0x4002B000) DMA2D Structure                                            */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register                                           */
    
    struct {
      __IOM uint32 START      : 1;            /*!< [0..0] Start                                                              */
      __IOM uint32 SUSP       : 1;            /*!< [1..1] Suspend                                                            */
      __IOM uint32 ABORT      : 1;            /*!< [2..2] Abort                                                              */
            uint32            : 5;
      __IOM uint32 TEIE       : 1;            /*!< [8..8] Transfer error interrupt enable                                    */
      __IOM uint32 TCIE       : 1;            /*!< [9..9] Transfer complete interrupt enable                                 */
      __IOM uint32 TWIE       : 1;            /*!< [10..10] Transfer watermark interrupt enable                              */
      __IOM uint32 CAEIE      : 1;            /*!< [11..11] CLUT access error interrupt enable                               */
      __IOM uint32 CTCIE      : 1;            /*!< [12..12] CLUT transfer complete interrupt enable                          */
      __IOM uint32 CEIE       : 1;            /*!< [13..13] Configuration Error Interrupt Enable                             */
            uint32            : 2;
      __IOM uint32 MODE       : 2;            /*!< [17..16] DMA2D mode                                                       */
            uint32            : 14;
    } bit;
  } CR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000004) Interrupt Status Register                                  */
    
