Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 TEIF       : 1;            /*!< [0..0] Transfer error interrupt flag                                      */
      __IM  uint32 TCIF       : 1;            /*!< [1..1] Transfer complete interrupt flag                                   */
      __IM  uint32 TWIF       : 1;            /*!< [2..2] Transfer watermark interrupt flag                                  */
      __IM  uint32 CAEIF      : 1;            /*!< [3..3] CLUT access error interrupt flag                                   */
      __IM  uint32 CTCIF      : 1;            /*!< [4..4] CLUT transfer complete interrupt flag                              */
      __IM  uint32 CEIF       : 1;            /*!< [5..5] Configuration error interrupt flag                                 */
            uint32            : 26;
    } bit;
  } ISR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) interrupt flag clear register                              */
    
    struct {
      __IOM uint32 CTEIF      : 1;            /*!< [0..0] Clear Transfer error interrupt flag                                */
      __IOM uint32 CTCIF      : 1;            /*!< [1..1] Clear transfer complete interrupt flag                             */
      __IOM uint32 CTWIF      : 1;            /*!< [2..2] Clear transfer watermark interrupt flag                            */
      __IOM uint32 CAECIF     : 1;            /*!< [3..3] Clear CLUT access error interrupt flag                             */
      __IOM uint32 CCTCIF     : 1;            /*!< [4..4] Clear CLUT transfer complete interrupt flag                        */
      __IOM uint32 CCEIF      : 1;            /*!< [5..5] Clear configuration error interrupt flag                           */
            uint32            : 26;
    } bit;
  } IFCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) foreground memory address register                         */
    
    struct {
      __IOM uint32 MA         : 32;           /*!< [31..0] Memory address                                                    */
    } bit;
  } FGMAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) foreground offset register                                 */
    
    struct {
      __IOM uint32 LO         : 14;           /*!< [13..0] Line offset                                                       */
            uint32            : 18;
    } bit;
  } FGOR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) background memory address register                         */
    
    struct {
      __IOM uint32 MA         : 32;           /*!< [31..0] Memory address                                                    */
    } bit;
  } BGMAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) background offset register                                 */
    
    struct {
      __IOM uint32 LO         : 14;           /*!< [13..0] Line offset                                                       */
            uint32            : 18;
    } bit;
  } BGOR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) foreground PFC control register                            */
    
    struct {
      __IOM uint32 CM         : 4;            /*!< [3..0] Color mode                                                         */
      __IOM uint32 CCM        : 1;            /*!< [4..4] CLUT color mode                                                    */
      __IOM uint32 START      : 1;            /*!< [5..5] Start                                                              */
            uint32            : 2;
      __IOM uint32 CS         : 8;            /*!< [15..8] CLUT size                                                         */
      __IOM uint32 AM         : 2;            /*!< [17..16] Alpha mode                                                       */
            uint32            : 6;
      __IOM uint32 ALPHA      : 8;            /*!< [31..24] Alpha value                                                      */
    } bit;
  } FGPFCCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) foreground color register                                  */
    
    struct {
      __IOM uint32 BLUE       : 8;            /*!< [7..0] Blue Value                                                         */
      __IOM uint32 GREEN      : 8;            /*!< [15..8] Green Value                                                       */
      __IOM uint32 RED        : 8;            /*!< [23..16] Red Value                                                        */
            uint32            : 8;
    } bit;
  } FGCOLR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) background PFC control register                            */
    
    struct {
      __IOM uint32 CM         : 4;            /*!< [3..0] Color mode                                                         */
      __IOM uint32 CCM        : 1;            /*!< [4..4] CLUT Color mode                                                    */
      __IOM uint32 START      : 1;            /*!< [5..5] Start                                                              */
            uint32            : 2;
      __IOM uint32 CS         : 8;            /*!< [15..8] CLUT size                                                         */
      __IOM uint32 AM         : 2;            /*!< [17..16] Alpha mode                                                       */
            uint32            : 6;
      __IOM uint32 ALPHA      : 8;            /*!< [31..24] Alpha value                                                      */
    } bit;
  } BGPFCCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) background color register                                  */
    
    struct {
      __IOM uint32 BLUE       : 8;            /*!< [7..0] Blue Value                                                         */
      __IOM uint32 GREEN      : 8;            /*!< [15..8] Green Value                                                       */
      __IOM uint32 RED        : 8;            /*!< [23..16] Red Value                                                        */
            uint32            : 8;
    } bit;
  } BGCOLR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) foreground CLUT memory address register                    */
    
