Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 MA         : 32;           /*!< [31..0] Memory Address                                                    */
    } bit;
  } FGCMAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000030) background CLUT memory address register                    */
    
    struct {
      __IOM uint32 MA         : 32;           /*!< [31..0] Memory address                                                    */
    } bit;
  } BGCMAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) output PFC control register                                */
    
    struct {
      __IOM uint32 CM         : 3;            /*!< [2..0] Color mode                                                         */
            uint32            : 29;
    } bit;
  } OPFCCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000038) output color register                                      */
    
    struct {
      __IOM uint32 BLUE       : 8;            /*!< [7..0] Blue Value                                                         */
      __IOM uint32 GREEN      : 8;            /*!< [15..8] Green Value                                                       */
      __IOM uint32 RED        : 8;            /*!< [23..16] Red Value                                                        */
      __IOM uint32 APLHA      : 8;            /*!< [31..24] Alpha Channel Value                                              */
    } bit;
  } OCOLR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000003C) output memory address register                             */
    
    struct {
      __IOM uint32 MA         : 32;           /*!< [31..0] Memory Address                                                    */
    } bit;
  } OMAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000040) output offset register                                     */
    
    struct {
      __IOM uint32 LO         : 14;           /*!< [13..0] Line Offset                                                       */
            uint32            : 18;
    } bit;
  } OOR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000044) number of line register                                    */
    
    struct {
      __IOM uint32 NL         : 16;           /*!< [15..0] Number of lines                                                   */
      __IOM uint32 PL         : 14;           /*!< [29..16] Pixel per lines                                                  */
            uint32            : 2;
    } bit;
  } NLR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000048) line watermark register                                    */
    
    struct {
      __IOM uint32 LW         : 16;           /*!< [15..0] Line watermark                                                    */
            uint32            : 16;
    } bit;
  } LWR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000004C) AHB master timer configuration register                    */
    
    struct {
      __IOM uint32 EN         : 1;            /*!< [0..0] Enable                                                             */
            uint32            : 7;
      __IOM uint32 DT         : 8;            /*!< [15..8] Dead Time                                                         */
            uint32            : 16;
    } bit;
  } AMTCR;
  __IM  uint32  RESERVED[236];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000400) FGCLUT                                                     */
    
    struct {
      __IOM uint32 BLUE       : 8;            /*!< [7..0] BLUE                                                               */
      __IOM uint32 GREEN      : 8;            /*!< [15..8] GREEN                                                             */
      __IOM uint32 RED        : 8;            /*!< [23..16] RED                                                              */
      __IOM uint32 APLHA      : 8;            /*!< [31..24] APLHA                                                            */
    } bit;
  } FGCLUT;
  __IM  uint32  RESERVED1[255];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000800) BGCLUT                                                     */
    
    struct {
      __IOM uint32 BLUE       : 8;            /*!< [7..0] BLUE                                                               */
      __IOM uint32 GREEN      : 8;            /*!< [15..8] GREEN                                                             */
      __IOM uint32 RED        : 8;            /*!< [23..16] RED                                                              */
      __IOM uint32 APLHA      : 8;            /*!< [31..24] APLHA                                                            */
    } bit;
  } BGCLUT;
} DMA2D_Type;                                   /*!< Size = 2052 (0x804)                                                       */



/* =========================================================================================================================== */
/* ================                                          QUADSPI                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief QuadSPI interface (QUADSPI)
  */

typedef struct {                                /*!< (@ 0xA0001000) QUADSPI Structure                                          */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register                                           */
    
    struct {
      __IOM uint32 EN         : 1;            /*!< [0..0] Enable                                                             */
      __IOM uint32 ABORT      : 1;            /*!< [1..1] Abort request                                                      */
      __IOM uint32 DMAEN      : 1;            /*!< [2..2] DMA enable                                                         */
      __IOM uint32 TCEN       : 1;            /*!< [3..3] Timeout counter enable                                             */
      __IOM uint32 SSHIFT     : 1;            /*!< [4..4] Sample shift                                                       */
            uint32            : 1;
      __IOM uint32 DFM        : 1;            /*!< [6..6] Dual-flash mode                                                    */
      __IOM uint32 FSEL       : 1;            /*!< [7..7] FLASH memory selection                                             */
      __IOM uint32 FTHRES     : 5;            /*!< [12..8] IFO threshold level                                               */
            uint32            : 3;
      __IOM uint32 TEIE       : 1;            /*!< [16..16] Transfer error interrupt enable                                  */
      __IOM uint32 TCIE       : 1;            /*!< [17..17] Transfer complete interrupt enable                               */
      __IOM uint32 FTIE       : 1;            /*!< [18..18] FIFO threshold interrupt enable                                  */
      __IOM uint32 SMIE       : 1;            /*!< [19..19] Status match interrupt enable                                    */
      __IOM uint32 TOIE       : 1;            /*!< [20..20] TimeOut interrupt enable                                         */
            uint32            : 1;
      __IOM uint32 APMS       : 1;            /*!< [22..22] Automatic poll mode stop                                         */
      __IOM uint32 PMM        : 1;            /*!< [23..23] Polling match mode                                               */
      __IOM uint32 PRESCALER  : 8;            /*!< [31..24] Clock prescaler                                                  */
    } bit;
  } CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) device configuration register                              */
    
