Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 CKMODE     : 1;            /*!< [0..0] Mode 0 / mode 3                                                    */
            uint32            : 7;
      __IOM uint32 CSHT       : 3;            /*!< [10..8] Chip select high time                                             */
            uint32            : 5;
      __IOM uint32 FSIZE      : 5;            /*!< [20..16] FLASH memory size                                                */
            uint32            : 11;
    } bit;
  } DCR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000008) status register                                            */
    
    struct {
      __IM  uint32 TEF        : 1;            /*!< [0..0] Transfer error flag                                                */
      __IM  uint32 TCF        : 1;            /*!< [1..1] Transfer complete flag                                             */
      __IM  uint32 FTF        : 1;            /*!< [2..2] FIFO threshold flag                                                */
      __IM  uint32 SMF        : 1;            /*!< [3..3] Status match flag                                                  */
      __IM  uint32 TOF        : 1;            /*!< [4..4] Timeout flag                                                       */
      __IM  uint32 BUSY       : 1;            /*!< [5..5] Busy                                                               */
            uint32            : 2;
      __IM  uint32 FLEVEL     : 7;            /*!< [14..8] FIFO level                                                        */
            uint32            : 17;
    } bit;
  } SR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) flag clear register                                        */
    
    struct {
      __IOM uint32 CTEF       : 1;            /*!< [0..0] Clear transfer error flag                                          */
      __IOM uint32 CTCF       : 1;            /*!< [1..1] Clear transfer complete flag                                       */
            uint32            : 1;
      __IOM uint32 CSMF       : 1;            /*!< [3..3] Clear status match flag                                            */
      __IOM uint32 CTOF       : 1;            /*!< [4..4] Clear timeout flag                                                 */
            uint32            : 27;
    } bit;
  } FCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) data length register                                       */
    
    struct {
      __IOM uint32 DL         : 32;           /*!< [31..0] Data length                                                       */
    } bit;
  } DLR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) communication configuration register                       */
    
    struct {
      __IOM uint32 INSTRUCTION : 8;           /*!< [7..0] Instruction                                                        */
      __IOM uint32 IMODE      : 2;            /*!< [9..8] Instruction mode                                                   */
      __IOM uint32 ADMODE     : 2;            /*!< [11..10] Address mode                                                     */
      __IOM uint32 ADSIZE     : 2;            /*!< [13..12] Address size                                                     */
      __IOM uint32 ABMODE     : 2;            /*!< [15..14] Alternate bytes mode                                             */
      __IOM uint32 ABSIZE     : 2;            /*!< [17..16] Alternate bytes size                                             */
      __IOM uint32 DCYC       : 5;            /*!< [22..18] Number of dummy cycles                                           */
            uint32            : 1;
      __IOM uint32 DMODE      : 2;            /*!< [25..24] Data mode                                                        */
      __IOM uint32 FMODE      : 2;            /*!< [27..26] Functional mode                                                  */
      __IOM uint32 SIOO       : 1;            /*!< [28..28] Send instruction only once mode                                  */
            uint32            : 1;
      __IOM uint32 DHHC       : 1;            /*!< [30..30] DDR hold half cycle                                              */
      __IOM uint32 DDRM       : 1;            /*!< [31..31] Double data rate mode                                            */
    } bit;
  } CCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) address register                                           */
    
    struct {
      __IOM uint32 ADDRESS    : 32;           /*!< [31..0] Address                                                           */
    } bit;
  } AR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) ABR                                                        */
    
    struct {
      __IOM uint32 ALTERNATE  : 32;           /*!< [31..0] ALTERNATE                                                         */
    } bit;
  } ABR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) data register                                              */
    
    struct {
      __IOM uint32 DATA       : 32;           /*!< [31..0] Data                                                              */
    } bit;
  } DR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) polling status mask register                               */
    
    struct {
      __IOM uint32 MASK       : 32;           /*!< [31..0] Status mask                                                       */
    } bit;
  } PSMKR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) polling status match register                              */
    
    struct {
      __IOM uint32 MATCH      : 32;           /*!< [31..0] Status match                                                      */
    } bit;
  } PSMAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) polling interval register                                  */
    
