Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 INTERVAL   : 16;           /*!< [15..0] Polling interval                                                  */
            uint32            : 16;
    } bit;
  } PIR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000030) low-power timeout register                                 */
    
    struct {
      __IOM uint32 TIMEOUT    : 16;           /*!< [15..0] Timeout period                                                    */
            uint32            : 16;
    } bit;
  } LPTR;
} QUADSPI_Type;                                 /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                            CEC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief HDMI-CEC controller (CEC)
  */

typedef struct {                                /*!< (@ 0x40006C00) CEC Structure                                              */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) control register                                           */
    
    struct {
      __IOM uint32 CECEN      : 1;            /*!< [0..0] CEC Enable                                                         */
      __IOM uint32 TXSOM      : 1;            /*!< [1..1] Tx start of message                                                */
      __IOM uint32 TXEOM      : 1;            /*!< [2..2] Tx End Of Message                                                  */
            uint32            : 29;
    } bit;
  } CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) configuration register                                     */
    
    struct {
      __IOM uint32 SFT        : 3;            /*!< [2..0] Signal Free Time                                                   */
      __IOM uint32 RXTOL      : 1;            /*!< [3..3] Rx-Tolerance                                                       */
      __IOM uint32 BRESTP     : 1;            /*!< [4..4] Rx-stop on bit rising error                                        */
      __IOM uint32 BREGEN     : 1;            /*!< [5..5] Generate error-bit on bit rising error                             */
      __IOM uint32 LBPEGEN    : 1;            /*!< [6..6] Generate Error-Bit on Long Bit Period Error                        */
      __IOM uint32 BRDNOGEN   : 1;            /*!< [7..7] Avoid Error-Bit Generation in Broadcast                            */
      __IOM uint32 SFTOP      : 1;            /*!< [8..8] SFT Option Bit                                                     */
            uint32            : 7;
      __IOM uint32 OAR        : 15;           /*!< [30..16] Own addresses configuration                                      */
      __IOM uint32 LSTN       : 1;            /*!< [31..31] Listen mode                                                      */
    } bit;
  } CFGR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000008) Tx data register                                           */
    
    struct {
      __OM  uint32 TXD        : 8;            /*!< [7..0] Tx Data register                                                   */
            uint32            : 24;
    } bit;
  } TXDR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000000C) Rx Data Register                                           */
    
    struct {
      __IM  uint32 RXDR       : 8;            /*!< [7..0] CEC Rx Data Register                                               */
            uint32            : 24;
    } bit;
  } RXDR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Interrupt and Status Register                              */
    
    struct {
      __IOM uint32 RXBR       : 1;            /*!< [0..0] Rx-Byte Received                                                   */
      __IOM uint32 RXEND      : 1;            /*!< [1..1] End Of Reception                                                   */
      __IOM uint32 RXOVR      : 1;            /*!< [2..2] Rx-Overrun                                                         */
      __IOM uint32 BRE        : 1;            /*!< [3..3] Rx-Bit rising error                                                */
      __IOM uint32 SBPE       : 1;            /*!< [4..4] Rx-Short Bit period error                                          */
      __IOM uint32 LBPE       : 1;            /*!< [5..5] Rx-Long Bit Period Error                                           */
      __IOM uint32 RXACKE     : 1;            /*!< [6..6] Rx-Missing Acknowledge                                             */
      __IOM uint32 ARBLST     : 1;            /*!< [7..7] Arbitration Lost                                                   */
      __IOM uint32 TXBR       : 1;            /*!< [8..8] Tx-Byte Request                                                    */
      __IOM uint32 TXEND      : 1;            /*!< [9..9] End of Transmission                                                */
      __IOM uint32 TXUDR      : 1;            /*!< [10..10] Tx-Buffer Underrun                                               */
      __IOM uint32 TXERR      : 1;            /*!< [11..11] Tx-Error                                                         */
      __IOM uint32 TXACKE     : 1;            /*!< [12..12] Tx-Missing acknowledge error                                     */
            uint32            : 19;
    } bit;
  } ISR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) interrupt enable register                                  */
    
    struct {
      __IOM uint32 RXBRIE     : 1;            /*!< [0..0] Rx-Byte Received Interrupt Enable                                  */
      __IOM uint32 RXENDIE    : 1;            /*!< [1..1] End Of Reception Interrupt Enable                                  */
      __IOM uint32 RXOVRIE    : 1;            /*!< [2..2] Rx-Buffer Overrun Interrupt Enable                                 */
      __IOM uint32 BREIE      : 1;            /*!< [3..3] Bit Rising Error Interrupt Enable                                  */
      __IOM uint32 SBPEIE     : 1;            /*!< [4..4] Short Bit Period Error Interrupt Enable                            */
      __IOM uint32 LBPEIE     : 1;            /*!< [5..5] Long Bit Period Error Interrupt Enable                             */
      __IOM uint32 RXACKIE    : 1;            /*!< [6..6] Rx-Missing Acknowledge Error Interrupt Enable                      */
      __IOM uint32 ARBLSTIE   : 1;            /*!< [7..7] Arbitration Lost Interrupt Enable                                  */
      __IOM uint32 TXBRIE     : 1;            /*!< [8..8] Tx-Byte Request Interrupt Enable                                   */
      __IOM uint32 TXENDIE    : 1;            /*!< [9..9] Tx-End of message interrupt enable                                 */
      __IOM uint32 TXUDRIE    : 1;            /*!< [10..10] Tx-Underrun interrupt enable                                     */
      __IOM uint32 TXERRIE    : 1;            /*!< [11..11] Tx-Error Interrupt Enable                                        */
      __IOM uint32 TXACKIE    : 1;            /*!< [12..12] Tx-Missing Acknowledge Error Interrupt Enable                    */
            uint32            : 19;
    } bit;
  } IER;
} CEC_Type;                                     /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                         SPDIF_RX                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Receiver Interface (SPDIF_RX)
  */

typedef struct {                                /*!< (@ 0x40004000) SPDIF_RX Structure                                         */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Control register                                           */
    
