Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 SPDIFEN    : 2;            /*!< [1..0] Peripheral Block Enable                                            */
      __IOM uint32 RXDMAEN    : 1;            /*!< [2..2] Receiver DMA ENable for data flow                                  */
      __IOM uint32 RXSTEO     : 1;            /*!< [3..3] STerEO Mode                                                        */
      __IOM uint32 DRFMT      : 2;            /*!< [5..4] RX Data format                                                     */
      __IOM uint32 PMSK       : 1;            /*!< [6..6] Mask Parity error bit                                              */
      __IOM uint32 VMSK       : 1;            /*!< [7..7] Mask of Validity bit                                               */
      __IOM uint32 CUMSK      : 1;            /*!< [8..8] Mask of channel status and user bits                               */
      __IOM uint32 PTMSK      : 1;            /*!< [9..9] Mask of Preamble Type bits                                         */
      __IOM uint32 CBDMAEN    : 1;            /*!< [10..10] Control Buffer DMA ENable for control flow                       */
      __IOM uint32 CHSEL      : 1;            /*!< [11..11] Channel Selection                                                */
      __IOM uint32 NBTR       : 2;            /*!< [13..12] Maximum allowed re-tries during synchronization phase            */
      __IOM uint32 WFA        : 1;            /*!< [14..14] Wait For Activity                                                */
            uint32            : 1;
      __IOM uint32 INSEL      : 3;            /*!< [18..16] input selection                                                  */
            uint32            : 13;
    } bit;
  } CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Interrupt mask register                                    */
    
    struct {
      __IOM uint32 RXNEIE     : 1;            /*!< [0..0] RXNE interrupt enable                                              */
      __IOM uint32 CSRNEIE    : 1;            /*!< [1..1] Control Buffer Ready Interrupt Enable                              */
      __IOM uint32 PERRIE     : 1;            /*!< [2..2] Parity error interrupt enable                                      */
      __IOM uint32 OVRIE      : 1;            /*!< [3..3] Overrun error Interrupt Enable                                     */
      __IOM uint32 SBLKIE     : 1;            /*!< [4..4] Synchronization Block Detected Interrupt Enable                    */
      __IOM uint32 SYNCDIE    : 1;            /*!< [5..5] Synchronization Done                                               */
      __IOM uint32 IFEIE      : 1;            /*!< [6..6] Serial Interface Error Interrupt Enable                            */
            uint32            : 25;
    } bit;
  } IMR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000008) Status register                                            */
    
    struct {
      __IM  uint32 RXNE       : 1;            /*!< [0..0] Read data register not empty                                       */
      __IM  uint32 CSRNE      : 1;            /*!< [1..1] Control Buffer register is not empty                               */
      __IM  uint32 PERR       : 1;            /*!< [2..2] Parity error                                                       */
      __IM  uint32 OVR        : 1;            /*!< [3..3] Overrun error                                                      */
      __IM  uint32 SBD        : 1;            /*!< [4..4] Synchronization Block Detected                                     */
      __IM  uint32 SYNCD      : 1;            /*!< [5..5] Synchronization Done                                               */
      __IM  uint32 FERR       : 1;            /*!< [6..6] Framing error                                                      */
      __IM  uint32 SERR       : 1;            /*!< [7..7] Synchronization error                                              */
      __IM  uint32 TERR       : 1;            /*!< [8..8] Time-out error                                                     */
            uint32            : 7;
      __IM  uint32 WIDTH5     : 15;           /*!< [30..16] Duration of 5 symbols counted with SPDIF_CLK                     */
            uint32            : 1;
    } bit;
  } SR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x0000000C) Interrupt Flag Clear register                              */
    
    struct {
            uint32            : 2;
      __OM  uint32 PERRCF     : 1;            /*!< [2..2] Clears the Parity error flag                                       */
      __OM  uint32 OVRCF      : 1;            /*!< [3..3] Clears the Overrun error flag                                      */
      __OM  uint32 SBDCF      : 1;            /*!< [4..4] Clears the Synchronization Block Detected flag                     */
      __OM  uint32 SYNCDCF    : 1;            /*!< [5..5] Clears the Synchronization Done flag                               */
            uint32            : 26;
    } bit;
  } IFCR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000010) Data input register                                        */
    
    struct {
      __IM  uint32 DR         : 24;           /*!< [23..0] Parity Error bit                                                  */
      __IM  uint32 PE         : 1;            /*!< [24..24] Parity Error bit                                                 */
      __IM  uint32 V          : 1;            /*!< [25..25] Validity bit                                                     */
      __IM  uint32 U          : 1;            /*!< [26..26] User bit                                                         */
      __IM  uint32 C          : 1;            /*!< [27..27] Channel Status bit                                               */
      __IM  uint32 PT         : 2;            /*!< [29..28] Preamble Type                                                    */
            uint32            : 2;
    } bit;
  } DR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000014) Channel Status register                                    */
    
