Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 USR        : 16;           /*!< [15..0] User data information                                             */
      __IM  uint32 CS         : 8;            /*!< [23..16] Channel A status information                                     */
      __IM  uint32 SOB        : 1;            /*!< [24..24] Start Of Block                                                   */
            uint32            : 7;
    } bit;
  } CSR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000018) Debug Information register                                 */
    
    struct {
      __IM  uint32 THI        : 13;           /*!< [12..0] Threshold HIGH                                                    */
            uint32            : 3;
      __IM  uint32 TLO        : 13;           /*!< [28..16] Threshold LOW                                                    */
            uint32            : 3;
    } bit;
  } DIR;
} SPDIF_RX_Type;                                /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                          SDMMC1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Secure digital input/output       interface (SDMMC1)
  */

typedef struct {                                /*!< (@ 0x40012C00) SDMMC1 Structure                                           */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) power control register                                     */
    
    struct {
      __IOM uint32 PWRCTRL    : 2;            /*!< [1..0] PWRCTRL                                                            */
            uint32            : 30;
    } bit;
  } POWER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) SDI clock control register                                 */
    
    struct {
      __IOM uint32 CLKDIV     : 8;            /*!< [7..0] Clock divide factor                                                */
      __IOM uint32 CLKEN      : 1;            /*!< [8..8] Clock enable bit                                                   */
      __IOM uint32 PWRSAV     : 1;            /*!< [9..9] Power saving configuration bit                                     */
      __IOM uint32 BYPASS     : 1;            /*!< [10..10] Clock divider bypass enable bit                                  */
      __IOM uint32 WIDBUS     : 2;            /*!< [12..11] Wide bus mode enable bit                                         */
      __IOM uint32 NEGEDGE    : 1;            /*!< [13..13] SDIO_CK dephasing selection bit                                  */
      __IOM uint32 HWFC_EN    : 1;            /*!< [14..14] HW Flow Control enable                                           */
            uint32            : 17;
    } bit;
  } CLKCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) argument register                                          */
    
    struct {
      __IOM uint32 CMDARG     : 32;           /*!< [31..0] Command argument                                                  */
    } bit;
  } ARG;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) command register                                           */
    
    struct {
      __IOM uint32 CMDINDEX   : 6;            /*!< [5..0] Command index                                                      */
      __IOM uint32 WAITRESP   : 2;            /*!< [7..6] Wait for response bits                                             */
      __IOM uint32 WAITINT    : 1;            /*!< [8..8] CPSM waits for interrupt request                                   */
      __IOM uint32 WAITPEND   : 1;            /*!< [9..9] CPSM Waits for ends of data transfer (CmdPend internal
                                                     signal)                                                                   */
      __IOM uint32 CPSMEN     : 1;            /*!< [10..10] Command path state machine (CPSM) Enable bit                     */
      __IOM uint32 SDIOSuspend : 1;           /*!< [11..11] SD I/O suspend command                                           */
      __IOM uint32 ENCMDcompl : 1;            /*!< [12..12] Enable CMD completion                                            */
      __IOM uint32 nIEN       : 1;            /*!< [13..13] not Interrupt Enable                                             */
      __IOM uint32 CE_ATACMD  : 1;            /*!< [14..14] CE-ATA command                                                   */
            uint32            : 17;
    } bit;
  } CMD;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000010) command response register                                  */
    
    struct {
      __IM  uint32 RESPCMD    : 6;            /*!< [5..0] Response command index                                             */
            uint32            : 26;
    } bit;
  } RESPCMD;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000014) response 1..4 register                                     */
    
    struct {
      __IM  uint32 CARDSTATUS1 : 32;          /*!< [31..0] see Table 132                                                     */
    } bit;
  } RESP1;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000018) response 1..4 register                                     */
    
    struct {
      __IM  uint32 CARDSTATUS2 : 32;          /*!< [31..0] see Table 132                                                     */
    } bit;
  } RESP2;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000001C) response 1..4 register                                     */
    
