Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 CARDSTATUS3 : 32;          /*!< [31..0] see Table 132                                                     */
    } bit;
  } RESP3;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000020) response 1..4 register                                     */
    
    struct {
      __IM  uint32 CARDSTATUS4 : 32;          /*!< [31..0] see Table 132                                                     */
    } bit;
  } RESP4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) data timer register                                        */
    
    struct {
      __IOM uint32 DATATIME   : 32;           /*!< [31..0] Data timeout period                                               */
    } bit;
  } DTIMER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) data length register                                       */
    
    struct {
      __IOM uint32 DATALENGTH : 25;           /*!< [24..0] Data length value                                                 */
            uint32            : 7;
    } bit;
  } DLEN;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) data control register                                      */
    
    struct {
      __IOM uint32 DTEN       : 1;            /*!< [0..0] DTEN                                                               */
      __IOM uint32 DTDIR      : 1;            /*!< [1..1] Data transfer direction selection                                  */
      __IOM uint32 DTMODE     : 1;            /*!< [2..2] Data transfer mode selection 1: Stream or SDIO multibyte
                                                     data transfer                                                             */
      __IOM uint32 DMAEN      : 1;            /*!< [3..3] DMA enable bit                                                     */
      __IOM uint32 DBLOCKSIZE : 4;            /*!< [7..4] Data block size                                                    */
      __IOM uint32 RWSTART    : 1;            /*!< [8..8] Read wait start                                                    */
      __IOM uint32 RWSTOP     : 1;            /*!< [9..9] Read wait stop                                                     */
      __IOM uint32 RWMOD      : 1;            /*!< [10..10] Read wait mode                                                   */
      __IOM uint32 SDIOEN     : 1;            /*!< [11..11] SD I/O enable functions                                          */
            uint32            : 20;
    } bit;
  } DCTRL;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000030) data counter register                                      */
    
    struct {
      __IM  uint32 DATACOUNT  : 25;           /*!< [24..0] Data count value                                                  */
            uint32            : 7;
    } bit;
  } DCOUNT;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000034) status register                                            */
    
    struct {
      __IM  uint32 CCRCFAIL   : 1;            /*!< [0..0] Command response received (CRC check failed)                       */
      __IM  uint32 DCRCFAIL   : 1;            /*!< [1..1] Data block sent/received (CRC check failed)                        */
      __IM  uint32 CTIMEOUT   : 1;            /*!< [2..2] Command response timeout                                           */
      __IM  uint32 DTIMEOUT   : 1;            /*!< [3..3] Data timeout                                                       */
      __IM  uint32 TXUNDERR   : 1;            /*!< [4..4] Transmit FIFO underrun error                                       */
      __IM  uint32 RXOVERR    : 1;            /*!< [5..5] Received FIFO overrun error                                        */
      __IM  uint32 CMDREND    : 1;            /*!< [6..6] Command response received (CRC check passed)                       */
      __IM  uint32 CMDSENT    : 1;            /*!< [7..7] Command sent (no response required)                                */
      __IM  uint32 DATAEND    : 1;            /*!< [8..8] Data end (data counter, SDIDCOUNT, is zero)                        */
      __IM  uint32 STBITERR   : 1;            /*!< [9..9] Start bit not detected on all data signals in wide bus
                                                     mode                                                                      */
      __IM  uint32 DBCKEND    : 1;            /*!< [10..10] Data block sent/received (CRC check passed)                      */
      __IM  uint32 CMDACT     : 1;            /*!< [11..11] Command transfer in progress                                     */
      __IM  uint32 TXACT      : 1;            /*!< [12..12] Data transmit in progress                                        */
      __IM  uint32 RXACT      : 1;            /*!< [13..13] Data receive in progress                                         */
      __IM  uint32 TXFIFOHE   : 1;            /*!< [14..14] Transmit FIFO half empty: at least 8 words can be written
                                                     into the FIFO                                                             */
      __IM  uint32 RXFIFOHF   : 1;            /*!< [15..15] Receive FIFO half full: there are at least 8 words
                                                     in the FIFO                                                               */
      __IM  uint32 TXFIFOF    : 1;            /*!< [16..16] Transmit FIFO full                                               */
      __IM  uint32 RXFIFOF    : 1;            /*!< [17..17] Receive FIFO full                                                */
      __IM  uint32 TXFIFOE    : 1;            /*!< [18..18] Transmit FIFO empty                                              */
      __IM  uint32 RXFIFOE    : 1;            /*!< [19..19] Receive FIFO empty                                               */
      __IM  uint32 TXDAVL     : 1;            /*!< [20..20] Data available in transmit FIFO                                  */
      __IM  uint32 RXDAVL     : 1;            /*!< [21..21] Data available in receive FIFO                                   */
      __IM  uint32 SDIOIT     : 1;            /*!< [22..22] SDIO interrupt received                                          */
      __IM  uint32 CEATAEND   : 1;            /*!< [23..23] CE-ATA command completion signal received for CMD61              */
            uint32            : 8;
    } bit;
  } STA;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000038) interrupt clear register                                   */
    
