Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 CCRCFAILC  : 1;            /*!< [0..0] CCRCFAIL flag clear bit                                            */
      __IOM uint32 DCRCFAILC  : 1;            /*!< [1..1] DCRCFAIL flag clear bit                                            */
      __IOM uint32 CTIMEOUTC  : 1;            /*!< [2..2] CTIMEOUT flag clear bit                                            */
      __IOM uint32 DTIMEOUTC  : 1;            /*!< [3..3] DTIMEOUT flag clear bit                                            */
      __IOM uint32 TXUNDERRC  : 1;            /*!< [4..4] TXUNDERR flag clear bit                                            */
      __IOM uint32 RXOVERRC   : 1;            /*!< [5..5] RXOVERR flag clear bit                                             */
      __IOM uint32 CMDRENDC   : 1;            /*!< [6..6] CMDREND flag clear bit                                             */
      __IOM uint32 CMDSENTC   : 1;            /*!< [7..7] CMDSENT flag clear bit                                             */
      __IOM uint32 DATAENDC   : 1;            /*!< [8..8] DATAEND flag clear bit                                             */
      __IOM uint32 STBITERRC  : 1;            /*!< [9..9] STBITERR flag clear bit                                            */
      __IOM uint32 DBCKENDC   : 1;            /*!< [10..10] DBCKEND flag clear bit                                           */
            uint32            : 11;
      __IOM uint32 SDIOITC    : 1;            /*!< [22..22] SDIOIT flag clear bit                                            */
      __IOM uint32 CEATAENDC  : 1;            /*!< [23..23] CEATAEND flag clear bit                                          */
            uint32            : 8;
    } bit;
  } ICR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000003C) mask register                                              */
    
    struct {
      __IOM uint32 CCRCFAILIE : 1;            /*!< [0..0] Command CRC fail interrupt enable                                  */
      __IOM uint32 DCRCFAILIE : 1;            /*!< [1..1] Data CRC fail interrupt enable                                     */
      __IOM uint32 CTIMEOUTIE : 1;            /*!< [2..2] Command timeout interrupt enable                                   */
      __IOM uint32 DTIMEOUTIE : 1;            /*!< [3..3] Data timeout interrupt enable                                      */
      __IOM uint32 TXUNDERRIE : 1;            /*!< [4..4] Tx FIFO underrun error interrupt enable                            */
      __IOM uint32 RXOVERRIE  : 1;            /*!< [5..5] Rx FIFO overrun error interrupt enable                             */
      __IOM uint32 CMDRENDIE  : 1;            /*!< [6..6] Command response received interrupt enable                         */
      __IOM uint32 CMDSENTIE  : 1;            /*!< [7..7] Command sent interrupt enable                                      */
      __IOM uint32 DATAENDIE  : 1;            /*!< [8..8] Data end interrupt enable                                          */
      __IOM uint32 STBITERRIE : 1;            /*!< [9..9] Start bit error interrupt enable                                   */
      __IOM uint32 DBCKENDIE  : 1;            /*!< [10..10] Data block end interrupt enable                                  */
      __IOM uint32 CMDACTIE   : 1;            /*!< [11..11] Command acting interrupt enable                                  */
      __IOM uint32 TXACTIE    : 1;            /*!< [12..12] Data transmit acting interrupt enable                            */
      __IOM uint32 RXACTIE    : 1;            /*!< [13..13] Data receive acting interrupt enable                             */
      __IOM uint32 TXFIFOHEIE : 1;            /*!< [14..14] Tx FIFO half empty interrupt enable                              */
      __IOM uint32 RXFIFOHFIE : 1;            /*!< [15..15] Rx FIFO half full interrupt enable                               */
      __IOM uint32 TXFIFOFIE  : 1;            /*!< [16..16] Tx FIFO full interrupt enable                                    */
      __IOM uint32 RXFIFOFIE  : 1;            /*!< [17..17] Rx FIFO full interrupt enable                                    */
      __IOM uint32 TXFIFOEIE  : 1;            /*!< [18..18] Tx FIFO empty interrupt enable                                   */
      __IOM uint32 RXFIFOEIE  : 1;            /*!< [19..19] Rx FIFO empty interrupt enable                                   */
      __IOM uint32 TXDAVLIE   : 1;            /*!< [20..20] Data available in Tx FIFO interrupt enable                       */
      __IOM uint32 RXDAVLIE   : 1;            /*!< [21..21] Data available in Rx FIFO interrupt enable                       */
      __IOM uint32 SDIOITIE   : 1;            /*!< [22..22] SDIO mode interrupt received interrupt enable                    */
      __IOM uint32 CEATAENDIE : 1;            /*!< [23..23] CE-ATA command completion signal received interrupt
                                                     enable                                                                    */
            uint32            : 8;
    } bit;
  } MASK;
  __IM  uint32  RESERVED[2];
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000048) FIFO counter register                                      */
    
    struct {
      __IM  uint32 FIFOCOUNT  : 24;           /*!< [23..0] Remaining number of words to be written to or read from
                                                     the FIFO                                                                  */
            uint32            : 8;
    } bit;
  } FIFOCNT;
  __IM  uint32  RESERVED1[13];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000080) data FIFO register                                         */
    
    struct {
      __IOM uint32 FIFOData   : 32;           /*!< [31..0] Receive and transmit FIFO data                                    */
    } bit;
  } FIFO;
} SDMMC1_Type;                                  /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                          LPTIM1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Low power timer (LPTIM1)
  */

typedef struct {                                /*!< (@ 0x40002400) LPTIM1 Structure                                           */
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000000) Interrupt and Status Register                              */
    
