Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 CMPM       : 1;            /*!< [0..0] Compare match                                                      */
      __IM  uint32 ARRM       : 1;            /*!< [1..1] Autoreload match                                                   */
      __IM  uint32 EXTTRIG    : 1;            /*!< [2..2] External trigger edge event                                        */
      __IM  uint32 CMPOK      : 1;            /*!< [3..3] Compare register update OK                                         */
      __IM  uint32 ARROK      : 1;            /*!< [4..4] Autoreload register update OK                                      */
      __IM  uint32 UP         : 1;            /*!< [5..5] Counter direction change down to up                                */
      __IM  uint32 DOWN       : 1;            /*!< [6..6] Counter direction change up to down                                */
            uint32            : 25;
    } bit;
  } ISR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000004) Interrupt Clear Register                                   */
    
    struct {
      __OM  uint32 CMPMCF     : 1;            /*!< [0..0] compare match Clear Flag                                           */
      __OM  uint32 ARRMCF     : 1;            /*!< [1..1] Autoreload match Clear Flag                                        */
      __OM  uint32 EXTTRIGCF  : 1;            /*!< [2..2] External trigger valid edge Clear Flag                             */
      __OM  uint32 CMPOKCF    : 1;            /*!< [3..3] Compare register update OK Clear Flag                              */
      __OM  uint32 ARROKCF    : 1;            /*!< [4..4] Autoreload register update OK Clear Flag                           */
      __OM  uint32 UPCF       : 1;            /*!< [5..5] Direction change to UP Clear Flag                                  */
      __OM  uint32 DOWNCF     : 1;            /*!< [6..6] Direction change to down Clear Flag                                */
            uint32            : 25;
    } bit;
  } ICR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) Interrupt Enable Register                                  */
    
    struct {
      __IOM uint32 CMPMIE     : 1;            /*!< [0..0] Compare match Interrupt Enable                                     */
      __IOM uint32 ARRMIE     : 1;            /*!< [1..1] Autoreload match Interrupt Enable                                  */
      __IOM uint32 EXTTRIGIE  : 1;            /*!< [2..2] External trigger valid edge Interrupt Enable                       */
      __IOM uint32 CMPOKIE    : 1;            /*!< [3..3] Compare register update OK Interrupt Enable                        */
      __IOM uint32 ARROKIE    : 1;            /*!< [4..4] Autoreload register update OK Interrupt Enable                     */
      __IOM uint32 UPIE       : 1;            /*!< [5..5] Direction change to UP Interrupt Enable                            */
      __IOM uint32 DOWNIE     : 1;            /*!< [6..6] Direction change to down Interrupt Enable                          */
            uint32            : 25;
    } bit;
  } IER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) Configuration Register                                     */
    
    struct {
      __IOM uint32 CKSEL      : 1;            /*!< [0..0] Clock selector                                                     */
      __IOM uint32 CKPOL      : 2;            /*!< [2..1] Clock Polarity                                                     */
      __IOM uint32 CKFLT      : 2;            /*!< [4..3] Configurable digital filter for external clock                     */
            uint32            : 1;
      __IOM uint32 TRGFLT     : 2;            /*!< [7..6] Configurable digital filter for trigger                            */
            uint32            : 1;
      __IOM uint32 PRESC      : 3;            /*!< [11..9] Clock prescaler                                                   */
            uint32            : 1;
      __IOM uint32 TRIGSEL    : 3;            /*!< [15..13] Trigger selector                                                 */
            uint32            : 1;
      __IOM uint32 TRIGEN     : 2;            /*!< [18..17] Trigger enable and polarity                                      */
      __IOM uint32 TIMOUT     : 1;            /*!< [19..19] Timeout enable                                                   */
      __IOM uint32 WAVE       : 1;            /*!< [20..20] Waveform shape                                                   */
      __IOM uint32 WAVPOL     : 1;            /*!< [21..21] Waveform shape polarity                                          */
      __IOM uint32 PRELOAD    : 1;            /*!< [22..22] Registers update mode                                            */
      __IOM uint32 COUNTMODE  : 1;            /*!< [23..23] counter mode enabled                                             */
      __IOM uint32 ENC        : 1;            /*!< [24..24] Encoder mode enable                                              */
            uint32            : 7;
    } bit;
  } CFGR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Control Register                                           */
    
    struct {
      __IOM uint32 ENABLE     : 1;            /*!< [0..0] LPTIM Enable                                                       */
      __IOM uint32 SNGSTRT    : 1;            /*!< [1..1] LPTIM start in single mode                                         */
      __IOM uint32 CNTSTRT    : 1;            /*!< [2..2] Timer start in continuous mode                                     */
            uint32            : 29;
    } bit;
  } CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) Compare Register                                           */
    
    struct {
      __IOM uint32 CMP        : 16;           /*!< [15..0] Compare value                                                     */
            uint32            : 16;
    } bit;
  } CMP;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) Autoreload Register                                        */
    
