Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 ARR        : 16;           /*!< [15..0] Auto reload value                                                 */
            uint32            : 16;
    } bit;
  } ARR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000001C) Counter Register                                           */
    
    struct {
      __IM  uint32 CNT        : 16;           /*!< [15..0] Counter value                                                     */
            uint32            : 16;
    } bit;
  } CNT;
} LPTIM1_Type;                                  /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                           I2C1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter-integrated circuit (I2C1)
  */

typedef struct {                                /*!< (@ 0x40005400) I2C1 Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Control register 1                                         */
    
    struct {
      __IOM uint32 PE         : 1;            /*!< [0..0] Peripheral enable                                                  */
      __IOM uint32 TXIE       : 1;            /*!< [1..1] TX Interrupt enable                                                */
      __IOM uint32 RXIE       : 1;            /*!< [2..2] RX Interrupt enable                                                */
      __IOM uint32 ADDRIE     : 1;            /*!< [3..3] Address match interrupt enable (slave only)                        */
      __IOM uint32 NACKIE     : 1;            /*!< [4..4] Not acknowledge received interrupt enable                          */
      __IOM uint32 STOPIE     : 1;            /*!< [5..5] STOP detection Interrupt enable                                    */
      __IOM uint32 TCIE       : 1;            /*!< [6..6] Transfer Complete interrupt enable                                 */
      __IOM uint32 ERRIE      : 1;            /*!< [7..7] Error interrupts enable                                            */
      __IOM uint32 DNF        : 4;            /*!< [11..8] Digital noise filter                                              */
      __IOM uint32 ANFOFF     : 1;            /*!< [12..12] Analog noise filter OFF                                          */
            uint32            : 1;
      __IOM uint32 TXDMAEN    : 1;            /*!< [14..14] DMA transmission requests enable                                 */
      __IOM uint32 RXDMAEN    : 1;            /*!< [15..15] DMA reception requests enable                                    */
      __IOM uint32 SBC        : 1;            /*!< [16..16] Slave byte control                                               */
      __IOM uint32 NOSTRETCH  : 1;            /*!< [17..17] Clock stretching disable                                         */
      __IOM uint32 WUPEN      : 1;            /*!< [18..18] Wakeup from STOP enable                                          */
      __IOM uint32 GCEN       : 1;            /*!< [19..19] General call enable                                              */
      __IOM uint32 SMBHEN     : 1;            /*!< [20..20] SMBus Host address enable                                        */
      __IOM uint32 SMBDEN     : 1;            /*!< [21..21] SMBus Device Default address enable                              */
      __IOM uint32 ALERTEN    : 1;            /*!< [22..22] SMBUS alert enable                                               */
      __IOM uint32 PECEN      : 1;            /*!< [23..23] PEC enable                                                       */
            uint32            : 8;
    } bit;
  } CR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Control register 2                                         */
    
    struct {
      __IOM uint32 SADD       : 10;           /*!< [9..0] Slave address bit (master mode)                                    */
      __IOM uint32 RD_WRN     : 1;            /*!< [10..10] Transfer direction (master mode)                                 */
      __IOM uint32 ADD10      : 1;            /*!< [11..11] 10-bit addressing mode (master mode)                             */
      __IOM uint32 HEAD10R    : 1;            /*!< [12..12] 10-bit address header only read direction (master receiver
                                                     mode)                                                                     */
      __IOM uint32 START      : 1;            /*!< [13..13] Start generation                                                 */
      __IOM uint32 STOP       : 1;            /*!< [14..14] Stop generation (master mode)                                    */
      __IOM uint32 NACK       : 1;            /*!< [15..15] NACK generation (slave mode)                                     */
      __IOM uint32 NBYTES     : 8;            /*!< [23..16] Number of bytes                                                  */
      __IOM uint32 RELOAD     : 1;            /*!< [24..24] NBYTES reload mode                                               */
      __IOM uint32 AUTOEND    : 1;            /*!< [25..25] Automatic end mode (master mode)                                 */
      __IOM uint32 PECBYTE    : 1;            /*!< [26..26] Packet error checking byte                                       */
            uint32            : 5;
    } bit;
  } CR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) Own address register 1                                     */
    
    struct {
      __IOM uint32 OA1        : 10;           /*!< [9..0] Interface address                                                  */
      __IOM uint32 OA1MODE    : 1;            /*!< [10..10] Own Address 1 10-bit mode                                        */
            uint32            : 4;
      __IOM uint32 OA1EN      : 1;            /*!< [15..15] Own Address 1 enable                                             */
            uint32            : 16;
    } bit;
  } OAR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) Own address register 2                                     */
    
