Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
            uint32            : 1;
      __IOM uint32 OA2        : 7;            /*!< [7..1] Interface address                                                  */
      __IOM uint32 OA2MSK     : 3;            /*!< [10..8] Own Address 2 masks                                               */
            uint32            : 4;
      __IOM uint32 OA2EN      : 1;            /*!< [15..15] Own Address 2 enable                                             */
            uint32            : 16;
    } bit;
  } OAR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Timing register                                            */
    
    struct {
      __IOM uint32 SCLL       : 8;            /*!< [7..0] SCL low period (master mode)                                       */
      __IOM uint32 SCLH       : 8;            /*!< [15..8] SCL high period (master mode)                                     */
      __IOM uint32 SDADEL     : 4;            /*!< [19..16] Data hold time                                                   */
      __IOM uint32 SCLDEL     : 4;            /*!< [23..20] Data setup time                                                  */
            uint32            : 4;
      __IOM uint32 PRESC      : 4;            /*!< [31..28] Timing prescaler                                                 */
    } bit;
  } TIMINGR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) Status register 1                                          */
    
    struct {
      __IOM uint32 TIMEOUTA   : 12;           /*!< [11..0] Bus timeout A                                                     */
      __IOM uint32 TIDLE      : 1;            /*!< [12..12] Idle clock timeout detection                                     */
            uint32            : 2;
      __IOM uint32 TIMOUTEN   : 1;            /*!< [15..15] Clock timeout enable                                             */
      __IOM uint32 TIMEOUTB   : 12;           /*!< [27..16] Bus timeout B                                                    */
            uint32            : 3;
      __IOM uint32 TEXTEN     : 1;            /*!< [31..31] Extended clock timeout enable                                    */
    } bit;
  } TIMEOUTR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) Interrupt and Status register                              */
    
    struct {
      __IOM uint32 TXE        : 1;            /*!< [0..0] Transmit data register empty (transmitters)                        */
      __IOM uint32 TXIS       : 1;            /*!< [1..1] Transmit interrupt status (transmitters)                           */
      __IM  uint32 RXNE       : 1;            /*!< [2..2] Receive data register not empty (receivers)                        */
      __IM  uint32 ADDR       : 1;            /*!< [3..3] Address matched (slave mode)                                       */
      __IM  uint32 NACKF      : 1;            /*!< [4..4] Not acknowledge received flag                                      */
      __IM  uint32 STOPF      : 1;            /*!< [5..5] Stop detection flag                                                */
      __IM  uint32 TC         : 1;            /*!< [6..6] Transfer Complete (master mode)                                    */
      __IM  uint32 TCR        : 1;            /*!< [7..7] Transfer Complete Reload                                           */
      __IM  uint32 BERR       : 1;            /*!< [8..8] Bus error                                                          */
      __IM  uint32 ARLO       : 1;            /*!< [9..9] Arbitration lost                                                   */
      __IM  uint32 OVR        : 1;            /*!< [10..10] Overrun/Underrun (slave mode)                                    */
      __IM  uint32 PECERR     : 1;            /*!< [11..11] PEC Error in reception                                           */
      __IM  uint32 TIMEOUT    : 1;            /*!< [12..12] Timeout or t_low detection flag                                  */
      __IM  uint32 ALERT      : 1;            /*!< [13..13] SMBus alert                                                      */
            uint32            : 1;
      __IM  uint32 BUSY       : 1;            /*!< [15..15] Bus busy                                                         */
      __IM  uint32 DIR        : 1;            /*!< [16..16] Transfer direction (Slave mode)                                  */
      __IM  uint32 ADDCODE    : 7;            /*!< [23..17] Address match code (Slave mode)                                  */
            uint32            : 8;
    } bit;
  } ISR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x0000001C) Interrupt clear register                                   */
    
    struct {
            uint32            : 3;
      __OM  uint32 ADDRCF     : 1;            /*!< [3..3] Address Matched flag clear                                         */
      __OM  uint32 NACKCF     : 1;            /*!< [4..4] Not Acknowledge flag clear                                         */
      __OM  uint32 STOPCF     : 1;            /*!< [5..5] Stop detection flag clear                                          */
            uint32            : 2;
      __OM  uint32 BERRCF     : 1;            /*!< [8..8] Bus error flag clear                                               */
      __OM  uint32 ARLOCF     : 1;            /*!< [9..9] Arbitration lost flag clear                                        */
      __OM  uint32 OVRCF      : 1;            /*!< [10..10] Overrun/Underrun flag clear                                      */
      __OM  uint32 PECCF      : 1;            /*!< [11..11] PEC Error flag clear                                             */
      __OM  uint32 TIMOUTCF   : 1;            /*!< [12..12] Timeout detection flag clear                                     */
      __OM  uint32 ALERTCF    : 1;            /*!< [13..13] Alert flag clear                                                 */
            uint32            : 18;
    } bit;
  } ICR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000020) PEC register                                               */
    
