Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 PEC        : 8;            /*!< [7..0] Packet error checking register                                     */
            uint32            : 24;
    } bit;
  } PECR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000024) Receive data register                                      */
    
    struct {
      __IM  uint32 RXDATA     : 8;            /*!< [7..0] 8-bit receive data                                                 */
            uint32            : 24;
    } bit;
  } RXDR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) Transmit data register                                     */
    
    struct {
      __IOM uint32 TXDATA     : 8;            /*!< [7..0] 8-bit transmit data                                                */
            uint32            : 24;
    } bit;
  } TXDR;
} I2C1_Type;                                    /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

typedef struct {                                /*!< (@ 0x40002800) RTC Structure                                              */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) time register                                              */
    
    struct {
      __IOM uint32 SU         : 4;            /*!< [3..0] Second units in BCD format                                         */
      __IOM uint32 ST         : 3;            /*!< [6..4] Second tens in BCD format                                          */
            uint32            : 1;
      __IOM uint32 MNU        : 4;            /*!< [11..8] Minute units in BCD format                                        */
      __IOM uint32 MNT        : 3;            /*!< [14..12] Minute tens in BCD format                                        */
            uint32            : 1;
      __IOM uint32 HU         : 4;            /*!< [19..16] Hour units in BCD format                                         */
      __IOM uint32 HT         : 2;            /*!< [21..20] Hour tens in BCD format                                          */
      __IOM uint32 PM         : 1;            /*!< [22..22] AM/PM notation                                                   */
            uint32            : 9;
    } bit;
  } TR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) date register                                              */
    
    struct {
      __IOM uint32 DU         : 4;            /*!< [3..0] Date units in BCD format                                           */
      __IOM uint32 DT         : 2;            /*!< [5..4] Date tens in BCD format                                            */
            uint32            : 2;
      __IOM uint32 MU         : 4;            /*!< [11..8] Month units in BCD format                                         */
      __IOM uint32 MT         : 1;            /*!< [12..12] Month tens in BCD format                                         */
      __IOM uint32 WDU        : 3;            /*!< [15..13] Week day units                                                   */
      __IOM uint32 YU         : 4;            /*!< [19..16] Year units in BCD format                                         */
      __IOM uint32 YT         : 4;            /*!< [23..20] Year tens in BCD format                                          */
            uint32            : 8;
    } bit;
  } DR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) control register                                           */
    
    struct {
      __IOM uint32 WCKSEL     : 3;            /*!< [2..0] Wakeup clock selection                                             */
      __IOM uint32 TSEDGE     : 1;            /*!< [3..3] Time-stamp event active edge                                       */
      __IOM uint32 REFCKON    : 1;            /*!< [4..4] Reference clock detection enable (50 or 60 Hz)                     */
      __IOM uint32 BYPSHAD    : 1;            /*!< [5..5] Bypass the shadow registers                                        */
      __IOM uint32 FMT        : 1;            /*!< [6..6] Hour format                                                        */
            uint32            : 1;
      __IOM uint32 ALRAE      : 1;            /*!< [8..8] Alarm A enable                                                     */
      __IOM uint32 ALRBE      : 1;            /*!< [9..9] Alarm B enable                                                     */
      __IOM uint32 WUTE       : 1;            /*!< [10..10] Wakeup timer enable                                              */
      __IOM uint32 TSE        : 1;            /*!< [11..11] Time stamp enable                                                */
      __IOM uint32 ALRAIE     : 1;            /*!< [12..12] Alarm A interrupt enable                                         */
      __IOM uint32 ALRBIE     : 1;            /*!< [13..13] Alarm B interrupt enable                                         */
      __IOM uint32 WUTIE      : 1;            /*!< [14..14] Wakeup timer interrupt enable                                    */
      __IOM uint32 TSIE       : 1;            /*!< [15..15] Time-stamp interrupt enable                                      */
      __IOM uint32 ADD1H      : 1;            /*!< [16..16] Add 1 hour (summer time change)                                  */
      __IOM uint32 SUB1H      : 1;            /*!< [17..17] Subtract 1 hour (winter time change)                             */
      __IOM uint32 BKP        : 1;            /*!< [18..18] Backup                                                           */
      __IOM uint32 COSEL      : 1;            /*!< [19..19] Calibration output selection                                     */
      __IOM uint32 POL        : 1;            /*!< [20..20] Output polarity                                                  */
      __IOM uint32 OSEL       : 2;            /*!< [22..21] Output selection                                                 */
      __IOM uint32 COE        : 1;            /*!< [23..23] Calibration output enable                                        */
      __IOM uint32 ITSE       : 1;            /*!< [24..24] timestamp on internal event enable                               */
            uint32            : 7;
    } bit;
  } CR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) initialization and status register                         */
    
