Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 ALRAWF     : 1;            /*!< [0..0] Alarm A write flag                                                 */
      __IM  uint32 ALRBWF     : 1;            /*!< [1..1] Alarm B write flag                                                 */
      __IM  uint32 WUTWF      : 1;            /*!< [2..2] Wakeup timer write flag                                            */
      __IOM uint32 SHPF       : 1;            /*!< [3..3] Shift operation pending                                            */
      __IM  uint32 INITS      : 1;            /*!< [4..4] Initialization status flag                                         */
      __IOM uint32 RSF        : 1;            /*!< [5..5] Registers synchronization flag                                     */
      __IM  uint32 INITF      : 1;            /*!< [6..6] Initialization flag                                                */
      __IOM uint32 INIT       : 1;            /*!< [7..7] Initialization mode                                                */
      __IOM uint32 ALRAF      : 1;            /*!< [8..8] Alarm A flag                                                       */
      __IOM uint32 ALRBF      : 1;            /*!< [9..9] Alarm B flag                                                       */
      __IOM uint32 WUTF       : 1;            /*!< [10..10] Wakeup timer flag                                                */
      __IOM uint32 TSF        : 1;            /*!< [11..11] Time-stamp flag                                                  */
      __IOM uint32 TSOVF      : 1;            /*!< [12..12] Time-stamp overflow flag                                         */
      __IOM uint32 TAMP1F     : 1;            /*!< [13..13] Tamper detection flag                                            */
      __IOM uint32 TAMP2F     : 1;            /*!< [14..14] RTC_TAMP2 detection flag                                         */
      __IOM uint32 TAMP3F     : 1;            /*!< [15..15] RTC_TAMP3 detection flag                                         */
      __IM  uint32 RECALPF    : 1;            /*!< [16..16] Recalibration pending Flag                                       */
            uint32            : 15;
    } bit;
  } ISR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) prescaler register                                         */
    
    struct {
      __IOM uint32 PREDIV_S   : 15;           /*!< [14..0] Synchronous prescaler factor                                      */
            uint32            : 1;
      __IOM uint32 PREDIV_A   : 7;            /*!< [22..16] Asynchronous prescaler factor                                    */
            uint32            : 9;
    } bit;
  } PRER;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) wakeup timer register                                      */
    
    struct {
      __IOM uint32 WUT        : 16;           /*!< [15..0] Wakeup auto-reload value bits                                     */
            uint32            : 16;
    } bit;
  } WUTR;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) alarm A register                                           */
    
    struct {
      __IOM uint32 SU         : 4;            /*!< [3..0] Second units in BCD format                                         */
      __IOM uint32 ST         : 3;            /*!< [6..4] Second tens in BCD format                                          */
      __IOM uint32 MSK1       : 1;            /*!< [7..7] Alarm A seconds mask                                               */
      __IOM uint32 MNU        : 4;            /*!< [11..8] Minute units in BCD format                                        */
      __IOM uint32 MNT        : 3;            /*!< [14..12] Minute tens in BCD format                                        */
      __IOM uint32 MSK2       : 1;            /*!< [15..15] Alarm A minutes mask                                             */
      __IOM uint32 HU         : 4;            /*!< [19..16] Hour units in BCD format                                         */
      __IOM uint32 HT         : 2;            /*!< [21..20] Hour tens in BCD format                                          */
      __IOM uint32 PM         : 1;            /*!< [22..22] AM/PM notation                                                   */
      __IOM uint32 MSK3       : 1;            /*!< [23..23] Alarm A hours mask                                               */
      __IOM uint32 DU         : 4;            /*!< [27..24] Date units or day in BCD format                                  */
      __IOM uint32 DT         : 2;            /*!< [29..28] Date tens in BCD format                                          */
      __IOM uint32 WDSEL      : 1;            /*!< [30..30] Week day selection                                               */
      __IOM uint32 MSK4       : 1;            /*!< [31..31] Alarm A date mask                                                */
    } bit;
  } ALRMAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) alarm B register                                           */
    
    struct {
      __IOM uint32 SU         : 4;            /*!< [3..0] Second units in BCD format                                         */
      __IOM uint32 ST         : 3;            /*!< [6..4] Second tens in BCD format                                          */
      __IOM uint32 MSK1       : 1;            /*!< [7..7] Alarm B seconds mask                                               */
      __IOM uint32 MNU        : 4;            /*!< [11..8] Minute units in BCD format                                        */
      __IOM uint32 MNT        : 3;            /*!< [14..12] Minute tens in BCD format                                        */
      __IOM uint32 MSK2       : 1;            /*!< [15..15] Alarm B minutes mask                                             */
      __IOM uint32 HU         : 4;            /*!< [19..16] Hour units in BCD format                                         */
      __IOM uint32 HT         : 2;            /*!< [21..20] Hour tens in BCD format                                          */
      __IOM uint32 PM         : 1;            /*!< [22..22] AM/PM notation                                                   */
      __IOM uint32 MSK3       : 1;            /*!< [23..23] Alarm B hours mask                                               */
      __IOM uint32 DU         : 4;            /*!< [27..24] Date units or day in BCD format                                  */
      __IOM uint32 DT         : 2;            /*!< [29..28] Date tens in BCD format                                          */
      __IOM uint32 WDSEL      : 1;            /*!< [30..30] Week day selection                                               */
      __IOM uint32 MSK4       : 1;            /*!< [31..31] Alarm B date mask                                                */
    } bit;
  } ALRMBR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000024) write protection register                                  */
    
