Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __OM  uint32 KEY        : 8;            /*!< [7..0] Write protection key                                               */
            uint32            : 24;
    } bit;
  } WPR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000028) sub second register                                        */
    
    struct {
      __IM  uint32 SS         : 16;           /*!< [15..0] Sub second value                                                  */
            uint32            : 16;
    } bit;
  } SSR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x0000002C) shift control register                                     */
    
    struct {
      __OM  uint32 SUBFS      : 15;           /*!< [14..0] Subtract a fraction of a second                                   */
            uint32            : 16;
      __OM  uint32 ADD1S      : 1;            /*!< [31..31] Add one second                                                   */
    } bit;
  } SHIFTR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000030) time stamp time register                                   */
    
    struct {
      __IM  uint32 SU         : 4;            /*!< [3..0] Second units in BCD format                                         */
      __IM  uint32 ST         : 3;            /*!< [6..4] Second tens in BCD format                                          */
            uint32            : 1;
      __IM  uint32 MNU        : 4;            /*!< [11..8] Minute units in BCD format                                        */
      __IM  uint32 MNT        : 3;            /*!< [14..12] Minute tens in BCD format                                        */
            uint32            : 1;
      __IM  uint32 HU         : 4;            /*!< [19..16] Hour units in BCD format                                         */
      __IM  uint32 HT         : 2;            /*!< [21..20] Hour tens in BCD format                                          */
      __IM  uint32 PM         : 1;            /*!< [22..22] AM/PM notation                                                   */
            uint32            : 9;
    } bit;
  } TSTR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000034) time stamp date register                                   */
    
    struct {
      __IM  uint32 DU         : 4;            /*!< [3..0] Date units in BCD format                                           */
      __IM  uint32 DT         : 2;            /*!< [5..4] Date tens in BCD format                                            */
            uint32            : 2;
      __IM  uint32 MU         : 4;            /*!< [11..8] Month units in BCD format                                         */
      __IM  uint32 MT         : 1;            /*!< [12..12] Month tens in BCD format                                         */
      __IM  uint32 WDU        : 3;            /*!< [15..13] Week day units                                                   */
            uint32            : 16;
    } bit;
  } TSDR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000038) timestamp sub second register                              */
    
    struct {
      __IM  uint32 SS         : 16;           /*!< [15..0] Sub second value                                                  */
            uint32            : 16;
    } bit;
  } TSSSR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000003C) calibration register                                       */
    
    struct {
      __IOM uint32 CALM       : 9;            /*!< [8..0] Calibration minus                                                  */
            uint32            : 4;
      __IOM uint32 CALW16     : 1;            /*!< [13..13] Use a 16-second calibration cycle period                         */
      __IOM uint32 CALW8      : 1;            /*!< [14..14] Use an 8-second calibration cycle period                         */
      __IOM uint32 CALP       : 1;            /*!< [15..15] Increase frequency of RTC by 488.5 ppm                           */
            uint32            : 16;
    } bit;
  } CALR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000040) tamper configuration register                              */
    
    struct {
      __IOM uint32 TAMP1E     : 1;            /*!< [0..0] Tamper 1 detection enable                                          */
      __IOM uint32 TAMP1TRG   : 1;            /*!< [1..1] Active level for tamper 1                                          */
      __IOM uint32 TAMPIE     : 1;            /*!< [2..2] Tamper interrupt enable                                            */
      __IOM uint32 TAMP2E     : 1;            /*!< [3..3] Tamper 2 detection enable                                          */
      __IOM uint32 TAMP2TRG   : 1;            /*!< [4..4] Active level for tamper 2                                          */
      __IOM uint32 TAMP3E     : 1;            /*!< [5..5] Tamper 3 detection enable                                          */
      __IOM uint32 TAMP3TRG   : 1;            /*!< [6..6] Active level for tamper 3                                          */
      __IOM uint32 TAMPTS     : 1;            /*!< [7..7] Activate timestamp on tamper detection event                       */
      __IOM uint32 TAMPFREQ   : 3;            /*!< [10..8] Tamper sampling frequency                                         */
      __IOM uint32 TAMPFLT    : 2;            /*!< [12..11] Tamper filter count                                              */
      __IOM uint32 TAMPPRCH   : 2;            /*!< [14..13] Tamper precharge duration                                        */
      __IOM uint32 TAMPPUDIS  : 1;            /*!< [15..15] TAMPER pull-up disable                                           */
      __IOM uint32 TAMP1IE    : 1;            /*!< [16..16] Tamper 1 interrupt enable                                        */
      __IOM uint32 TAMP1NOERASE : 1;          /*!< [17..17] Tamper 1 no erase                                                */
      __IOM uint32 TAMP1MF    : 1;            /*!< [18..18] Tamper 1 mask flag                                               */
      __IOM uint32 TAMP2IE    : 1;            /*!< [19..19] Tamper 2 interrupt enable                                        */
      __IOM uint32 TAMP2NOERASE : 1;          /*!< [20..20] Tamper 2 no erase                                                */
      __IOM uint32 TAMP2MF    : 1;            /*!< [21..21] Tamper 2 mask flag                                               */
      __IOM uint32 TAMP3IE    : 1;            /*!< [22..22] Tamper 3 interrupt enable                                        */
      __IOM uint32 TAMP3NOERASE : 1;          /*!< [23..23] Tamper 3 no erase                                                */
      __IOM uint32 TAMP3MF    : 1;            /*!< [24..24] Tamper 3 mask flag                                               */
            uint32            : 7;
    } bit;
  } TAMPCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000044) alarm A sub second register                                */
    
