Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 SS         : 15;           /*!< [14..0] Sub seconds value                                                 */
            uint32            : 9;
      __IOM uint32 MASKSS     : 4;            /*!< [27..24] Mask the most-significant bits starting at this bit              */
            uint32            : 4;
    } bit;
  } ALRMASSR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000048) alarm B sub second register                                */
    
    struct {
      __IOM uint32 SS         : 15;           /*!< [14..0] Sub seconds value                                                 */
            uint32            : 9;
      __IOM uint32 MASKSS     : 4;            /*!< [27..24] Mask the most-significant bits starting at this bit              */
            uint32            : 4;
    } bit;
  } ALRMBSSR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000004C) option register                                            */
    
    struct {
      __IOM uint32 RTC_ALARM_TYPE : 1;        /*!< [0..0] RTC_ALARM on PC13 output type                                      */
      __IOM uint32 RTC_OUT_RMP : 1;           /*!< [1..1] RTC_OUT remap                                                      */
            uint32            : 30;
    } bit;
  } OR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000050) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP0R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000054) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP1R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000058) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP2R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000005C) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP3R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000060) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP4R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000064) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP5R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000068) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP6R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000006C) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP7R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000070) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP8R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000074) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP9R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000078) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP10R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000007C) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP11R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000080) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP12R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000084) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP13R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000088) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP14R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000008C) backup register                                            */
    
