Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP15R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000090) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP16R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000094) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP17R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000098) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP18R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000009C) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP19R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000A0) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP20R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000A4) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP21R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000A8) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP22R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000AC) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP23R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000B0) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP24R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000B4) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP25R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000B8) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP26R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000BC) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP27R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000C0) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP28R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000C4) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP29R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000C8) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP30R;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000000CC) backup register                                            */
    
    struct {
      __IOM uint32 BKP        : 32;           /*!< [31..0] BKP                                                               */
    } bit;
  } BKP31R;
} RTC_Type;                                     /*!< Size = 208 (0xd0)                                                         */



/* =========================================================================================================================== */
/* ================                                          USART6                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver       transmitter (USART6)
  */

typedef struct {                                /*!< (@ 0x40011400) USART6 Structure                                           */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Control register 1                                         */
    
