Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 UE         : 1;            /*!< [0..0] USART enable                                                       */
      __IOM uint32 UESM       : 1;            /*!< [1..1] USART enable in Stop mode                                          */
      __IOM uint32 RE         : 1;            /*!< [2..2] Receiver enable                                                    */
      __IOM uint32 TE         : 1;            /*!< [3..3] Transmitter enable                                                 */
      __IOM uint32 IDLEIE     : 1;            /*!< [4..4] IDLE interrupt enable                                              */
      __IOM uint32 RXNEIE     : 1;            /*!< [5..5] RXNE interrupt enable                                              */
      __IOM uint32 TCIE       : 1;            /*!< [6..6] Transmission complete interrupt enable                             */
      __IOM uint32 TXEIE      : 1;            /*!< [7..7] interrupt enable                                                   */
      __IOM uint32 PEIE       : 1;            /*!< [8..8] PE interrupt enable                                                */
      __IOM uint32 PS         : 1;            /*!< [9..9] Parity selection                                                   */
      __IOM uint32 PCE        : 1;            /*!< [10..10] Parity control enable                                            */
      __IOM uint32 WAKE       : 1;            /*!< [11..11] Receiver wakeup method                                           */
      __IOM uint32 M0         : 1;            /*!< [12..12] Word length                                                      */
      __IOM uint32 MME        : 1;            /*!< [13..13] Mute mode enable                                                 */
      __IOM uint32 CMIE       : 1;            /*!< [14..14] Character match interrupt enable                                 */
      __IOM uint32 OVER8      : 1;            /*!< [15..15] Oversampling mode                                                */
      __IOM uint32 DEDT0      : 1;            /*!< [16..16] DEDT0                                                            */
      __IOM uint32 DEDT1      : 1;            /*!< [17..17] DEDT1                                                            */
      __IOM uint32 DEDT2      : 1;            /*!< [18..18] DEDT2                                                            */
      __IOM uint32 DEDT3      : 1;            /*!< [19..19] DEDT3                                                            */
      __IOM uint32 DEDT4      : 1;            /*!< [20..20] Driver Enable de-assertion time                                  */
      __IOM uint32 DEAT0      : 1;            /*!< [21..21] DEAT0                                                            */
      __IOM uint32 DEAT1      : 1;            /*!< [22..22] DEAT1                                                            */
      __IOM uint32 DEAT2      : 1;            /*!< [23..23] DEAT2                                                            */
      __IOM uint32 DEAT3      : 1;            /*!< [24..24] DEAT3                                                            */
      __IOM uint32 DEAT4      : 1;            /*!< [25..25] Driver Enable assertion time                                     */
      __IOM uint32 RTOIE      : 1;            /*!< [26..26] Receiver timeout interrupt enable                                */
      __IOM uint32 EOBIE      : 1;            /*!< [27..27] End of Block interrupt enable                                    */
      __IOM uint32 M1         : 1;            /*!< [28..28] Word length                                                      */
            uint32            : 3;
    } bit;
  } CR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Control register 2                                         */
    
    struct {
            uint32            : 4;
      __IOM uint32 ADDM7      : 1;            /*!< [4..4] 7-bit Address Detection/4-bit Address Detection                    */
      __IOM uint32 LBDL       : 1;            /*!< [5..5] LIN break detection length                                         */
      __IOM uint32 LBDIE      : 1;            /*!< [6..6] LIN break detection interrupt enable                               */
            uint32            : 1;
      __IOM uint32 LBCL       : 1;            /*!< [8..8] Last bit clock pulse                                               */
      __IOM uint32 CPHA       : 1;            /*!< [9..9] Clock phase                                                        */
      __IOM uint32 CPOL       : 1;            /*!< [10..10] Clock polarity                                                   */
      __IOM uint32 CLKEN      : 1;            /*!< [11..11] Clock enable                                                     */
      __IOM uint32 STOP       : 2;            /*!< [13..12] STOP bits                                                        */
      __IOM uint32 LINEN      : 1;            /*!< [14..14] LIN mode enable                                                  */
      __IOM uint32 SWAP       : 1;            /*!< [15..15] Swap TX/RX pins                                                  */
      __IOM uint32 RXINV      : 1;            /*!< [16..16] RX pin active level inversion                                    */
      __IOM uint32 TXINV      : 1;            /*!< [17..17] TX pin active level inversion                                    */
      __IOM uint32 TAINV      : 1;            /*!< [18..18] Binary data inversion                                            */
      __IOM uint32 MSBFIRST   : 1;            /*!< [19..19] Most significant bit first                                       */
      __IOM uint32 ABREN      : 1;            /*!< [20..20] Auto baud rate enable                                            */
      __IOM uint32 ABRMOD0    : 1;            /*!< [21..21] ABRMOD0                                                          */
      __IOM uint32 ABRMOD1    : 1;            /*!< [22..22] Auto baud rate mode                                              */
      __IOM uint32 RTOEN      : 1;            /*!< [23..23] Receiver timeout enable                                          */
      __IOM uint32 ADD0_3     : 4;            /*!< [27..24] Address of the USART node                                        */
      __IOM uint32 ADD4_7     : 4;            /*!< [31..28] Address of the USART node                                        */
    } bit;
  } CR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) Control register 3                                         */
    
