Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 EIE        : 1;            /*!< [0..0] Error interrupt enable                                             */
      __IOM uint32 IREN       : 1;            /*!< [1..1] Ir mode enable                                                     */
      __IOM uint32 IRLP       : 1;            /*!< [2..2] Ir low-power                                                       */
      __IOM uint32 HDSEL      : 1;            /*!< [3..3] Half-duplex selection                                              */
      __IOM uint32 NACK       : 1;            /*!< [4..4] Smartcard NACK enable                                              */
      __IOM uint32 SCEN       : 1;            /*!< [5..5] Smartcard mode enable                                              */
      __IOM uint32 DMAR       : 1;            /*!< [6..6] DMA enable receiver                                                */
      __IOM uint32 DMAT       : 1;            /*!< [7..7] DMA enable transmitter                                             */
      __IOM uint32 RTSE       : 1;            /*!< [8..8] RTS enable                                                         */
      __IOM uint32 CTSE       : 1;            /*!< [9..9] CTS enable                                                         */
      __IOM uint32 CTSIE      : 1;            /*!< [10..10] CTS interrupt enable                                             */
      __IOM uint32 ONEBIT     : 1;            /*!< [11..11] One sample bit method enable                                     */
      __IOM uint32 OVRDIS     : 1;            /*!< [12..12] Overrun Disable                                                  */
      __IOM uint32 DDRE       : 1;            /*!< [13..13] DMA Disable on Reception Error                                   */
      __IOM uint32 DEM        : 1;            /*!< [14..14] Driver enable mode                                               */
      __IOM uint32 DEP        : 1;            /*!< [15..15] Driver enable polarity selection                                 */
            uint32            : 1;
      __IOM uint32 SCARCNT    : 3;            /*!< [19..17] Smartcard auto-retry count                                       */
      __IOM uint32 WUS        : 2;            /*!< [21..20] Wakeup from Stop mode interrupt flag selection                   */
      __IOM uint32 WUFIE      : 1;            /*!< [22..22] Wakeup from Stop mode interrupt enable                           */
            uint32            : 9;
    } bit;
  } CR3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) Baud rate register                                         */
    
    struct {
      __IOM uint32 DIV_Fraction : 4;          /*!< [3..0] DIV_Fraction                                                       */
      __IOM uint32 DIV_Mantissa : 12;         /*!< [15..4] DIV_Mantissa                                                      */
            uint32            : 16;
    } bit;
  } BRR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) Guard time and prescaler register                          */
    
    struct {
      __IOM uint32 PSC        : 8;            /*!< [7..0] Prescaler value                                                    */
      __IOM uint32 GT         : 8;            /*!< [15..8] Guard time value                                                  */
            uint32            : 16;
    } bit;
  } GTPR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) Receiver timeout register                                  */
    
    struct {
      __IOM uint32 RTO        : 24;           /*!< [23..0] Receiver timeout value                                            */
      __IOM uint32 BLEN       : 8;            /*!< [31..24] Block Length                                                     */
    } bit;
  } RTOR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000018) Request register                                           */
    
    struct {
      __OM  uint32 ABRRQ      : 1;            /*!< [0..0] Auto baud rate request                                             */
      __OM  uint32 SBKRQ      : 1;            /*!< [1..1] Send break request                                                 */
      __OM  uint32 MMRQ       : 1;            /*!< [2..2] Mute mode request                                                  */
      __OM  uint32 RXFRQ      : 1;            /*!< [3..3] Receive data flush request                                         */
      __OM  uint32 TXFRQ      : 1;            /*!< [4..4] Transmit data flush request                                        */
            uint32            : 27;
    } bit;
  } RQR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000001C) Interrupt & status register                                */
    
    struct {
      __IM  uint32 PE         : 1;            /*!< [0..0] PE                                                                 */
      __IM  uint32 FE         : 1;            /*!< [1..1] FE                                                                 */
      __IM  uint32 NF         : 1;            /*!< [2..2] NF                                                                 */
      __IM  uint32 ORE        : 1;            /*!< [3..3] ORE                                                                */
      __IM  uint32 IDLE       : 1;            /*!< [4..4] IDLE                                                               */
      __IM  uint32 RXNE       : 1;            /*!< [5..5] RXNE                                                               */
      __IM  uint32 TC         : 1;            /*!< [6..6] TC                                                                 */
      __IM  uint32 TXE        : 1;            /*!< [7..7] TXE                                                                */
      __IM  uint32 LBDF       : 1;            /*!< [8..8] LBDF                                                               */
      __IM  uint32 CTSIF      : 1;            /*!< [9..9] CTSIF                                                              */
      __IM  uint32 CTS        : 1;            /*!< [10..10] CTS                                                              */
      __IM  uint32 RTOF       : 1;            /*!< [11..11] RTOF                                                             */
      __IM  uint32 EOBF       : 1;            /*!< [12..12] EOBF                                                             */
            uint32            : 1;
      __IM  uint32 ABRE       : 1;            /*!< [14..14] ABRE                                                             */
      __IM  uint32 ABRF       : 1;            /*!< [15..15] ABRF                                                             */
      __IM  uint32 BUSY       : 1;            /*!< [16..16] BUSY                                                             */
      __IM  uint32 CMF        : 1;            /*!< [17..17] CMF                                                              */
      __IM  uint32 SBKF       : 1;            /*!< [18..18] SBKF                                                             */
      __IM  uint32 RWU        : 1;            /*!< [19..19] RWU                                                              */
      __IM  uint32 WUF        : 1;            /*!< [20..20] WUF                                                              */
      __IM  uint32 TEACK      : 1;            /*!< [21..21] TEACK                                                            */
      __IM  uint32 REACK      : 1;            /*!< [22..22] REACK                                                            */
            uint32            : 9;
    } bit;
  } ISR;
  
  union {
    __OM  uint32 reg;                         /*!< (@ 0x00000020) Interrupt flag clear register                              */
    
