Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __OM  uint32 PECF       : 1;            /*!< [0..0] Parity error clear flag                                            */
      __OM  uint32 FECF       : 1;            /*!< [1..1] Framing error clear flag                                           */
      __OM  uint32 NCF        : 1;            /*!< [2..2] Noise detected clear flag                                          */
      __OM  uint32 ORECF      : 1;            /*!< [3..3] Overrun error clear flag                                           */
      __OM  uint32 IDLECF     : 1;            /*!< [4..4] Idle line detected clear flag                                      */
            uint32            : 1;
      __OM  uint32 TCCF       : 1;            /*!< [6..6] Transmission complete clear flag                                   */
            uint32            : 1;
      __OM  uint32 LBDCF      : 1;            /*!< [8..8] LIN break detection clear flag                                     */
      __OM  uint32 CTSCF      : 1;            /*!< [9..9] CTS clear flag                                                     */
            uint32            : 1;
      __OM  uint32 RTOCF      : 1;            /*!< [11..11] Receiver timeout clear flag                                      */
      __OM  uint32 EOBCF      : 1;            /*!< [12..12] End of block clear flag                                          */
            uint32            : 4;
      __OM  uint32 CMCF       : 1;            /*!< [17..17] Character match clear flag                                       */
            uint32            : 2;
      __OM  uint32 WUCF       : 1;            /*!< [20..20] Wakeup from Stop mode clear flag                                 */
            uint32            : 11;
    } bit;
  } ICR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000024) Receive data register                                      */
    
    struct {
      __IM  uint32 RDR        : 9;            /*!< [8..0] Receive data value                                                 */
            uint32            : 23;
    } bit;
  } RDR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) Transmit data register                                     */
    
    struct {
      __IOM uint32 TDR        : 9;            /*!< [8..0] Transmit data value                                                */
            uint32            : 23;
    } bit;
  } TDR;
} USART6_Type;                                  /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                       OTG_FS_GLOBAL                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go full speed (OTG_FS_GLOBAL)
  */

typedef struct {                                /*!< (@ 0x50000000) OTG_FS_GLOBAL Structure                                    */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) OTG_FS control and status register (OTG_FS_GOTGCTL)        */
    
    struct {
      __IM  uint32 SRQSCS     : 1;            /*!< [0..0] Session request success                                            */
      __IOM uint32 SRQ        : 1;            /*!< [1..1] Session request                                                    */
      __IOM uint32 VBVALOEN   : 1;            /*!< [2..2] VBUS valid override enable                                         */
      __IOM uint32 VBVALOVAL  : 1;            /*!< [3..3] VBUS valid override value                                          */
      __IOM uint32 AVALOEN    : 1;            /*!< [4..4] A-peripheral session valid override enable                         */
      __IOM uint32 AVALOVAL   : 1;            /*!< [5..5] A-peripheral session valid override value                          */
      __IOM uint32 BVALOEN    : 1;            /*!< [6..6] B-peripheral session valid override enable                         */
      __IOM uint32 BVALOVAL   : 1;            /*!< [7..7] B-peripheral session valid override value                          */
      __IM  uint32 HNGSCS     : 1;            /*!< [8..8] Host negotiation success                                           */
      __IOM uint32 HNPRQ      : 1;            /*!< [9..9] HNP request                                                        */
      __IOM uint32 HSHNPEN    : 1;            /*!< [10..10] Host set HNP enable                                              */
      __IOM uint32 DHNPEN     : 1;            /*!< [11..11] Device HNP enabled                                               */
      __IOM uint32 EHEN       : 1;            /*!< [12..12] Embedded host enable                                             */
            uint32            : 3;
      __IM  uint32 CIDSTS     : 1;            /*!< [16..16] Connector ID status                                              */
      __IM  uint32 DBCT       : 1;            /*!< [17..17] Long/short debounce time                                         */
      __IM  uint32 ASVLD      : 1;            /*!< [18..18] A-session valid                                                  */
      __IM  uint32 BSVLD      : 1;            /*!< [19..19] B-session valid                                                  */
      __IOM uint32 OTGVER     : 1;            /*!< [20..20] OTG version                                                      */
            uint32            : 11;
    } bit;
  } OTG_FS_GOTGCTL;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) OTG_FS interrupt register (OTG_FS_GOTGINT)                 */
    
    struct {
            uint32            : 2;
      __IOM uint32 SEDET      : 1;            /*!< [2..2] Session end detected                                               */
            uint32            : 5;
      __IOM uint32 SRSSCHG    : 1;            /*!< [8..8] Session request success status change                              */
      __IOM uint32 HNSSCHG    : 1;            /*!< [9..9] Host negotiation success status change                             */
            uint32            : 7;
      __IOM uint32 HNGDET     : 1;            /*!< [17..17] Host negotiation detected                                        */
      __IOM uint32 ADTOCHG    : 1;            /*!< [18..18] A-device timeout change                                          */
      __IOM uint32 DBCDNE     : 1;            /*!< [19..19] Debounce done                                                    */
      __IOM uint32 IDCHNG     : 1;            /*!< [20..20] ID input pin changed                                             */
            uint32            : 11;
    } bit;
  } OTG_FS_GOTGINT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) OTG_FS AHB configuration register (OTG_FS_GAHBCFG)         */
    
