Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 GINT       : 1;            /*!< [0..0] Global interrupt mask                                              */
            uint32            : 6;
      __IOM uint32 TXFELVL    : 1;            /*!< [7..7] TxFIFO empty level                                                 */
      __IOM uint32 PTXFELVL   : 1;            /*!< [8..8] Periodic TxFIFO empty level                                        */
            uint32            : 23;
    } bit;
  } OTG_FS_GAHBCFG;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) OTG_FS USB configuration register (OTG_FS_GUSBCFG)         */
    
    struct {
      __IOM uint32 TOCAL      : 3;            /*!< [2..0] FS timeout calibration                                             */
            uint32            : 3;
      __OM  uint32 PHYSEL     : 1;            /*!< [6..6] Full Speed serial transceiver select                               */
            uint32            : 1;
      __IOM uint32 SRPCAP     : 1;            /*!< [8..8] SRP-capable                                                        */
      __IOM uint32 HNPCAP     : 1;            /*!< [9..9] HNP-capable                                                        */
      __IOM uint32 TRDT       : 4;            /*!< [13..10] USB turnaround time                                              */
            uint32            : 15;
      __IOM uint32 FHMOD      : 1;            /*!< [29..29] Force host mode                                                  */
      __IOM uint32 FDMOD      : 1;            /*!< [30..30] Force device mode                                                */
            uint32            : 1;
    } bit;
  } OTG_FS_GUSBCFG;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) OTG_FS reset register (OTG_FS_GRSTCTL)                     */
    
    struct {
      __IOM uint32 CSRST      : 1;            /*!< [0..0] Core soft reset                                                    */
      __IOM uint32 HSRST      : 1;            /*!< [1..1] HCLK soft reset                                                    */
      __IOM uint32 FCRST      : 1;            /*!< [2..2] Host frame counter reset                                           */
            uint32            : 1;
      __IOM uint32 RXFFLSH    : 1;            /*!< [4..4] RxFIFO flush                                                       */
      __IOM uint32 TXFFLSH    : 1;            /*!< [5..5] TxFIFO flush                                                       */
      __IOM uint32 TXFNUM     : 5;            /*!< [10..6] TxFIFO number                                                     */
            uint32            : 20;
      __IM  uint32 AHBIDL     : 1;            /*!< [31..31] AHB master idle                                                  */
    } bit;
  } OTG_FS_GRSTCTL;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) OTG_FS core interrupt register (OTG_FS_GINTSTS)            */
    
    struct {
      __IM  uint32 CMOD       : 1;            /*!< [0..0] Current mode of operation                                          */
      __IOM uint32 MMIS       : 1;            /*!< [1..1] Mode mismatch interrupt                                            */
      __IM  uint32 OTGINT     : 1;            /*!< [2..2] OTG interrupt                                                      */
      __IOM uint32 SOF        : 1;            /*!< [3..3] Start of frame                                                     */
      __IM  uint32 RXFLVL     : 1;            /*!< [4..4] RxFIFO non-empty                                                   */
      __IM  uint32 NPTXFE     : 1;            /*!< [5..5] Non-periodic TxFIFO empty                                          */
      __IM  uint32 GINAKEFF   : 1;            /*!< [6..6] Global IN non-periodic NAK effective                               */
      __IM  uint32 GOUTNAKEFF : 1;            /*!< [7..7] Global OUT NAK effective                                           */
            uint32            : 2;
      __IOM uint32 ESUSP      : 1;            /*!< [10..10] Early suspend                                                    */
      __IOM uint32 USBSUSP    : 1;            /*!< [11..11] USB suspend                                                      */
      __IOM uint32 USBRST     : 1;            /*!< [12..12] USB reset                                                        */
      __IOM uint32 ENUMDNE    : 1;            /*!< [13..13] Enumeration done                                                 */
      __IOM uint32 ISOODRP    : 1;            /*!< [14..14] Isochronous OUT packet dropped interrupt                         */
      __IOM uint32 EOPF       : 1;            /*!< [15..15] End of periodic frame interrupt                                  */
            uint32            : 2;
      __IM  uint32 IEPINT     : 1;            /*!< [18..18] IN endpoint interrupt                                            */
      __IM  uint32 OEPINT     : 1;            /*!< [19..19] OUT endpoint interrupt                                           */
      __IOM uint32 IISOIXFR   : 1;            /*!< [20..20] Incomplete isochronous IN transfer                               */
      __IOM uint32 IPXFR_INCOMPISOOUT : 1;    /*!< [21..21] Incomplete periodic transfer(Host mode)/Incomplete
                                                     isochronous OUT transfer(Device mode)                                     */
            uint32            : 1;
      __IOM uint32 RSTDET     : 1;            /*!< [23..23] Reset detected interrupt                                         */
      __IM  uint32 HPRTINT    : 1;            /*!< [24..24] Host port interrupt                                              */
      __IM  uint32 HCINT      : 1;            /*!< [25..25] Host channels interrupt                                          */
      __IM  uint32 PTXFE      : 1;            /*!< [26..26] Periodic TxFIFO empty                                            */
            uint32            : 1;
      __IOM uint32 CIDSCHG    : 1;            /*!< [28..28] Connector ID status change                                       */
      __IOM uint32 DISCINT    : 1;            /*!< [29..29] Disconnect detected interrupt                                    */
      __IOM uint32 SRQINT     : 1;            /*!< [30..30] Session request/new session detected interrupt                   */
      __IOM uint32 WKUPINT    : 1;            /*!< [31..31] Resume/remote wakeup detected interrupt                          */
    } bit;
  } OTG_FS_GINTSTS;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) OTG_FS interrupt mask register (OTG_FS_GINTMSK)            */
    
