Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
            uint32            : 1;
      __IOM uint32 MMISM      : 1;            /*!< [1..1] Mode mismatch interrupt mask                                       */
      __IOM uint32 OTGINT     : 1;            /*!< [2..2] OTG interrupt mask                                                 */
      __IOM uint32 SOFM       : 1;            /*!< [3..3] Start of frame mask                                                */
      __IOM uint32 RXFLVLM    : 1;            /*!< [4..4] Receive FIFO non-empty mask                                        */
      __IOM uint32 NPTXFEM    : 1;            /*!< [5..5] Non-periodic TxFIFO empty mask                                     */
      __IOM uint32 GINAKEFFM  : 1;            /*!< [6..6] Global non-periodic IN NAK effective mask                          */
      __IOM uint32 GONAKEFFM  : 1;            /*!< [7..7] Global OUT NAK effective mask                                      */
            uint32            : 2;
      __IOM uint32 ESUSPM     : 1;            /*!< [10..10] Early suspend mask                                               */
      __IOM uint32 USBSUSPM   : 1;            /*!< [11..11] USB suspend mask                                                 */
      __IOM uint32 USBRST     : 1;            /*!< [12..12] USB reset mask                                                   */
      __IOM uint32 ENUMDNEM   : 1;            /*!< [13..13] Enumeration done mask                                            */
      __IOM uint32 ISOODRPM   : 1;            /*!< [14..14] Isochronous OUT packet dropped interrupt mask                    */
      __IOM uint32 EOPFM      : 1;            /*!< [15..15] End of periodic frame interrupt mask                             */
            uint32            : 2;
      __IOM uint32 IEPINT     : 1;            /*!< [18..18] IN endpoints interrupt mask                                      */
      __IOM uint32 OEPINT     : 1;            /*!< [19..19] OUT endpoints interrupt mask                                     */
      __IOM uint32 IISOIXFRM  : 1;            /*!< [20..20] Incomplete isochronous IN transfer mask                          */
      __IOM uint32 IPXFRM_IISOOXFRM : 1;      /*!< [21..21] Incomplete periodic transfer mask(Host mode)/Incomplete
                                                     isochronous OUT transfer mask(Device mode)                                */
            uint32            : 1;
      __IOM uint32 RSTDETM    : 1;            /*!< [23..23] Reset detected interrupt mask                                    */
      __IM  uint32 PRTIM      : 1;            /*!< [24..24] Host port interrupt mask                                         */
      __IOM uint32 HCIM       : 1;            /*!< [25..25] Host channels interrupt mask                                     */
      __IOM uint32 PTXFEM     : 1;            /*!< [26..26] Periodic TxFIFO empty mask                                       */
      __IOM uint32 LPMIN      : 1;            /*!< [27..27] LPM interrupt mask                                               */
      __IOM uint32 CIDSCHGM   : 1;            /*!< [28..28] Connector ID status change mask                                  */
      __IOM uint32 DISCINT    : 1;            /*!< [29..29] Disconnect detected interrupt mask                               */
      __IOM uint32 SRQIM      : 1;            /*!< [30..30] Session request/new session detected interrupt mask              */
      __IOM uint32 WUIM       : 1;            /*!< [31..31] Resume/remote wakeup detected interrupt mask                     */
    } bit;
  } OTG_FS_GINTMSK;
  
  union {
    union {
      __IM  uint32 reg;                       /*!< (@ 0x0000001C) OTG_FS Receive status debug read(Device mode)              */
      
      struct {
        __IM  uint32 EPNUM    : 4;            /*!< [3..0] Endpoint number                                                    */
        __IM  uint32 BCNT     : 11;           /*!< [14..4] Byte count                                                        */
        __IM  uint32 DPID     : 2;            /*!< [16..15] Data PID                                                         */
        __IM  uint32 PKTSTS   : 4;            /*!< [20..17] Packet status                                                    */
        __IM  uint32 FRMNUM   : 4;            /*!< [24..21] Frame number                                                     */
              uint32          : 7;
      } bit;
    } OTG_FS_GRXSTSR_Device;
    
    union {
      __IM  uint32 reg;                       /*!< (@ 0x0000001C) OTG_FS Receive status debug read(Host mode)                */
      
      struct {
        __IM  uint32 CHNUM    : 4;            /*!< [3..0] Endpoint number                                                    */
        __IM  uint32 BCNT     : 11;           /*!< [14..4] Byte count                                                        */
        __IM  uint32 DPID     : 2;            /*!< [16..15] Data PID                                                         */
        __IM  uint32 PKTSTS   : 4;            /*!< [20..17] Packet status                                                    */
              uint32          : 11;
      } bit;
    } OTG_FS_GRXSTSR_Host;
  };
  
  union {
    union {
      __IM  uint32 reg;                       /*!< (@ 0x00000020) OTG status read and pop register (Device mode)             */
      
      struct {
        __IM  uint32 EPNUM    : 4;            /*!< [3..0] Endpoint number                                                    */
        __IM  uint32 BCNT     : 11;           /*!< [14..4] Byte count                                                        */
        __IM  uint32 DPID     : 2;            /*!< [16..15] Data PID                                                         */
        __IM  uint32 PKTSTS   : 4;            /*!< [20..17] Packet status                                                    */
        __IM  uint32 FRMNUM   : 4;            /*!< [24..21] Frame number                                                     */
              uint32          : 7;
      } bit;
    } OTG_FS_GRXSTSP_Device;
    
    union {
      __IM  uint32 reg;                       /*!< (@ 0x00000020) OTG status read and pop register (Host mode)               */
      
