Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
      struct {
        __IM  uint32 CHNUM    : 4;            /*!< [3..0] Channel number                                                     */
        __IM  uint32 BCNT     : 11;           /*!< [14..4] Byte count                                                        */
        __IM  uint32 DPID     : 2;            /*!< [16..15] Data PID                                                         */
        __IM  uint32 PKTSTS   : 4;            /*!< [20..17] Packet status                                                    */
              uint32          : 11;
      } bit;
    } OTG_FS_GRXSTSP_Host;
  };
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) OTG_FS Receive FIFO size register (OTG_FS_GRXFSIZ)         */
    
    struct {
      __IOM uint32 RXFD       : 16;           /*!< [15..0] RxFIFO depth                                                      */
            uint32            : 16;
    } bit;
  } OTG_FS_GRXFSIZ;
  
  union {
    union {
      __IOM uint32 reg;                       /*!< (@ 0x00000028) OTG_FS Endpoint 0 Transmit FIFO size                       */
      
      struct {
        __IOM uint32 TX0FSA   : 16;           /*!< [15..0] Endpoint 0 transmit RAM start address                             */
        __IOM uint32 TX0FD    : 16;           /*!< [31..16] Endpoint 0 TxFIFO depth                                          */
      } bit;
    } OTG_FS_DIEPTXF0_Device;
    
    union {
      __IOM uint32 reg;                       /*!< (@ 0x00000028) OTG_FS Host non-periodic transmit FIFO size register       */
      
      struct {
        __IOM uint32 NPTXFSA  : 16;           /*!< [15..0] Non-periodic transmit RAM start address                           */
        __IOM uint32 NPTXFD   : 16;           /*!< [31..16] Non-periodic TxFIFO depth                                        */
      } bit;
    } OTG_FS_HNPTXFSIZ_Host;
  };
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000002C) OTG_FS non-periodic transmit FIFO/queue status
                                                                    register (OTG_FS_GNPTXSTS)                                 */
    
    struct {
      __IM  uint32 NPTXFSAV   : 16;           /*!< [15..0] Non-periodic TxFIFO space available                               */
      __IM  uint32 NPTQXSAV   : 8;            /*!< [23..16] Non-periodic transmit request queue space available              */
      __IM  uint32 NPTXQTOP   : 7;            /*!< [30..24] Top of the non-periodic transmit request queue                   */
            uint32            : 1;
    } bit;
  } OTG_FS_HNPTXSTS;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000030) OTG I2C access register                                    */
    
    struct {
      __IOM uint32 RWDATA     : 8;            /*!< [7..0] I2C Read/Write Data                                                */
      __IOM uint32 REGADDR    : 8;            /*!< [15..8] I2C Register Address                                              */
      __IOM uint32 ADDR       : 7;            /*!< [22..16] I2C Address                                                      */
      __IOM uint32 I2CEN      : 1;            /*!< [23..23] I2C Enable                                                       */
      __IOM uint32 ACK        : 1;            /*!< [24..24] I2C ACK                                                          */
            uint32            : 1;
      __IOM uint32 I2CDEVADR  : 2;            /*!< [27..26] I2C Device Address                                               */
      __IOM uint32 I2CDATSE0  : 1;            /*!< [28..28] I2C DatSe0 USB mode                                              */
            uint32            : 1;
      __IOM uint32 RW         : 1;            /*!< [30..30] Read/Write Indicator                                             */
      __IOM uint32 BSYDNE     : 1;            /*!< [31..31] I2C Busy/Done                                                    */
    } bit;
  } OTG_FS_GI2CCTL;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000038) OTG_FS general core configuration register (OTG_FS_GCCFG)  */
    
    struct {
      __IOM uint32 DCDET      : 1;            /*!< [0..0] Data contact detection (DCD) status                                */
      __IOM uint32 PDET       : 1;            /*!< [1..1] Primary detection (PD) status                                      */
      __IOM uint32 SDET       : 1;            /*!< [2..2] Secondary detection (SD) status                                    */
      __IOM uint32 PS2DET     : 1;            /*!< [3..3] DM pull-up detection status                                        */
            uint32            : 12;
      __IOM uint32 PWRDWN     : 1;            /*!< [16..16] Power down                                                       */
      __IOM uint32 BCDEN      : 1;            /*!< [17..17] Battery charging detector (BCD) enable                           */
      __IOM uint32 DCDEN      : 1;            /*!< [18..18] Data contact detection (DCD) mode enable                         */
      __IOM uint32 PDEN       : 1;            /*!< [19..19] Primary detection (PD) mode enable                               */
      __IOM uint32 SDEN       : 1;            /*!< [20..20] Secondary detection (SD) mode enable                             */
      __IOM uint32 VBDEN      : 1;            /*!< [21..21] USB VBUS detection enable                                        */
            uint32            : 10;
    } bit;
  } OTG_FS_GCCFG;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000003C) core ID register                                           */
    
    struct {
      __IOM uint32 PRODUCT_ID : 32;           /*!< [31..0] Product ID field                                                  */
    } bit;
  } OTG_FS_CID;
  __IM  uint32  RESERVED1[5];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000054) OTG core LPM configuration register                        */
    
