Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 LPMEN      : 1;            /*!< [0..0] LPM support enable                                                 */
      __IOM uint32 LPMACK     : 1;            /*!< [1..1] LPM token acknowledge enable                                       */
      __IOM uint32 BESL       : 4;            /*!< [5..2] Best effort service latency                                        */
      __IOM uint32 REMWAKE    : 1;            /*!< [6..6] bRemoteWake value                                                  */
      __IOM uint32 L1SSEN     : 1;            /*!< [7..7] L1 Shallow Sleep enable                                            */
      __IOM uint32 BESLTHRS   : 4;            /*!< [11..8] BESL threshold                                                    */
      __IOM uint32 L1DSEN     : 1;            /*!< [12..12] L1 deep sleep enable                                             */
      __IM  uint32 LPMRST     : 2;            /*!< [14..13] LPM response                                                     */
      __IM  uint32 SLPSTS     : 1;            /*!< [15..15] Port sleep status                                                */
      __IM  uint32 L1RSMOK    : 1;            /*!< [16..16] Sleep State Resume OK                                            */
      __IOM uint32 LPMCHIDX   : 4;            /*!< [20..17] LPM Channel Index                                                */
      __IOM uint32 LPMRCNT    : 3;            /*!< [23..21] LPM retry count                                                  */
      __IOM uint32 SNDLPM     : 1;            /*!< [24..24] Send LPM transaction                                             */
      __IM  uint32 LPMRCNTSTS : 3;            /*!< [27..25] LPM retry count status                                           */
      __IOM uint32 ENBESL     : 1;            /*!< [28..28] Enable best effort service latency                               */
            uint32            : 3;
    } bit;
  } OTG_FS_GLPMCFG;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000058) OTG power down register                                    */
    
    struct {
      __IOM uint32 ADPMEN     : 1;            /*!< [0..0] ADP module enable                                                  */
            uint32            : 22;
      __IOM uint32 ADPIF      : 1;            /*!< [23..23] ADP interrupt flag                                               */
            uint32            : 8;
    } bit;
  } OTG_FS_GPWRDN;
  __IM  uint32  RESERVED2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000060) OTG ADP timer, control and status register                 */
    
    struct {
      __IOM uint32 PRBDSCHG   : 2;            /*!< [1..0] Probe discharge                                                    */
      __IOM uint32 PRBDELTA   : 2;            /*!< [3..2] Probe delta                                                        */
      __IOM uint32 PRBPER     : 2;            /*!< [5..4] Probe period                                                       */
      __IM  uint32 RTIM       : 11;           /*!< [16..6] Ramp time                                                         */
      __IOM uint32 ENAPRB     : 1;            /*!< [17..17] Enable probe                                                     */
      __IOM uint32 ENASNS     : 1;            /*!< [18..18] Enable sense                                                     */
      __IM  uint32 ADPRST     : 1;            /*!< [19..19] ADP reset                                                        */
      __IOM uint32 ADPEN      : 1;            /*!< [20..20] ADP enable                                                       */
      __IOM uint32 ADPPRBIF   : 1;            /*!< [21..21] ADP probe interrupt flag                                         */
      __IOM uint32 ADPSNSIF   : 1;            /*!< [22..22] ADP sense interrupt flag                                         */
      __IOM uint32 ADPTOIF    : 1;            /*!< [23..23] ADP timeout interrupt flag                                       */
      __IOM uint32 ADPPRBIM   : 1;            /*!< [24..24] ADP probe interrupt mask                                         */
      __IOM uint32 ADPSNSIM   : 1;            /*!< [25..25] ADP sense interrupt mask                                         */
      __IOM uint32 ADPTOIM    : 1;            /*!< [26..26] ADP timeout interrupt mask                                       */
      __IOM uint32 AR         : 2;            /*!< [28..27] Access request                                                   */
            uint32            : 3;
    } bit;
  } OTG_FS_GADPCTL;
  __IM  uint32  RESERVED3[39];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000100) OTG_FS Host periodic transmit FIFO size register
                                                                    (OTG_FS_HPTXFSIZ)                                          */
    
    struct {
      __IOM uint32 PTXSA      : 16;           /*!< [15..0] Host periodic TxFIFO start address                                */
      __IOM uint32 PTXFSIZ    : 16;           /*!< [31..16] Host periodic TxFIFO depth                                       */
    } bit;
  } OTG_FS_HPTXFSIZ;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000104) OTG_FS device IN endpoint transmit FIFO size
                                                                    register (OTG_FS_DIEPTXF1)                                 */
    
    struct {
      __IOM uint32 INEPTXSA   : 16;           /*!< [15..0] IN endpoint FIFO2 transmit RAM start address                      */
      __IOM uint32 INEPTXFD   : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } bit;
  } OTG_FS_DIEPTXF1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000108) OTG_FS device IN endpoint transmit FIFO size
                                                                    register (OTG_FS_DIEPTXF2)                                 */
    
