Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 INEPTXSA   : 16;           /*!< [15..0] IN endpoint FIFO3 transmit RAM start address                      */
      __IOM uint32 INEPTXFD   : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } bit;
  } OTG_FS_DIEPTXF2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000010C) OTG_FS device IN endpoint transmit FIFO size
                                                                    register (OTG_FS_DIEPTXF3)                                 */
    
    struct {
      __IOM uint32 INEPTXSA   : 16;           /*!< [15..0] IN endpoint FIFO4 transmit RAM start address                      */
      __IOM uint32 INEPTXFD   : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } bit;
  } OTG_FS_DIEPTXF3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000110) OTG_FS device IN endpoint transmit FIFO size
                                                                    register (OTG_FS_DIEPTXF4)                                 */
    
    struct {
      __IOM uint32 INEPTXSA   : 16;           /*!< [15..0] IN endpoint FIFOx transmit RAM start address                      */
      __IOM uint32 INEPTXFD   : 16;           /*!< [31..16] IN endpoint Tx FIFO depth                                        */
    } bit;
  } OTG_FS_DIEPTXF4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000114) OTG_FS device IN endpoint transmit FIFO size
                                                                    register (OTG_FS_DIEPTXF5)                                 */
    
    struct {
      __IOM uint32 INEPTXSA   : 16;           /*!< [15..0] IN endpoint FIFOx transmit RAM start address                      */
      __IOM uint32 INEPTXFD   : 16;           /*!< [31..16] IN endpoint Tx FIFO depth                                        */
    } bit;
  } OTG_FS_DIEPTXF5;
} OTG_FS_GLOBAL_Type;                           /*!< Size = 280 (0x118)                                                        */



/* =========================================================================================================================== */
/* ================                                        OTG_FS_HOST                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go full speed (OTG_FS_HOST)
  */

typedef struct {                                /*!< (@ 0x50000400) OTG_FS_HOST Structure                                      */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) OTG_FS host configuration register (OTG_FS_HCFG)           */
    
    struct {
      __IOM uint32 FSLSPCS    : 2;            /*!< [1..0] FS/LS PHY clock select                                             */
      __IM  uint32 FSLSS      : 1;            /*!< [2..2] FS- and LS-only support                                            */
            uint32            : 29;
    } bit;
  } OTG_FS_HCFG;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) OTG_FS Host frame interval register                        */
    
    struct {
      __IOM uint32 FRIVL      : 16;           /*!< [15..0] Frame interval                                                    */
            uint32            : 16;
    } bit;
  } OTG_FS_HFIR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000008) OTG_FS host frame number/frame time remaining
                                                                    register (OTG_FS_HFNUM)                                    */
    
    struct {
      __IM  uint32 FRNUM      : 16;           /*!< [15..0] Frame number                                                      */
      __IM  uint32 FTREM      : 16;           /*!< [31..16] Frame time remaining                                             */
    } bit;
  } OTG_FS_HFNUM;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) OTG_FS_Host periodic transmit FIFO/queue status
                                                                    register (OTG_FS_HPTXSTS)                                  */
    
    struct {
      __IOM uint32 PTXFSAVL   : 16;           /*!< [15..0] Periodic transmit data FIFO space available                       */
      __IM  uint32 PTXQSAV    : 8;            /*!< [23..16] Periodic transmit request queue space available                  */
      __IM  uint32 PTXQTOP    : 8;            /*!< [31..24] Top of the periodic transmit request queue                       */
    } bit;
  } OTG_FS_HPTXSTS;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000014) OTG_FS Host all channels interrupt register                */
    
    struct {
      __IM  uint32 HAINT      : 16;           /*!< [15..0] Channel interrupts                                                */
            uint32            : 16;
    } bit;
  } OTG_FS_HAINT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) OTG_FS host all channels interrupt mask register           */
    
    struct {
      __IOM uint32 HAINTM     : 16;           /*!< [15..0] Channel interrupt mask                                            */
            uint32            : 16;
    } bit;
  } OTG_FS_HAINTMSK;
  __IM  uint32  RESERVED1[9];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000040) OTG_FS host port control and status register
                                                                    (OTG_FS_HPRT)                                              */
    
    struct {
      __IM  uint32 PCSTS      : 1;            /*!< [0..0] Port connect status                                                */
      __IOM uint32 PCDET      : 1;            /*!< [1..1] Port connect detected                                              */
      __IOM uint32 PENA       : 1;            /*!< [2..2] Port enable                                                        */
      __IOM uint32 PENCHNG    : 1;            /*!< [3..3] Port enable/disable change                                         */
      __IM  uint32 POCA       : 1;            /*!< [4..4] Port overcurrent active                                            */
      __IOM uint32 POCCHNG    : 1;            /*!< [5..5] Port overcurrent change                                            */
      __IOM uint32 PRES       : 1;            /*!< [6..6] Port resume                                                        */
      __IOM uint32 PSUSP      : 1;            /*!< [7..7] Port suspend                                                       */
      __IOM uint32 PRST       : 1;            /*!< [8..8] Port reset                                                         */
            uint32            : 1;
      __IM  uint32 PLSTS      : 2;            /*!< [11..10] Port line status                                                 */
      __IOM uint32 PPWR       : 1;            /*!< [12..12] Port power                                                       */
      __IOM uint32 PTCTL      : 4;            /*!< [16..13] Port test control                                                */
      __IM  uint32 PSPD       : 2;            /*!< [18..17] Port speed                                                       */
            uint32            : 13;
    } bit;
  } OTG_FS_HPRT;
  __IM  uint32  RESERVED2[47];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000100) OTG_FS host channel-0 characteristics register
                                                                    (OTG_FS_HCCHAR0)                                           */
    
