Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 DPID       : 2;            /*!< [30..29] Data PID                                                         */
            uint32            : 1;
    } bit;
  } OTG_FS_HCTSIZ3;
  __IM  uint32  RESERVED10[3];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000180) OTG_FS host channel-4 characteristics register
                                                                    (OTG_FS_HCCHAR4)                                           */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] Maximum packet size                                               */
      __IOM uint32 EPNUM      : 4;            /*!< [14..11] Endpoint number                                                  */
      __IOM uint32 EPDIR      : 1;            /*!< [15..15] Endpoint direction                                               */
            uint32            : 1;
      __IOM uint32 LSDEV      : 1;            /*!< [17..17] Low-speed device                                                 */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] Endpoint type                                                    */
      __IOM uint32 MCNT       : 2;            /*!< [21..20] Multicount                                                       */
      __IOM uint32 DAD        : 7;            /*!< [28..22] Device address                                                   */
      __IOM uint32 ODDFRM     : 1;            /*!< [29..29] Odd frame                                                        */
      __IOM uint32 CHDIS      : 1;            /*!< [30..30] Channel disable                                                  */
      __IOM uint32 CHENA      : 1;            /*!< [31..31] Channel enable                                                   */
    } bit;
  } OTG_FS_HCCHAR4;
  __IM  uint32  RESERVED11;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000188) OTG_FS host channel-4 interrupt register (OTG_FS_HCINT4)   */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] Transfer completed                                                 */
      __IOM uint32 CHH        : 1;            /*!< [1..1] Channel halted                                                     */
            uint32            : 1;
      __IOM uint32 STALL      : 1;            /*!< [3..3] STALL response received interrupt                                  */
      __IOM uint32 NAK        : 1;            /*!< [4..4] NAK response received interrupt                                    */
      __IOM uint32 ACK        : 1;            /*!< [5..5] ACK response received/transmitted interrupt                        */
            uint32            : 1;
      __IOM uint32 TXERR      : 1;            /*!< [7..7] Transaction error                                                  */
      __IOM uint32 BBERR      : 1;            /*!< [8..8] Babble error                                                       */
      __IOM uint32 FRMOR      : 1;            /*!< [9..9] Frame overrun                                                      */
      __IOM uint32 DTERR      : 1;            /*!< [10..10] Data toggle error                                                */
            uint32            : 21;
    } bit;
  } OTG_FS_HCINT4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000018C) OTG_FS host channel-4 mask register (OTG_FS_HCINTMSK4)     */
    
    struct {
      __IOM uint32 XFRCM      : 1;            /*!< [0..0] Transfer completed mask                                            */
      __IOM uint32 CHHM       : 1;            /*!< [1..1] Channel halted mask                                                */
            uint32            : 1;
      __IOM uint32 STALLM     : 1;            /*!< [3..3] STALL response received interrupt mask                             */
      __IOM uint32 NAKM       : 1;            /*!< [4..4] NAK response received interrupt mask                               */
      __IOM uint32 ACKM       : 1;            /*!< [5..5] ACK response received/transmitted interrupt mask                   */
      __IOM uint32 NYET       : 1;            /*!< [6..6] response received interrupt mask                                   */
      __IOM uint32 TXERRM     : 1;            /*!< [7..7] Transaction error mask                                             */
      __IOM uint32 BBERRM     : 1;            /*!< [8..8] Babble error mask                                                  */
      __IOM uint32 FRMORM     : 1;            /*!< [9..9] Frame overrun mask                                                 */
      __IOM uint32 DTERRM     : 1;            /*!< [10..10] Data toggle error mask                                           */
            uint32            : 21;
    } bit;
  } OTG_FS_HCINTMSK4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000190) OTG_FS host channel-x transfer size register               */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 DPID       : 2;            /*!< [30..29] Data PID                                                         */
            uint32            : 1;
    } bit;
  } OTG_FS_HCTSIZ4;
  __IM  uint32  RESERVED12[3];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001A0) OTG_FS host channel-5 characteristics register
                                                                    (OTG_FS_HCCHAR5)                                           */
    
