Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 XFRCM      : 1;            /*!< [0..0] Transfer completed mask                                            */
      __IOM uint32 CHHM       : 1;            /*!< [1..1] Channel halted mask                                                */
            uint32            : 1;
      __IOM uint32 STALLM     : 1;            /*!< [3..3] STALL response received interrupt mask                             */
      __IOM uint32 NAKM       : 1;            /*!< [4..4] NAK response received interrupt mask                               */
      __IOM uint32 ACKM       : 1;            /*!< [5..5] ACK response received/transmitted interrupt mask                   */
      __IOM uint32 NYET       : 1;            /*!< [6..6] response received interrupt mask                                   */
      __IOM uint32 TXERRM     : 1;            /*!< [7..7] Transaction error mask                                             */
      __IOM uint32 BBERRM     : 1;            /*!< [8..8] Babble error mask                                                  */
      __IOM uint32 FRMORM     : 1;            /*!< [9..9] Frame overrun mask                                                 */
      __IOM uint32 DTERRM     : 1;            /*!< [10..10] Data toggle error mask                                           */
            uint32            : 21;
    } bit;
  } OTG_FS_HCINTMSK11;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000230) OTG_FS host channel-11 transfer size register              */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 DPID       : 2;            /*!< [30..29] Data PID                                                         */
            uint32            : 1;
    } bit;
  } OTG_FS_HCTSIZ11;
} OTG_FS_HOST_Type;                             /*!< Size = 564 (0x234)                                                        */



/* =========================================================================================================================== */
/* ================                                       OTG_FS_DEVICE                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go full speed (OTG_FS_DEVICE)
  */

typedef struct {                                /*!< (@ 0x50000800) OTG_FS_DEVICE Structure                                    */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) OTG_FS device configuration register (OTG_FS_DCFG)         */
    
    struct {
      __IOM uint32 DSPD       : 2;            /*!< [1..0] Device speed                                                       */
      __IOM uint32 NZLSOHSK   : 1;            /*!< [2..2] Non-zero-length status OUT handshake                               */
            uint32            : 1;
      __IOM uint32 DAD        : 7;            /*!< [10..4] Device address                                                    */
      __IOM uint32 PFIVL      : 2;            /*!< [12..11] Periodic frame interval                                          */
            uint32            : 19;
    } bit;
  } OTG_FS_DCFG;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) OTG_FS device control register (OTG_FS_DCTL)               */
    
    struct {
      __IOM uint32 RWUSIG     : 1;            /*!< [0..0] Remote wakeup signaling                                            */
      __IOM uint32 SDIS       : 1;            /*!< [1..1] Soft disconnect                                                    */
      __IM  uint32 GINSTS     : 1;            /*!< [2..2] Global IN NAK status                                               */
      __IM  uint32 GONSTS     : 1;            /*!< [3..3] Global OUT NAK status                                              */
      __IOM uint32 TCTL       : 3;            /*!< [6..4] Test control                                                       */
      __IOM uint32 SGINAK     : 1;            /*!< [7..7] Set global IN NAK                                                  */
      __IOM uint32 CGINAK     : 1;            /*!< [8..8] Clear global IN NAK                                                */
      __IOM uint32 SGONAK     : 1;            /*!< [9..9] Set global OUT NAK                                                 */
      __IOM uint32 CGONAK     : 1;            /*!< [10..10] Clear global OUT NAK                                             */
      __IOM uint32 POPRGDNE   : 1;            /*!< [11..11] Power-on programming done                                        */
            uint32            : 20;
    } bit;
  } OTG_FS_DCTL;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000008) OTG_FS device status register (OTG_FS_DSTS)                */
    
    struct {
      __IM  uint32 SUSPSTS    : 1;            /*!< [0..0] Suspend status                                                     */
      __IM  uint32 ENUMSPD    : 2;            /*!< [2..1] Enumerated speed                                                   */
      __IM  uint32 EERR       : 1;            /*!< [3..3] Erratic error                                                      */
            uint32            : 4;
      __IM  uint32 FNSOF      : 14;           /*!< [21..8] Frame number of the received SOF                                  */
            uint32            : 10;
    } bit;
  } OTG_FS_DSTS;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) OTG_FS device IN endpoint common interrupt mask
                                                                    register (OTG_FS_DIEPMSK)                                  */
    
