Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 XFRCM      : 1;            /*!< [0..0] Transfer completed interrupt mask                                  */
      __IOM uint32 EPDM       : 1;            /*!< [1..1] Endpoint disabled interrupt mask                                   */
            uint32            : 1;
      __IOM uint32 TOM        : 1;            /*!< [3..3] Timeout condition mask (Non-isochronous endpoints)                 */
      __IOM uint32 ITTXFEMSK  : 1;            /*!< [4..4] IN token received when TxFIFO empty mask                           */
      __IOM uint32 INEPNMM    : 1;            /*!< [5..5] IN token received with EP mismatch mask                            */
      __IOM uint32 INEPNEM    : 1;            /*!< [6..6] IN endpoint NAK effective mask                                     */
            uint32            : 25;
    } bit;
  } OTG_FS_DIEPMSK;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) OTG_FS device OUT endpoint common interrupt mask
                                                                    register (OTG_FS_DOEPMSK)                                  */
    
    struct {
      __IOM uint32 XFRCM      : 1;            /*!< [0..0] Transfer completed interrupt mask                                  */
      __IOM uint32 EPDM       : 1;            /*!< [1..1] Endpoint disabled interrupt mask                                   */
            uint32            : 1;
      __IOM uint32 STUPM      : 1;            /*!< [3..3] SETUP phase done mask                                              */
      __IOM uint32 OTEPDM     : 1;            /*!< [4..4] OUT token received when endpoint disabled mask                     */
            uint32            : 27;
    } bit;
  } OTG_FS_DOEPMSK;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000018) OTG_FS device all endpoints interrupt register
                                                                    (OTG_FS_DAINT)                                             */
    
    struct {
      __IM  uint32 IEPINT     : 16;           /*!< [15..0] IN endpoint interrupt bits                                        */
      __IM  uint32 OEPINT     : 16;           /*!< [31..16] OUT endpoint interrupt bits                                      */
    } bit;
  } OTG_FS_DAINT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) OTG_FS all endpoints interrupt mask register
                                                                    (OTG_FS_DAINTMSK)                                          */
    
    struct {
      __IOM uint32 IEPM       : 16;           /*!< [15..0] IN EP interrupt mask bits                                         */
      __IOM uint32 OEPINT     : 16;           /*!< [31..16] OUT endpoint interrupt bits                                      */
    } bit;
  } OTG_FS_DAINTMSK;
  __IM  uint32  RESERVED1[2];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) OTG_FS device VBUS discharge time register                 */
    
    struct {
      __IOM uint32 VBUSDT     : 16;           /*!< [15..0] Device VBUS discharge time                                        */
            uint32            : 16;
    } bit;
  } OTG_FS_DVBUSDIS;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) OTG_FS device VBUS pulsing time register                   */
    
    struct {
      __IOM uint32 DVBUSP     : 12;           /*!< [11..0] Device VBUS pulsing time                                          */
            uint32            : 20;
    } bit;
  } OTG_FS_DVBUSPULSE;
  __IM  uint32  RESERVED2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) OTG_FS device IN endpoint FIFO empty interrupt
                                                                    mask register                                              */
    
    struct {
      __IOM uint32 INEPTXFEM  : 16;           /*!< [15..0] IN EP Tx FIFO empty interrupt mask bits                           */
            uint32            : 16;
    } bit;
  } OTG_FS_DIEPEMPMSK;
  __IM  uint32  RESERVED3[50];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000100) OTG_FS device control IN endpoint 0 control register
                                                                    (OTG_FS_DIEPCTL0)                                          */
    
    struct {
      __IOM uint32 MPSIZ      : 2;            /*!< [1..0] Maximum packet size                                                */
            uint32            : 13;
      __IM  uint32 USBAEP     : 1;            /*!< [15..15] USB active endpoint                                              */
            uint32            : 1;
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAK status                                                       */
      __IM  uint32 EPTYP      : 2;            /*!< [19..18] Endpoint type                                                    */
            uint32            : 1;
      __IOM uint32 STALL      : 1;            /*!< [21..21] STALL handshake                                                  */
      __IOM uint32 TXFNUM     : 4;            /*!< [25..22] TxFIFO number                                                    */
      __OM  uint32 CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
            uint32            : 2;
      __IM  uint32 EPDIS      : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IM  uint32 EPENA      : 1;            /*!< [31..31] Endpoint enable                                                  */
    } bit;
  } OTG_FS_DIEPCTL0;
  __IM  uint32  RESERVED4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000108) device endpoint-x interrupt register                       */
    
