Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] XFRC                                                               */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] EPDISD                                                             */
            uint32            : 1;
      __IOM uint32 TOC        : 1;            /*!< [3..3] TOC                                                                */
      __IOM uint32 ITTXFE     : 1;            /*!< [4..4] ITTXFE                                                             */
            uint32            : 1;
      __IOM uint32 INEPNE     : 1;            /*!< [6..6] INEPNE                                                             */
      __IM  uint32 TXFE       : 1;            /*!< [7..7] TXFE                                                               */
            uint32            : 24;
    } bit;
  } OTG_FS_DIEPINT0;
  __IM  uint32  RESERVED5;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000110) device endpoint-0 transfer size register                   */
    
    struct {
      __IOM uint32 XFRSIZ     : 7;            /*!< [6..0] Transfer size                                                      */
            uint32            : 12;
      __IOM uint32 PKTCNT     : 2;            /*!< [20..19] Packet count                                                     */
            uint32            : 11;
    } bit;
  } OTG_FS_DIEPTSIZ0;
  __IM  uint32  RESERVED6;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000118) OTG_FS device IN endpoint transmit FIFO status
                                                                    register                                                   */
    
    struct {
      __IM  uint32 INEPTFSAV  : 16;           /*!< [15..0] IN endpoint TxFIFO space available                                */
            uint32            : 16;
    } bit;
  } OTG_FS_DTXFSTS0;
  __IM  uint32  RESERVED7;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000120) OTG device endpoint-1 control register                     */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] MPSIZ                                                             */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USBAEP                                                           */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] EONUM/DPID                                                       */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAKSTS                                                           */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] EPTYP                                                            */
            uint32            : 1;
      __IOM uint32 Stall      : 1;            /*!< [21..21] Stall                                                            */
      __IOM uint32 TXFNUM     : 4;            /*!< [25..22] TXFNUM                                                           */
      __OM  uint32 CNAK       : 1;            /*!< [26..26] CNAK                                                             */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] SNAK                                                             */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] SD0PID/SEVNFRM                                                   */
      __OM  uint32 SODDFRM_SD1PID : 1;        /*!< [29..29] SODDFRM/SD1PID                                                   */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] EPDIS                                                            */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] EPENA                                                            */
    } bit;
  } OTG_FS_DIEPCTL1;
  __IM  uint32  RESERVED8;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000128) device endpoint-1 interrupt register                       */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] XFRC                                                               */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] EPDISD                                                             */
            uint32            : 1;
      __IOM uint32 TOC        : 1;            /*!< [3..3] TOC                                                                */
      __IOM uint32 ITTXFE     : 1;            /*!< [4..4] ITTXFE                                                             */
            uint32            : 1;
      __IOM uint32 INEPNE     : 1;            /*!< [6..6] INEPNE                                                             */
      __IM  uint32 TXFE       : 1;            /*!< [7..7] TXFE                                                               */
            uint32            : 24;
    } bit;
  } OTG_FS_DIEPINT1;
  __IM  uint32  RESERVED9;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000130) device endpoint-1 transfer size register                   */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 MCNT       : 2;            /*!< [30..29] Multi count                                                      */
            uint32            : 1;
    } bit;
  } OTG_FS_DIEPTSIZ1;
  __IM  uint32  RESERVED10;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000138) OTG_FS device IN endpoint transmit FIFO status
                                                                    register                                                   */
    
    struct {
      __IM  uint32 INEPTFSAV  : 16;           /*!< [15..0] IN endpoint TxFIFO space available                                */
            uint32            : 16;
    } bit;
  } OTG_FS_DTXFSTS1;
  __IM  uint32  RESERVED11;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000140) OTG device endpoint-2 control register                     */
    
