Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] XFRC                                                               */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] EPDISD                                                             */
            uint32            : 1;
      __IOM uint32 TOC        : 1;            /*!< [3..3] TOC                                                                */
      __IOM uint32 ITTXFE     : 1;            /*!< [4..4] ITTXFE                                                             */
            uint32            : 1;
      __IOM uint32 INEPNE     : 1;            /*!< [6..6] INEPNE                                                             */
      __IM  uint32 TXFE       : 1;            /*!< [7..7] TXFE                                                               */
            uint32            : 24;
    } bit;
  } OTG_FS_DIEPINT3;
  __IM  uint32  RESERVED17;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000170) device endpoint-3 transfer size register                   */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 MCNT       : 2;            /*!< [30..29] Multi count                                                      */
            uint32            : 1;
    } bit;
  } OTG_FS_DIEPTSIZ3;
  __IM  uint32  RESERVED18;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000178) OTG_FS device IN endpoint transmit FIFO status
                                                                    register                                                   */
    
    struct {
      __IM  uint32 INEPTFSAV  : 16;           /*!< [15..0] IN endpoint TxFIFO space available                                */
            uint32            : 16;
    } bit;
  } OTG_FS_DTXFSTS3;
  __IM  uint32  RESERVED19;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000180) OTG device endpoint-4 control register                     */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] MPSIZ                                                             */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USBAEP                                                           */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] EONUM/DPID                                                       */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAKSTS                                                           */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] EPTYP                                                            */
            uint32            : 1;
      __IOM uint32 Stall      : 1;            /*!< [21..21] Stall                                                            */
      __IOM uint32 TXFNUM     : 4;            /*!< [25..22] TXFNUM                                                           */
      __OM  uint32 CNAK       : 1;            /*!< [26..26] CNAK                                                             */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] SNAK                                                             */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] SD0PID/SEVNFRM                                                   */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] SODDFRM                                                          */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] EPDIS                                                            */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] EPENA                                                            */
    } bit;
  } OTG_FS_DIEPCTL4;
  __IM  uint32  RESERVED20;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000188) device endpoint-4 interrupt register                       */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] XFRC                                                               */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] EPDISD                                                             */
            uint32            : 1;
      __IOM uint32 TOC        : 1;            /*!< [3..3] TOC                                                                */
      __IOM uint32 ITTXFE     : 1;            /*!< [4..4] ITTXFE                                                             */
            uint32            : 1;
      __IOM uint32 INEPNE     : 1;            /*!< [6..6] INEPNE                                                             */
      __IM  uint32 TXFE       : 1;            /*!< [7..7] TXFE                                                               */
            uint32            : 24;
    } bit;
  } OTG_FS_DIEPINT4;
  __IM  uint32  RESERVED21[2];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000194) device endpoint-4 transfer size register                   */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 MCNT       : 2;            /*!< [30..29] Multi count                                                      */
            uint32            : 1;
    } bit;
  } OTG_FS_DIEPTSIZ4;
  __IM  uint32  RESERVED22;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000019C) OTG_FS device IN endpoint transmit FIFO status
                                                                    register                                                   */
    
