Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 INEPTFSAV  : 16;           /*!< [15..0] IN endpoint TxFIFO space available                                */
            uint32            : 16;
    } bit;
  } OTG_FS_DTXFSTS4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001A0) OTG device endpoint-5 control register                     */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] MPSIZ                                                             */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USBAEP                                                           */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] EONUM/DPID                                                       */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAKSTS                                                           */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] EPTYP                                                            */
            uint32            : 1;
      __IOM uint32 Stall      : 1;            /*!< [21..21] Stall                                                            */
      __IOM uint32 TXFNUM     : 4;            /*!< [25..22] TXFNUM                                                           */
      __OM  uint32 CNAK       : 1;            /*!< [26..26] CNAK                                                             */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] SNAK                                                             */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] SD0PID/SEVNFRM                                                   */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] SODDFRM                                                          */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] EPDIS                                                            */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] EPENA                                                            */
    } bit;
  } OTG_FS_DIEPCTL5;
  __IM  uint32  RESERVED23;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001A8) device endpoint-5 interrupt register                       */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] XFRC                                                               */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] EPDISD                                                             */
            uint32            : 1;
      __IOM uint32 TOC        : 1;            /*!< [3..3] TOC                                                                */
      __IOM uint32 ITTXFE     : 1;            /*!< [4..4] ITTXFE                                                             */
            uint32            : 1;
      __IOM uint32 INEPNE     : 1;            /*!< [6..6] INEPNE                                                             */
      __IM  uint32 TXFE       : 1;            /*!< [7..7] TXFE                                                               */
            uint32            : 24;
    } bit;
  } OTG_FS_DIEPINT5;
  __IM  uint32  RESERVED24;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001B0) device endpoint-5 transfer size register                   */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 MCNT       : 2;            /*!< [30..29] Multi count                                                      */
            uint32            : 1;
    } bit;
  } OTG_FS_DIEPTSIZ55;
  __IM  uint32  RESERVED25;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001B8) OTG_FS device IN endpoint transmit FIFO status
                                                                    register                                                   */
    
    struct {
      __IOM uint32 INEPTFSAV  : 16;           /*!< [15..0] IN endpoint TxFIFO space available                                */
            uint32            : 16;
    } bit;
  } OTG_FS_DTXFSTS55;
  __IM  uint32  RESERVED26[81];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000300) device endpoint-0 control register                         */
    
    struct {
      __IM  uint32 MPSIZ      : 2;            /*!< [1..0] MPSIZ                                                              */
            uint32            : 13;
      __IM  uint32 USBAEP     : 1;            /*!< [15..15] USBAEP                                                           */
            uint32            : 1;
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAKSTS                                                           */
      __IM  uint32 EPTYP      : 2;            /*!< [19..18] EPTYP                                                            */
      __IOM uint32 SNPM       : 1;            /*!< [20..20] SNPM                                                             */
      __IOM uint32 Stall      : 1;            /*!< [21..21] Stall                                                            */
            uint32            : 4;
      __OM  uint32 CNAK       : 1;            /*!< [26..26] CNAK                                                             */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] SNAK                                                             */
            uint32            : 2;
      __IM  uint32 EPDIS      : 1;            /*!< [30..30] EPDIS                                                            */
      __OM  uint32 EPENA      : 1;            /*!< [31..31] EPENA                                                            */
    } bit;
  } OTG_FS_DOEPCTL0;
  __IM  uint32  RESERVED27;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000308) device endpoint-0 interrupt register                       */
    
