Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] XFRC                                                               */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] EPDISD                                                             */
            uint32            : 1;
      __IOM uint32 STUP       : 1;            /*!< [3..3] STUP                                                               */
      __IOM uint32 OTEPDIS    : 1;            /*!< [4..4] OTEPDIS                                                            */
            uint32            : 1;
      __IOM uint32 B2BSTUP    : 1;            /*!< [6..6] B2BSTUP                                                            */
            uint32            : 25;
    } bit;
  } OTG_FS_DOEPINT0;
  __IM  uint32  RESERVED28;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000310) device OUT endpoint-0 transfer size register               */
    
    struct {
      __IOM uint32 XFRSIZ     : 7;            /*!< [6..0] Transfer size                                                      */
            uint32            : 12;
      __IOM uint32 PKTCNT     : 1;            /*!< [19..19] Packet count                                                     */
            uint32            : 9;
      __IOM uint32 STUPCNT    : 2;            /*!< [30..29] SETUP packet count                                               */
            uint32            : 1;
    } bit;
  } OTG_FS_DOEPTSIZ0;
  __IM  uint32  RESERVED29[3];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000320) device endpoint-1 control register                         */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] MPSIZ                                                             */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USBAEP                                                           */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] EONUM/DPID                                                       */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAKSTS                                                           */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] EPTYP                                                            */
      __IOM uint32 SNPM       : 1;            /*!< [20..20] SNPM                                                             */
      __IOM uint32 Stall      : 1;            /*!< [21..21] Stall                                                            */
            uint32            : 4;
      __OM  uint32 CNAK       : 1;            /*!< [26..26] CNAK                                                             */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] SNAK                                                             */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] SD0PID/SEVNFRM                                                   */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] SODDFRM                                                          */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] EPDIS                                                            */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] EPENA                                                            */
    } bit;
  } OTG_FS_DOEPCTL1;
  __IM  uint32  RESERVED30;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000328) device endpoint-1 interrupt register                       */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] XFRC                                                               */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] EPDISD                                                             */
            uint32            : 1;
      __IOM uint32 STUP       : 1;            /*!< [3..3] STUP                                                               */
      __IOM uint32 OTEPDIS    : 1;            /*!< [4..4] OTEPDIS                                                            */
            uint32            : 1;
      __IOM uint32 B2BSTUP    : 1;            /*!< [6..6] B2BSTUP                                                            */
            uint32            : 25;
    } bit;
  } OTG_FS_DOEPINT1;
  __IM  uint32  RESERVED31;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000330) device OUT endpoint-1 transfer size register               */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 RXDPID_STUPCNT : 2;        /*!< [30..29] Received data PID/SETUP packet count                             */
            uint32            : 1;
    } bit;
  } OTG_FS_DOEPTSIZ1;
  __IM  uint32  RESERVED32[3];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000340) device endpoint-2 control register                         */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] MPSIZ                                                             */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USBAEP                                                           */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] EONUM/DPID                                                       */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAKSTS                                                           */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] EPTYP                                                            */
      __IOM uint32 SNPM       : 1;            /*!< [20..20] SNPM                                                             */
      __IOM uint32 Stall      : 1;            /*!< [21..21] Stall                                                            */
            uint32            : 4;
      __OM  uint32 CNAK       : 1;            /*!< [26..26] CNAK                                                             */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] SNAK                                                             */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] SD0PID/SEVNFRM                                                   */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] SODDFRM                                                          */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] EPDIS                                                            */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] EPENA                                                            */
    } bit;
  } OTG_FS_DOEPCTL2;
  __IM  uint32  RESERVED33;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000348) device endpoint-2 interrupt register                       */
    
