Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] XFRC                                                               */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] EPDISD                                                             */
            uint32            : 1;
      __IOM uint32 STUP       : 1;            /*!< [3..3] STUP                                                               */
      __IOM uint32 OTEPDIS    : 1;            /*!< [4..4] OTEPDIS                                                            */
            uint32            : 1;
      __IOM uint32 B2BSTUP    : 1;            /*!< [6..6] B2BSTUP                                                            */
            uint32            : 25;
    } bit;
  } OTG_FS_DOEPINT2;
  __IM  uint32  RESERVED34;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000350) device OUT endpoint-2 transfer size register               */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 RXDPID_STUPCNT : 2;        /*!< [30..29] Received data PID/SETUP packet count                             */
            uint32            : 1;
    } bit;
  } OTG_FS_DOEPTSIZ2;
  __IM  uint32  RESERVED35[3];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000360) device endpoint-3 control register                         */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] MPSIZ                                                             */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USBAEP                                                           */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] EONUM/DPID                                                       */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAKSTS                                                           */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] EPTYP                                                            */
      __IOM uint32 SNPM       : 1;            /*!< [20..20] SNPM                                                             */
      __IOM uint32 Stall      : 1;            /*!< [21..21] Stall                                                            */
            uint32            : 4;
      __OM  uint32 CNAK       : 1;            /*!< [26..26] CNAK                                                             */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] SNAK                                                             */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] SD0PID/SEVNFRM                                                   */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] SODDFRM                                                          */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] EPDIS                                                            */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] EPENA                                                            */
    } bit;
  } OTG_FS_DOEPCTL3;
  __IM  uint32  RESERVED36;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000368) device endpoint-3 interrupt register                       */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] XFRC                                                               */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] EPDISD                                                             */
            uint32            : 1;
      __IOM uint32 STUP       : 1;            /*!< [3..3] STUP                                                               */
      __IOM uint32 OTEPDIS    : 1;            /*!< [4..4] OTEPDIS                                                            */
            uint32            : 1;
      __IOM uint32 B2BSTUP    : 1;            /*!< [6..6] B2BSTUP                                                            */
            uint32            : 25;
    } bit;
  } OTG_FS_DOEPINT3;
  __IM  uint32  RESERVED37;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000370) device OUT endpoint-3 transfer size register               */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 RXDPID_STUPCNT : 2;        /*!< [30..29] Received data PID/SETUP packet count                             */
            uint32            : 1;
    } bit;
  } OTG_FS_DOEPTSIZ3;
  __IM  uint32  RESERVED38;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000378) device endpoint-4 control register                         */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] MPSIZ                                                             */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USBAEP                                                           */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] EONUM/DPID                                                       */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAKSTS                                                           */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] EPTYP                                                            */
      __IOM uint32 SNPM       : 1;            /*!< [20..20] SNPM                                                             */
      __IOM uint32 Stall      : 1;            /*!< [21..21] Stall                                                            */
            uint32            : 4;
      __OM  uint32 CNAK       : 1;            /*!< [26..26] CNAK                                                             */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] SNAK                                                             */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] SD0PID/SEVNFRM                                                   */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] SODDFRM                                                          */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] EPDIS                                                            */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] EPENA                                                            */
    } bit;
  } OTG_FS_DOEPCTL4;
  __IM  uint32  RESERVED39;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000380) device endpoint-4 interrupt register                       */
    
