Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] XFRC                                                               */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] EPDISD                                                             */
            uint32            : 1;
      __IOM uint32 STUP       : 1;            /*!< [3..3] STUP                                                               */
      __IOM uint32 OTEPDIS    : 1;            /*!< [4..4] OTEPDIS                                                            */
            uint32            : 1;
      __IOM uint32 B2BSTUP    : 1;            /*!< [6..6] B2BSTUP                                                            */
            uint32            : 25;
    } bit;
  } OTG_FS_DOEPINT4;
  __IM  uint32  RESERVED40;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000388) device OUT endpoint-4 transfer size register               */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 RXDPID_STUPCNT : 2;        /*!< [30..29] Received data PID/SETUP packet count                             */
            uint32            : 1;
    } bit;
  } OTG_FS_DOEPTSIZ4;
  __IM  uint32  RESERVED41;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000390) device endpoint-5 control register                         */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] MPSIZ                                                             */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USBAEP                                                           */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] EONUM/DPID                                                       */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAKSTS                                                           */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] EPTYP                                                            */
      __IOM uint32 SNPM       : 1;            /*!< [20..20] SNPM                                                             */
      __IOM uint32 Stall      : 1;            /*!< [21..21] Stall                                                            */
            uint32            : 4;
      __OM  uint32 CNAK       : 1;            /*!< [26..26] CNAK                                                             */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] SNAK                                                             */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] SD0PID/SEVNFRM                                                   */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] SODDFRM                                                          */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] EPDIS                                                            */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] EPENA                                                            */
    } bit;
  } OTG_FS_DOEPCTL5;
  __IM  uint32  RESERVED42;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000398) device endpoint-5 interrupt register                       */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] XFRC                                                               */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] EPDISD                                                             */
            uint32            : 1;
      __IOM uint32 STUP       : 1;            /*!< [3..3] STUP                                                               */
      __IOM uint32 OTEPDIS    : 1;            /*!< [4..4] OTEPDIS                                                            */
            uint32            : 1;
      __IOM uint32 B2BSTUP    : 1;            /*!< [6..6] B2BSTUP                                                            */
            uint32            : 25;
    } bit;
  } OTG_FS_DOEPINT5;
  __IM  uint32  RESERVED43;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000003A0) device OUT endpoint-5 transfer size register               */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 RXDPID_STUPCNT : 2;        /*!< [30..29] Received data PID/SETUP packet count                             */
            uint32            : 1;
    } bit;
  } OTG_FS_DOEPTSIZ5;
} OTG_FS_DEVICE_Type;                           /*!< Size = 932 (0x3a4)                                                        */



/* =========================================================================================================================== */
/* ================                                       OTG_FS_PWRCLK                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go full speed (OTG_FS_PWRCLK)
  */

typedef struct {                                /*!< (@ 0x50000E00) OTG_FS_PWRCLK Structure                                    */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) OTG_FS power and clock gating control register
                                                                    (OTG_FS_PCGCCTL)                                           */
    
    struct {
      __IOM uint32 STPPCLK    : 1;            /*!< [0..0] Stop PHY clock                                                     */
      __IOM uint32 GATEHCLK   : 1;            /*!< [1..1] Gate HCLK                                                          */
            uint32            : 2;
      __IOM uint32 PHYSUSP    : 1;            /*!< [4..4] PHY Suspended                                                      */
            uint32            : 27;
    } bit;
  } OTG_FS_PCGCCTL;
} OTG_FS_PWRCLK_Type;                           /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                       OTG_HS_GLOBAL                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go high speed (OTG_HS_GLOBAL)
  */

typedef struct {                                /*!< (@ 0x40040000) OTG_HS_GLOBAL Structure                                    */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) OTG_HS control and status register                         */
    
