Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 SRQSCS     : 1;            /*!< [0..0] Session request success                                            */
      __IOM uint32 SRQ        : 1;            /*!< [1..1] Session request                                                    */
            uint32            : 6;
      __IM  uint32 HNGSCS     : 1;            /*!< [8..8] Host negotiation success                                           */
      __IOM uint32 HNPRQ      : 1;            /*!< [9..9] HNP request                                                        */
      __IOM uint32 HSHNPEN    : 1;            /*!< [10..10] Host set HNP enable                                              */
      __IOM uint32 DHNPEN     : 1;            /*!< [11..11] Device HNP enabled                                               */
      __IOM uint32 EHEN       : 1;            /*!< [12..12] Embedded host enable                                             */
            uint32            : 3;
      __IM  uint32 CIDSTS     : 1;            /*!< [16..16] Connector ID status                                              */
      __IM  uint32 DBCT       : 1;            /*!< [17..17] Long/short debounce time                                         */
      __IM  uint32 ASVLD      : 1;            /*!< [18..18] A-session valid                                                  */
      __IM  uint32 BSVLD      : 1;            /*!< [19..19] B-session valid                                                  */
            uint32            : 12;
    } bit;
  } OTG_HS_GOTGCTL;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) OTG_HS interrupt register                                  */
    
    struct {
            uint32            : 2;
      __IOM uint32 SEDET      : 1;            /*!< [2..2] Session end detected                                               */
            uint32            : 5;
      __IOM uint32 SRSSCHG    : 1;            /*!< [8..8] Session request success status change                              */
      __IOM uint32 HNSSCHG    : 1;            /*!< [9..9] Host negotiation success status change                             */
            uint32            : 7;
      __IOM uint32 HNGDET     : 1;            /*!< [17..17] Host negotiation detected                                        */
      __IOM uint32 ADTOCHG    : 1;            /*!< [18..18] A-device timeout change                                          */
      __IOM uint32 DBCDNE     : 1;            /*!< [19..19] Debounce done                                                    */
      __IOM uint32 IDCHNG     : 1;            /*!< [20..20] ID input pin changed                                             */
            uint32            : 11;
    } bit;
  } OTG_HS_GOTGINT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) OTG_HS AHB configuration register                          */
    
    struct {
      __IOM uint32 GINT       : 1;            /*!< [0..0] Global interrupt mask                                              */
      __IOM uint32 HBSTLEN    : 4;            /*!< [4..1] Burst length/type                                                  */
      __IOM uint32 DMAEN      : 1;            /*!< [5..5] DMA enable                                                         */
            uint32            : 1;
      __IOM uint32 TXFELVL    : 1;            /*!< [7..7] TxFIFO empty level                                                 */
      __IOM uint32 PTXFELVL   : 1;            /*!< [8..8] Periodic TxFIFO empty level                                        */
            uint32            : 23;
    } bit;
  } OTG_HS_GAHBCFG;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) OTG_HS USB configuration register                          */
    
    struct {
      __IOM uint32 TOCAL      : 3;            /*!< [2..0] FS timeout calibration                                             */
            uint32            : 3;
      __OM  uint32 PHYSEL     : 1;            /*!< [6..6] USB 2.0 high-speed ULPI PHY or USB 1.1 full-speed serial
                                                     transceiver select                                                        */
            uint32            : 1;
      __IOM uint32 SRPCAP     : 1;            /*!< [8..8] SRP-capable                                                        */
      __IOM uint32 HNPCAP     : 1;            /*!< [9..9] HNP-capable                                                        */
      __IOM uint32 TRDT       : 4;            /*!< [13..10] USB turnaround time                                              */
            uint32            : 1;
      __IOM uint32 PHYLPCS    : 1;            /*!< [15..15] PHY Low-power clock select                                       */
            uint32            : 1;
      __IOM uint32 ULPIFSLS   : 1;            /*!< [17..17] ULPI FS/LS select                                                */
      __IOM uint32 ULPIAR     : 1;            /*!< [18..18] ULPI Auto-resume                                                 */
      __IOM uint32 ULPICSM    : 1;            /*!< [19..19] ULPI Clock SuspendM                                              */
      __IOM uint32 ULPIEVBUSD : 1;            /*!< [20..20] ULPI External VBUS Drive                                         */
      __IOM uint32 ULPIEVBUSI : 1;            /*!< [21..21] ULPI external VBUS indicator                                     */
      __IOM uint32 TSDPS      : 1;            /*!< [22..22] TermSel DLine pulsing selection                                  */
      __IOM uint32 PCCI       : 1;            /*!< [23..23] Indicator complement                                             */
      __IOM uint32 PTCI       : 1;            /*!< [24..24] Indicator pass through                                           */
      __IOM uint32 ULPIIPD    : 1;            /*!< [25..25] ULPI interface protect disable                                   */
            uint32            : 3;
      __IOM uint32 FHMOD      : 1;            /*!< [29..29] Forced host mode                                                 */
      __IOM uint32 FDMOD      : 1;            /*!< [30..30] Forced peripheral mode                                           */
            uint32            : 1;
    } bit;
  } OTG_HS_GUSBCFG;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) OTG_HS reset register                                      */
    
