Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 CSRST      : 1;            /*!< [0..0] Core soft reset                                                    */
      __IOM uint32 HSRST      : 1;            /*!< [1..1] HCLK soft reset                                                    */
      __IOM uint32 FCRST      : 1;            /*!< [2..2] Host frame counter reset                                           */
            uint32            : 1;
      __IOM uint32 RXFFLSH    : 1;            /*!< [4..4] RxFIFO flush                                                       */
      __IOM uint32 TXFFLSH    : 1;            /*!< [5..5] TxFIFO flush                                                       */
      __IOM uint32 TXFNUM     : 5;            /*!< [10..6] TxFIFO number                                                     */
            uint32            : 19;
      __IM  uint32 DMAREQ     : 1;            /*!< [30..30] DMA request signal enabled for USB OTG HS                        */
      __IM  uint32 AHBIDL     : 1;            /*!< [31..31] AHB master idle                                                  */
    } bit;
  } OTG_HS_GRSTCTL;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) OTG_HS core interrupt register                             */
    
    struct {
      __IM  uint32 CMOD       : 1;            /*!< [0..0] Current mode of operation                                          */
      __IOM uint32 MMIS       : 1;            /*!< [1..1] Mode mismatch interrupt                                            */
      __IM  uint32 OTGINT     : 1;            /*!< [2..2] OTG interrupt                                                      */
      __IOM uint32 SOF        : 1;            /*!< [3..3] Start of frame                                                     */
      __IM  uint32 RXFLVL     : 1;            /*!< [4..4] RxFIFO nonempty                                                    */
      __IM  uint32 NPTXFE     : 1;            /*!< [5..5] Nonperiodic TxFIFO empty                                           */
      __IM  uint32 GINAKEFF   : 1;            /*!< [6..6] Global IN nonperiodic NAK effective                                */
      __IM  uint32 BOUTNAKEFF : 1;            /*!< [7..7] Global OUT NAK effective                                           */
            uint32            : 2;
      __IOM uint32 ESUSP      : 1;            /*!< [10..10] Early suspend                                                    */
      __IOM uint32 USBSUSP    : 1;            /*!< [11..11] USB suspend                                                      */
      __IOM uint32 USBRST     : 1;            /*!< [12..12] USB reset                                                        */
      __IOM uint32 ENUMDNE    : 1;            /*!< [13..13] Enumeration done                                                 */
      __IOM uint32 ISOODRP    : 1;            /*!< [14..14] Isochronous OUT packet dropped interrupt                         */
      __IOM uint32 EOPF       : 1;            /*!< [15..15] End of periodic frame interrupt                                  */
            uint32            : 2;
      __IM  uint32 IEPINT     : 1;            /*!< [18..18] IN endpoint interrupt                                            */
      __IM  uint32 OEPINT     : 1;            /*!< [19..19] OUT endpoint interrupt                                           */
      __IOM uint32 IISOIXFR   : 1;            /*!< [20..20] Incomplete isochronous IN transfer                               */
      __IOM uint32 PXFR_INCOMPISOOUT : 1;     /*!< [21..21] Incomplete periodic transfer                                     */
      __IOM uint32 DATAFSUSP  : 1;            /*!< [22..22] Data fetch suspended                                             */
            uint32            : 1;
      __IM  uint32 HPRTINT    : 1;            /*!< [24..24] Host port interrupt                                              */
      __IM  uint32 HCINT      : 1;            /*!< [25..25] Host channels interrupt                                          */
      __IM  uint32 PTXFE      : 1;            /*!< [26..26] Periodic TxFIFO empty                                            */
            uint32            : 1;
      __IOM uint32 CIDSCHG    : 1;            /*!< [28..28] Connector ID status change                                       */
      __IOM uint32 DISCINT    : 1;            /*!< [29..29] Disconnect detected interrupt                                    */
      __IOM uint32 SRQINT     : 1;            /*!< [30..30] Session request/new session detected interrupt                   */
      __IOM uint32 WKUINT     : 1;            /*!< [31..31] Resume/remote wakeup detected interrupt                          */
    } bit;
  } OTG_HS_GINTSTS;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) OTG_HS interrupt mask register                             */
    
    struct {
            uint32            : 1;
      __IOM uint32 MMISM      : 1;            /*!< [1..1] Mode mismatch interrupt mask                                       */
      __IOM uint32 OTGINT     : 1;            /*!< [2..2] OTG interrupt mask                                                 */
      __IOM uint32 SOFM       : 1;            /*!< [3..3] Start of frame mask                                                */
      __IOM uint32 RXFLVLM    : 1;            /*!< [4..4] Receive FIFO nonempty mask                                         */
      __IOM uint32 NPTXFEM    : 1;            /*!< [5..5] Nonperiodic TxFIFO empty mask                                      */
      __IOM uint32 GINAKEFFM  : 1;            /*!< [6..6] Global nonperiodic IN NAK effective mask                           */
      __IOM uint32 GONAKEFFM  : 1;            /*!< [7..7] Global OUT NAK effective mask                                      */
            uint32            : 2;
      __IOM uint32 ESUSPM     : 1;            /*!< [10..10] Early suspend mask                                               */
      __IOM uint32 USBSUSPM   : 1;            /*!< [11..11] USB suspend mask                                                 */
      __IOM uint32 USBRST     : 1;            /*!< [12..12] USB reset mask                                                   */
      __IOM uint32 ENUMDNEM   : 1;            /*!< [13..13] Enumeration done mask                                            */
      __IOM uint32 ISOODRPM   : 1;            /*!< [14..14] Isochronous OUT packet dropped interrupt mask                    */
      __IOM uint32 EOPFM      : 1;            /*!< [15..15] End of periodic frame interrupt mask                             */
            uint32            : 2;
      __IOM uint32 IEPINT     : 1;            /*!< [18..18] IN endpoints interrupt mask                                      */
      __IOM uint32 OEPINT     : 1;            /*!< [19..19] OUT endpoints interrupt mask                                     */
      __IOM uint32 IISOIXFRM  : 1;            /*!< [20..20] Incomplete isochronous IN transfer mask                          */
      __IOM uint32 PXFRM_IISOOXFRM : 1;       /*!< [21..21] Incomplete periodic transfer mask                                */
      __IOM uint32 FSUSPM     : 1;            /*!< [22..22] Data fetch suspended mask                                        */
      __IOM uint32 RSTDE      : 1;            /*!< [23..23] Reset detected interrupt mask                                    */
      __IM  uint32 PRTIM      : 1;            /*!< [24..24] Host port interrupt mask                                         */
      __IOM uint32 HCIM       : 1;            /*!< [25..25] Host channels interrupt mask                                     */
      __IOM uint32 PTXFEM     : 1;            /*!< [26..26] Periodic TxFIFO empty mask                                       */
      __IOM uint32 LPMINTM    : 1;            /*!< [27..27] LPM interrupt mask                                               */
      __IOM uint32 CIDSCHGM   : 1;            /*!< [28..28] Connector ID status change mask                                  */
      __IOM uint32 DISCINT    : 1;            /*!< [29..29] Disconnect detected interrupt mask                               */
      __IOM uint32 SRQIM      : 1;            /*!< [30..30] Session request/new session detected interrupt mask              */
      __IOM uint32 WUIM       : 1;            /*!< [31..31] Resume/remote wakeup detected interrupt mask                     */
    } bit;
  } OTG_HS_GINTMSK;
  
  union {
    union {
      __IM  uint32 reg;                       /*!< (@ 0x0000001C) OTG_HS Receive status debug read register (host
                                                                    mode)                                                      */
      
