Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
      struct {
        __IM  uint32 CHNUM    : 4;            /*!< [3..0] Channel number                                                     */
        __IM  uint32 BCNT     : 11;           /*!< [14..4] Byte count                                                        */
        __IM  uint32 DPID     : 2;            /*!< [16..15] Data PID                                                         */
        __IM  uint32 PKTSTS   : 4;            /*!< [20..17] Packet status                                                    */
              uint32          : 11;
      } bit;
    } OTG_HS_GRXSTSR_Host;
    
    union {
      __IM  uint32 reg;                       /*!< (@ 0x0000001C) OTG_HS Receive status debug read register (peripheral
                                                                    mode mode)                                                 */
      
      struct {
        __IM  uint32 EPNUM    : 4;            /*!< [3..0] Endpoint number                                                    */
        __IM  uint32 BCNT     : 11;           /*!< [14..4] Byte count                                                        */
        __IM  uint32 DPID     : 2;            /*!< [16..15] Data PID                                                         */
        __IM  uint32 PKTSTS   : 4;            /*!< [20..17] Packet status                                                    */
        __IM  uint32 FRMNUM   : 4;            /*!< [24..21] Frame number                                                     */
              uint32          : 7;
      } bit;
    } OTG_HS_GRXSTSR_Device;
  };
  
  union {
    union {
      __IM  uint32 reg;                       /*!< (@ 0x00000020) OTG_HS status read and pop register (host mode)            */
      
      struct {
        __IM  uint32 CHNUM    : 4;            /*!< [3..0] Channel number                                                     */
        __IM  uint32 BCNT     : 11;           /*!< [14..4] Byte count                                                        */
        __IM  uint32 DPID     : 2;            /*!< [16..15] Data PID                                                         */
        __IM  uint32 PKTSTS   : 4;            /*!< [20..17] Packet status                                                    */
              uint32          : 11;
      } bit;
    } OTG_HS_GRXSTSP_Host;
    
    union {
      __IM  uint32 reg;                       /*!< (@ 0x00000020) OTG_HS status read and pop register (peripheral
                                                                    mode)                                                      */
      
      struct {
        __IM  uint32 EPNUM    : 4;            /*!< [3..0] Endpoint number                                                    */
        __IM  uint32 BCNT     : 11;           /*!< [14..4] Byte count                                                        */
        __IM  uint32 DPID     : 2;            /*!< [16..15] Data PID                                                         */
        __IM  uint32 PKTSTS   : 4;            /*!< [20..17] Packet status                                                    */
        __IM  uint32 FRMNUM   : 4;            /*!< [24..21] Frame number                                                     */
              uint32          : 7;
      } bit;
    } OTG_HS_GRXSTSP_Device;
  };
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) OTG_HS Receive FIFO size register                          */
    
    struct {
      __IOM uint32 RXFD       : 16;           /*!< [15..0] RxFIFO depth                                                      */
            uint32            : 16;
    } bit;
  } OTG_HS_GRXFSIZ;
  
  union {
    union {
      __IOM uint32 reg;                       /*!< (@ 0x00000028) OTG_HS nonperiodic transmit FIFO size register
                                                                    (host mode)                                                */
      
      struct {
        __IOM uint32 NPTXFSA  : 16;           /*!< [15..0] Nonperiodic transmit RAM start address                            */
        __IOM uint32 NPTXFD   : 16;           /*!< [31..16] Nonperiodic TxFIFO depth                                         */
      } bit;
    } OTG_HS_HNPTXFSIZ_Host;
    
    union {
      __IOM uint32 reg;                       /*!< (@ 0x00000028) Endpoint 0 transmit FIFO size (peripheral mode)            */
      
      struct {
        __IOM uint32 TX0FSA   : 16;           /*!< [15..0] Endpoint 0 transmit RAM start address                             */
        __IOM uint32 TX0FD    : 16;           /*!< [31..16] Endpoint 0 TxFIFO depth                                          */
      } bit;
    } OTG_HS_DIEPTXF0_Device;
  };
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x0000002C) OTG_HS nonperiodic transmit FIFO/queue status
                                                                    register                                                   */
    
    struct {
      __IM  uint32 NPTXFSAV   : 16;           /*!< [15..0] Nonperiodic TxFIFO space available                                */
      __IM  uint32 NPTQXSAV   : 8;            /*!< [23..16] Nonperiodic transmit request queue space available               */
      __IM  uint32 NPTXQTOP   : 7;            /*!< [30..24] Top of the nonperiodic transmit request queue                    */
            uint32            : 1;
    } bit;
  } OTG_HS_GNPTXSTS;
  __IM  uint32  RESERVED[2];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000038) OTG_HS general core configuration register                 */
    
    struct {
      __IOM uint32 DCDET      : 1;            /*!< [0..0] Data contact detection (DCD) status                                */
      __IOM uint32 PDET       : 1;            /*!< [1..1] Primary detection (PD) status                                      */
      __IOM uint32 SDET       : 1;            /*!< [2..2] Secondary detection (SD) status                                    */
      __IOM uint32 PS2DET     : 1;            /*!< [3..3] DM pull-up detection status                                        */
            uint32            : 12;
      __IOM uint32 PWRDWN     : 1;            /*!< [16..16] Power down                                                       */
      __IOM uint32 BCDEN      : 1;            /*!< [17..17] Battery charging detector (BCD) enable                           */
      __IOM uint32 DCDEN      : 1;            /*!< [18..18] Data contact detection (DCD) mode enable                         */
      __IOM uint32 PDEN       : 1;            /*!< [19..19] Primary detection (PD) mode enable                               */
      __IOM uint32 SDEN       : 1;            /*!< [20..20] Secondary detection (SD) mode enable                             */
      __IOM uint32 VBDEN      : 1;            /*!< [21..21] USB VBUS detection enable                                        */
            uint32            : 10;
    } bit;
  } OTG_HS_GCCFG;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000003C) OTG_HS core ID register                                    */
    
