Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 PRODUCT_ID : 32;           /*!< [31..0] Product ID field                                                  */
    } bit;
  } OTG_HS_CID;
  __IM  uint32  RESERVED1[5];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000054) OTG core LPM configuration register                        */
    
    struct {
      __IOM uint32 LPMEN      : 1;            /*!< [0..0] LPM support enable                                                 */
      __IOM uint32 LPMACK     : 1;            /*!< [1..1] LPM token acknowledge enable                                       */
      __IM  uint32 BESL       : 4;            /*!< [5..2] Best effort service latency                                        */
      __IM  uint32 REMWAKE    : 1;            /*!< [6..6] bRemoteWake value                                                  */
      __IOM uint32 L1SSEN     : 1;            /*!< [7..7] L1 Shallow Sleep enable                                            */
      __IOM uint32 BESLTHRS   : 4;            /*!< [11..8] BESL threshold                                                    */
      __IOM uint32 L1DSEN     : 1;            /*!< [12..12] L1 deep sleep enable                                             */
      __IM  uint32 LPMRST     : 2;            /*!< [14..13] LPM response                                                     */
      __IM  uint32 SLPSTS     : 1;            /*!< [15..15] Port sleep status                                                */
      __IM  uint32 L1RSMOK    : 1;            /*!< [16..16] Sleep State Resume OK                                            */
      __IOM uint32 LPMCHIDX   : 4;            /*!< [20..17] LPM Channel Index                                                */
      __IOM uint32 LPMRCNT    : 3;            /*!< [23..21] LPM retry count                                                  */
      __IOM uint32 SNDLPM     : 1;            /*!< [24..24] Send LPM transaction                                             */
      __IM  uint32 LPMRCNTSTS : 3;            /*!< [27..25] LPM retry count status                                           */
      __IOM uint32 ENBESL     : 1;            /*!< [28..28] Enable best effort service latency                               */
            uint32            : 3;
    } bit;
  } OTG_HS_GLPMCFG;
  __IM  uint32  RESERVED2[42];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000100) OTG_HS Host periodic transmit FIFO size register           */
    
    struct {
      __IOM uint32 PTXSA      : 16;           /*!< [15..0] Host periodic TxFIFO start address                                */
      __IOM uint32 PTXFD      : 16;           /*!< [31..16] Host periodic TxFIFO depth                                       */
    } bit;
  } OTG_HS_HPTXFSIZ;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000104) OTG_HS device IN endpoint transmit FIFO size
                                                                    register                                                   */
    
    struct {
      __IOM uint32 INEPTXSA   : 16;           /*!< [15..0] IN endpoint FIFOx transmit RAM start address                      */
      __IOM uint32 INEPTXFD   : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } bit;
  } OTG_HS_DIEPTXF1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000108) OTG_HS device IN endpoint transmit FIFO size
                                                                    register                                                   */
    
    struct {
      __IOM uint32 INEPTXSA   : 16;           /*!< [15..0] IN endpoint FIFOx transmit RAM start address                      */
      __IOM uint32 INEPTXFD   : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } bit;
  } OTG_HS_DIEPTXF2;
  __IM  uint32  RESERVED3[4];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000011C) OTG_HS device IN endpoint transmit FIFO size
                                                                    register                                                   */
    
    struct {
      __IOM uint32 INEPTXSA   : 16;           /*!< [15..0] IN endpoint FIFOx transmit RAM start address                      */
      __IOM uint32 INEPTXFD   : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } bit;
  } OTG_HS_DIEPTXF3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000120) OTG_HS device IN endpoint transmit FIFO size
                                                                    register                                                   */
    
    struct {
      __IOM uint32 INEPTXSA   : 16;           /*!< [15..0] IN endpoint FIFOx transmit RAM start address                      */
      __IOM uint32 INEPTXFD   : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } bit;
  } OTG_HS_DIEPTXF4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000124) OTG_HS device IN endpoint transmit FIFO size
                                                                    register                                                   */
    
    struct {
      __IOM uint32 INEPTXSA   : 16;           /*!< [15..0] IN endpoint FIFOx transmit RAM start address                      */
      __IOM uint32 INEPTXFD   : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } bit;
  } OTG_HS_DIEPTXF5;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000128) OTG_HS device IN endpoint transmit FIFO size
                                                                    register                                                   */
    
    struct {
      __IOM uint32 INEPTXSA   : 16;           /*!< [15..0] IN endpoint FIFOx transmit RAM start address                      */
      __IOM uint32 INEPTXFD   : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } bit;
  } OTG_HS_DIEPTXF6;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000012C) OTG_HS device IN endpoint transmit FIFO size
                                                                    register                                                   */
    
