Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 INEPTXSA   : 16;           /*!< [15..0] IN endpoint FIFOx transmit RAM start address                      */
      __IOM uint32 INEPTXFD   : 16;           /*!< [31..16] IN endpoint TxFIFO depth                                         */
    } bit;
  } OTG_HS_DIEPTXF7;
} OTG_HS_GLOBAL_Type;                           /*!< Size = 304 (0x130)                                                        */



/* =========================================================================================================================== */
/* ================                                        OTG_HS_HOST                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go high speed (OTG_HS_HOST)
  */

typedef struct {                                /*!< (@ 0x40040400) OTG_HS_HOST Structure                                      */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) OTG_HS host configuration register                         */
    
    struct {
      __IOM uint32 FSLSPCS    : 2;            /*!< [1..0] FS/LS PHY clock select                                             */
      __IM  uint32 FSLSS      : 1;            /*!< [2..2] FS- and LS-only support                                            */
            uint32            : 29;
    } bit;
  } OTG_HS_HCFG;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) OTG_HS Host frame interval register                        */
    
    struct {
      __IOM uint32 FRIVL      : 16;           /*!< [15..0] Frame interval                                                    */
            uint32            : 16;
    } bit;
  } OTG_HS_HFIR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000008) OTG_HS host frame number/frame time remaining
                                                                    register                                                   */
    
    struct {
      __IM  uint32 FRNUM      : 16;           /*!< [15..0] Frame number                                                      */
      __IM  uint32 FTREM      : 16;           /*!< [31..16] Frame time remaining                                             */
    } bit;
  } OTG_HS_HFNUM;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) OTG_HS_Host periodic transmit FIFO/queue status
                                                                    register                                                   */
    
    struct {
      __IOM uint32 PTXFSAVL   : 16;           /*!< [15..0] Periodic transmit data FIFO space available                       */
      __IM  uint32 PTXQSAV    : 8;            /*!< [23..16] Periodic transmit request queue space available                  */
      __IM  uint32 PTXQTOP    : 8;            /*!< [31..24] Top of the periodic transmit request queue                       */
    } bit;
  } OTG_HS_HPTXSTS;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000014) OTG_HS Host all channels interrupt register                */
    
    struct {
      __IM  uint32 HAINT      : 16;           /*!< [15..0] Channel interrupts                                                */
            uint32            : 16;
    } bit;
  } OTG_HS_HAINT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) OTG_HS host all channels interrupt mask register           */
    
    struct {
      __IOM uint32 HAINTM     : 16;           /*!< [15..0] Channel interrupt mask                                            */
            uint32            : 16;
    } bit;
  } OTG_HS_HAINTMSK;
  __IM  uint32  RESERVED1[9];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000040) OTG_HS host port control and status register               */
    
    struct {
      __IM  uint32 PCSTS      : 1;            /*!< [0..0] Port connect status                                                */
      __IOM uint32 PCDET      : 1;            /*!< [1..1] Port connect detected                                              */
      __IOM uint32 PENA       : 1;            /*!< [2..2] Port enable                                                        */
      __IOM uint32 PENCHNG    : 1;            /*!< [3..3] Port enable/disable change                                         */
      __IM  uint32 POCA       : 1;            /*!< [4..4] Port overcurrent active                                            */
      __IOM uint32 POCCHNG    : 1;            /*!< [5..5] Port overcurrent change                                            */
      __IOM uint32 PRES       : 1;            /*!< [6..6] Port resume                                                        */
      __IOM uint32 PSUSP      : 1;            /*!< [7..7] Port suspend                                                       */
      __IOM uint32 PRST       : 1;            /*!< [8..8] Port reset                                                         */
            uint32            : 1;
      __IM  uint32 PLSTS      : 2;            /*!< [11..10] Port line status                                                 */
      __IOM uint32 PPWR       : 1;            /*!< [12..12] Port power                                                       */
      __IOM uint32 PTCTL      : 4;            /*!< [16..13] Port test control                                                */
      __IM  uint32 PSPD       : 2;            /*!< [18..17] Port speed                                                       */
            uint32            : 13;
    } bit;
  } OTG_HS_HPRT;
  __IM  uint32  RESERVED2[47];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000100) OTG_HS host channel-0 characteristics register             */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] Maximum packet size                                               */
      __IOM uint32 EPNUM      : 4;            /*!< [14..11] Endpoint number                                                  */
      __IOM uint32 EPDIR      : 1;            /*!< [15..15] Endpoint direction                                               */
            uint32            : 1;
      __IOM uint32 LSDEV      : 1;            /*!< [17..17] Low-speed device                                                 */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] Endpoint type                                                    */
      __IOM uint32 MC         : 2;            /*!< [21..20] Multi Count (MC) / Error Count (EC)                              */
      __IOM uint32 DAD        : 7;            /*!< [28..22] Device address                                                   */
      __IOM uint32 ODDFRM     : 1;            /*!< [29..29] Odd frame                                                        */
      __IOM uint32 CHDIS      : 1;            /*!< [30..30] Channel disable                                                  */
      __IOM uint32 CHENA      : 1;            /*!< [31..31] Channel enable                                                   */
    } bit;
  } OTG_HS_HCCHAR0;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000104) OTG_HS host channel-0 split control register               */
    
