Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 PRTADDR    : 7;            /*!< [6..0] Port address                                                       */
      __IOM uint32 HUBADDR    : 7;            /*!< [13..7] Hub address                                                       */
      __IOM uint32 XACTPOS    : 2;            /*!< [15..14] XACTPOS                                                          */
      __IOM uint32 COMPLSPLT  : 1;            /*!< [16..16] Do complete split                                                */
            uint32            : 14;
      __IOM uint32 SPLITEN    : 1;            /*!< [31..31] Split enable                                                     */
    } bit;
  } OTG_HS_HCSPLT11;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000268) OTG_HS host channel-11 interrupt register                  */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] Transfer completed                                                 */
      __IOM uint32 CHH        : 1;            /*!< [1..1] Channel halted                                                     */
      __IOM uint32 AHBERR     : 1;            /*!< [2..2] AHB error                                                          */
      __IOM uint32 STALL      : 1;            /*!< [3..3] STALL response received interrupt                                  */
      __IOM uint32 NAK        : 1;            /*!< [4..4] NAK response received interrupt                                    */
      __IOM uint32 ACK        : 1;            /*!< [5..5] ACK response received/transmitted interrupt                        */
      __IOM uint32 NYET       : 1;            /*!< [6..6] Response received interrupt                                        */
      __IOM uint32 TXERR      : 1;            /*!< [7..7] Transaction error                                                  */
      __IOM uint32 BBERR      : 1;            /*!< [8..8] Babble error                                                       */
      __IOM uint32 FRMOR      : 1;            /*!< [9..9] Frame overrun                                                      */
      __IOM uint32 DTERR      : 1;            /*!< [10..10] Data toggle error                                                */
            uint32            : 21;
    } bit;
  } OTG_HS_HCINT11;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000026C) OTG_HS host channel-11 interrupt mask register             */
    
    struct {
      __IOM uint32 XFRCM      : 1;            /*!< [0..0] Transfer completed mask                                            */
      __IOM uint32 CHHM       : 1;            /*!< [1..1] Channel halted mask                                                */
      __IOM uint32 AHBERR     : 1;            /*!< [2..2] AHB error                                                          */
      __IOM uint32 STALLM     : 1;            /*!< [3..3] STALL response received interrupt mask                             */
      __IOM uint32 NAKM       : 1;            /*!< [4..4] NAK response received interrupt mask                               */
      __IOM uint32 ACKM       : 1;            /*!< [5..5] ACK response received/transmitted interrupt mask                   */
      __IOM uint32 NYET       : 1;            /*!< [6..6] response received interrupt mask                                   */
      __IOM uint32 TXERRM     : 1;            /*!< [7..7] Transaction error mask                                             */
      __IOM uint32 BBERRM     : 1;            /*!< [8..8] Babble error mask                                                  */
      __IOM uint32 FRMORM     : 1;            /*!< [9..9] Frame overrun mask                                                 */
      __IOM uint32 DTERRM     : 1;            /*!< [10..10] Data toggle error mask                                           */
            uint32            : 21;
    } bit;
  } OTG_HS_HCINTMSK11;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000270) OTG_HS host channel-11 transfer size register              */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 DPID       : 2;            /*!< [30..29] Data PID                                                         */
            uint32            : 1;
    } bit;
  } OTG_HS_HCTSIZ11;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000274) OTG_HS host channel-11 DMA address register                */
    
    struct {
      __IOM uint32 DMAADDR    : 32;           /*!< [31..0] DMA address                                                       */
    } bit;
  } OTG_HS_HCDMA11;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000278) OTG_HS host channel-12 characteristics register            */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] Maximum packet size                                               */
      __IOM uint32 EPNUM      : 4;            /*!< [14..11] Endpoint number                                                  */
      __IOM uint32 EPDIR      : 1;            /*!< [15..15] Endpoint direction                                               */
            uint32            : 1;
      __IOM uint32 LSDEV      : 1;            /*!< [17..17] Low-speed device                                                 */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] Endpoint type                                                    */
      __IOM uint32 MC         : 2;            /*!< [21..20] Multi Count (MC) / Error Count (EC)                              */
      __IOM uint32 DAD        : 7;            /*!< [28..22] Device address                                                   */
      __IOM uint32 ODDFRM     : 1;            /*!< [29..29] Odd frame                                                        */
      __IOM uint32 CHDIS      : 1;            /*!< [30..30] Channel disable                                                  */
      __IOM uint32 CHENA      : 1;            /*!< [31..31] Channel enable                                                   */
    } bit;
  } OTG_HS_HCCHAR12;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000027C) OTG_HS host channel-12 split control register              */
    
