Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 PRTADDR    : 7;            /*!< [6..0] Port address                                                       */
      __IOM uint32 HUBADDR    : 7;            /*!< [13..7] Hub address                                                       */
      __IOM uint32 XACTPOS    : 2;            /*!< [15..14] XACTPOS                                                          */
      __IOM uint32 COMPLSPLT  : 1;            /*!< [16..16] Do complete split                                                */
            uint32            : 14;
      __IOM uint32 SPLITEN    : 1;            /*!< [31..31] Split enable                                                     */
    } bit;
  } OTG_HS_HCSPLT15;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000002C8) OTG_HS host channel-15 interrupt register                  */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] Transfer completed                                                 */
      __IOM uint32 CHH        : 1;            /*!< [1..1] Channel halted                                                     */
      __IOM uint32 AHBERR     : 1;            /*!< [2..2] AHB error                                                          */
      __IOM uint32 STALL      : 1;            /*!< [3..3] STALL response received interrupt                                  */
      __IOM uint32 NAK        : 1;            /*!< [4..4] NAK response received interrupt                                    */
      __IOM uint32 ACK        : 1;            /*!< [5..5] ACK response received/transmitted interrupt                        */
      __IOM uint32 NYET       : 1;            /*!< [6..6] Response received interrupt                                        */
      __IOM uint32 TXERR      : 1;            /*!< [7..7] Transaction error                                                  */
      __IOM uint32 BBERR      : 1;            /*!< [8..8] Babble error                                                       */
      __IOM uint32 FRMOR      : 1;            /*!< [9..9] Frame overrun                                                      */
      __IOM uint32 DTERR      : 1;            /*!< [10..10] Data toggle error                                                */
            uint32            : 21;
    } bit;
  } OTG_HS_HCINT15;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000002CC) OTG_HS host channel-15 interrupt mask register             */
    
    struct {
      __IOM uint32 XFRCM      : 1;            /*!< [0..0] Transfer completed mask                                            */
      __IOM uint32 CHHM       : 1;            /*!< [1..1] Channel halted mask                                                */
      __IOM uint32 AHBERR     : 1;            /*!< [2..2] AHB error                                                          */
      __IOM uint32 STALL      : 1;            /*!< [3..3] STALL response received interrupt mask                             */
      __IOM uint32 NAKM       : 1;            /*!< [4..4] NAK response received interrupt mask                               */
      __IOM uint32 ACKM       : 1;            /*!< [5..5] ACK response received/transmitted interrupt mask                   */
      __IOM uint32 NYET       : 1;            /*!< [6..6] Response received interrupt                                        */
      __IOM uint32 TXERRM     : 1;            /*!< [7..7] Transaction error                                                  */
      __IOM uint32 BBERRM     : 1;            /*!< [8..8] Babble error                                                       */
      __IOM uint32 FRMORM     : 1;            /*!< [9..9] Frame overrun mask                                                 */
      __IOM uint32 DTERRM     : 1;            /*!< [10..10] Data toggle error mask                                           */
            uint32            : 21;
    } bit;
  } OTG_HS_HCINTMSK15;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000002D0) OTG_HS host channel-15 transfer size register              */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 DPID       : 2;            /*!< [30..29] Data PID                                                         */
            uint32            : 1;
    } bit;
  } OTG_HS_HCTSIZ15;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000002D4) OTG_HS host channel-15 DMA address register                */
    
    struct {
      __IOM uint32 DMAADDR    : 32;           /*!< [31..0] DMA address                                                       */
    } bit;
  } OTG_HS_HCDMA15;
} OTG_HS_HOST_Type;                             /*!< Size = 728 (0x2d8)                                                        */



/* =========================================================================================================================== */
/* ================                                       OTG_HS_DEVICE                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go high speed (OTG_HS_DEVICE)
  */

typedef struct {                                /*!< (@ 0x40040800) OTG_HS_DEVICE Structure                                    */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) OTG_HS device configuration register                       */
    
    struct {
      __IOM uint32 DSPD       : 2;            /*!< [1..0] Device speed                                                       */
      __IOM uint32 NZLSOHSK   : 1;            /*!< [2..2] Nonzero-length status OUT handshake                                */
            uint32            : 1;
      __IOM uint32 DAD        : 7;            /*!< [10..4] Device address                                                    */
      __IOM uint32 PFIVL      : 2;            /*!< [12..11] Periodic (micro)frame interval                                   */
            uint32            : 11;
      __IOM uint32 PERSCHIVL  : 2;            /*!< [25..24] Periodic scheduling interval                                     */
            uint32            : 6;
    } bit;
  } OTG_HS_DCFG;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) OTG_HS device control register                             */
    
