Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 RWUSIG     : 1;            /*!< [0..0] Remote wakeup signaling                                            */
      __IOM uint32 SDIS       : 1;            /*!< [1..1] Soft disconnect                                                    */
      __IM  uint32 GINSTS     : 1;            /*!< [2..2] Global IN NAK status                                               */
      __IM  uint32 GONSTS     : 1;            /*!< [3..3] Global OUT NAK status                                              */
      __IOM uint32 TCTL       : 3;            /*!< [6..4] Test control                                                       */
      __OM  uint32 SGINAK     : 1;            /*!< [7..7] Set global IN NAK                                                  */
      __OM  uint32 CGINAK     : 1;            /*!< [8..8] Clear global IN NAK                                                */
      __OM  uint32 SGONAK     : 1;            /*!< [9..9] Set global OUT NAK                                                 */
      __OM  uint32 CGONAK     : 1;            /*!< [10..10] Clear global OUT NAK                                             */
      __IOM uint32 POPRGDNE   : 1;            /*!< [11..11] Power-on programming done                                        */
            uint32            : 20;
    } bit;
  } OTG_HS_DCTL;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000008) OTG_HS device status register                              */
    
    struct {
      __IM  uint32 SUSPSTS    : 1;            /*!< [0..0] Suspend status                                                     */
      __IM  uint32 ENUMSPD    : 2;            /*!< [2..1] Enumerated speed                                                   */
      __IM  uint32 EERR       : 1;            /*!< [3..3] Erratic error                                                      */
            uint32            : 4;
      __IM  uint32 FNSOF      : 14;           /*!< [21..8] Frame number of the received SOF                                  */
            uint32            : 10;
    } bit;
  } OTG_HS_DSTS;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) OTG_HS device IN endpoint common interrupt mask
                                                                    register                                                   */
    
    struct {
      __IOM uint32 XFRCM      : 1;            /*!< [0..0] Transfer completed interrupt mask                                  */
      __IOM uint32 EPDM       : 1;            /*!< [1..1] Endpoint disabled interrupt mask                                   */
            uint32            : 1;
      __IOM uint32 TOM        : 1;            /*!< [3..3] Timeout condition mask (nonisochronous endpoints)                  */
      __IOM uint32 ITTXFEMSK  : 1;            /*!< [4..4] IN token received when TxFIFO empty mask                           */
      __IOM uint32 INEPNMM    : 1;            /*!< [5..5] IN token received with EP mismatch mask                            */
      __IOM uint32 INEPNEM    : 1;            /*!< [6..6] IN endpoint NAK effective mask                                     */
            uint32            : 1;
      __IOM uint32 TXFURM     : 1;            /*!< [8..8] FIFO underrun mask                                                 */
      __IOM uint32 BIM        : 1;            /*!< [9..9] BNA interrupt mask                                                 */
            uint32            : 22;
    } bit;
  } OTG_HS_DIEPMSK;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) OTG_HS device OUT endpoint common interrupt mask
                                                                    register                                                   */
    
    struct {
      __IOM uint32 XFRCM      : 1;            /*!< [0..0] Transfer completed interrupt mask                                  */
      __IOM uint32 EPDM       : 1;            /*!< [1..1] Endpoint disabled interrupt mask                                   */
            uint32            : 1;
      __IOM uint32 STUPM      : 1;            /*!< [3..3] SETUP phase done mask                                              */
      __IOM uint32 OTEPDM     : 1;            /*!< [4..4] OUT token received when endpoint disabled mask                     */
            uint32            : 1;
      __IOM uint32 B2BSTUP    : 1;            /*!< [6..6] Back-to-back SETUP packets received mask                           */
            uint32            : 1;
      __IOM uint32 OPEM       : 1;            /*!< [8..8] OUT packet error mask                                              */
      __IOM uint32 BOIM       : 1;            /*!< [9..9] BNA interrupt mask                                                 */
            uint32            : 22;
    } bit;
  } OTG_HS_DOEPMSK;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000018) OTG_HS device all endpoints interrupt register             */
    
    struct {
      __IM  uint32 IEPINT     : 16;           /*!< [15..0] IN endpoint interrupt bits                                        */
      __IM  uint32 OEPINT     : 16;           /*!< [31..16] OUT endpoint interrupt bits                                      */
    } bit;
  } OTG_HS_DAINT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) OTG_HS all endpoints interrupt mask register               */
    
    struct {
      __IOM uint32 IEPM       : 16;           /*!< [15..0] IN EP interrupt mask bits                                         */
      __IOM uint32 OEPM       : 16;           /*!< [31..16] OUT EP interrupt mask bits                                       */
    } bit;
  } OTG_HS_DAINTMSK;
  __IM  uint32  RESERVED1[2];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) OTG_HS device VBUS discharge time register                 */
    
