Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 VBUSDT     : 16;           /*!< [15..0] Device VBUS discharge time                                        */
            uint32            : 16;
    } bit;
  } OTG_HS_DVBUSDIS;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) OTG_HS device VBUS pulsing time register                   */
    
    struct {
      __IOM uint32 DVBUSP     : 12;           /*!< [11..0] Device VBUS pulsing time                                          */
            uint32            : 20;
    } bit;
  } OTG_HS_DVBUSPULSE;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000030) OTG_HS Device threshold control register                   */
    
    struct {
      __IOM uint32 NONISOTHREN : 1;           /*!< [0..0] Nonisochronous IN endpoints threshold enable                       */
      __IOM uint32 ISOTHREN   : 1;            /*!< [1..1] ISO IN endpoint threshold enable                                   */
      __IOM uint32 TXTHRLEN   : 9;            /*!< [10..2] Transmit threshold length                                         */
            uint32            : 5;
      __IOM uint32 RXTHREN    : 1;            /*!< [16..16] Receive threshold enable                                         */
      __IOM uint32 RXTHRLEN   : 9;            /*!< [25..17] Receive threshold length                                         */
            uint32            : 1;
      __IOM uint32 ARPEN      : 1;            /*!< [27..27] Arbiter parking enable                                           */
            uint32            : 4;
    } bit;
  } OTG_HS_DTHRCTL;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) OTG_HS device IN endpoint FIFO empty interrupt
                                                                    mask register                                              */
    
    struct {
      __IOM uint32 INEPTXFEM  : 16;           /*!< [15..0] IN EP Tx FIFO empty interrupt mask bits                           */
            uint32            : 16;
    } bit;
  } OTG_HS_DIEPEMPMSK;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000038) OTG_HS device each endpoint interrupt register             */
    
    struct {
            uint32            : 1;
      __IOM uint32 IEP1INT    : 1;            /*!< [1..1] IN endpoint 1interrupt bit                                         */
            uint32            : 15;
      __IOM uint32 OEP1INT    : 1;            /*!< [17..17] OUT endpoint 1 interrupt bit                                     */
            uint32            : 14;
    } bit;
  } OTG_HS_DEACHINT;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000003C) OTG_HS device each endpoint interrupt register
                                                                    mask                                                       */
    
    struct {
            uint32            : 1;
      __IOM uint32 IEP1INTM   : 1;            /*!< [1..1] IN Endpoint 1 interrupt mask bit                                   */
            uint32            : 15;
      __IOM uint32 OEP1INTM   : 1;            /*!< [17..17] OUT Endpoint 1 interrupt mask bit                                */
            uint32            : 14;
    } bit;
  } OTG_HS_DEACHINTMSK;
  __IM  uint32  RESERVED2[48];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000100) OTG device endpoint-0 control register                     */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] Maximum packet size                                               */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USB active endpoint                                              */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] Even/odd frame                                                   */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAK status                                                       */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] Endpoint type                                                    */
            uint32            : 1;
      __IOM uint32 Stall      : 1;            /*!< [21..21] STALL handshake                                                  */
      __IOM uint32 TXFNUM     : 4;            /*!< [25..22] TxFIFO number                                                    */
      __OM  uint32 CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] Set DATA0 PID                                                    */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] Set odd frame                                                    */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] Endpoint enable                                                  */
    } bit;
  } OTG_HS_DIEPCTL0;
  __IM  uint32  RESERVED3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000108) OTG device endpoint-0 interrupt register                   */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] Transfer completed interrupt                                       */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] Endpoint disabled interrupt                                        */
            uint32            : 1;
      __IOM uint32 TOC        : 1;            /*!< [3..3] Timeout condition                                                  */
      __IOM uint32 ITTXFE     : 1;            /*!< [4..4] IN token received when TxFIFO is empty                             */
            uint32            : 1;
      __IOM uint32 INEPNE     : 1;            /*!< [6..6] IN endpoint NAK effective                                          */
      __IM  uint32 TXFE       : 1;            /*!< [7..7] Transmit FIFO empty                                                */
      __IOM uint32 TXFIFOUDRN : 1;            /*!< [8..8] Transmit Fifo Underrun                                             */
      __IOM uint32 BNA        : 1;            /*!< [9..9] Buffer not available interrupt                                     */
            uint32            : 1;
      __IOM uint32 PKTDRPSTS  : 1;            /*!< [11..11] Packet dropped status                                            */
      __IOM uint32 BERR       : 1;            /*!< [12..12] Babble error interrupt                                           */
      __IOM uint32 NAK        : 1;            /*!< [13..13] NAK interrupt                                                    */
            uint32            : 18;
    } bit;
  } OTG_HS_DIEPINT0;
  __IM  uint32  RESERVED4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000110) OTG_HS device IN endpoint 0 transfer size register         */
    
