Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 INEPTFSAV  : 16;           /*!< [15..0] IN endpoint TxFIFO space avail                                    */
            uint32            : 16;
    } bit;
  } OTG_HS_DTXFSTS1;
  __IM  uint32  RESERVED8;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000140) OTG device endpoint-2 control register                     */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] Maximum packet size                                               */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USB active endpoint                                              */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] Even/odd frame                                                   */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAK status                                                       */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] Endpoint type                                                    */
            uint32            : 1;
      __IOM uint32 Stall      : 1;            /*!< [21..21] STALL handshake                                                  */
      __IOM uint32 TXFNUM     : 4;            /*!< [25..22] TxFIFO number                                                    */
      __OM  uint32 CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] Set DATA0 PID                                                    */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] Set odd frame                                                    */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] Endpoint enable                                                  */
    } bit;
  } OTG_HS_DIEPCTL2;
  __IM  uint32  RESERVED9;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000148) OTG device endpoint-2 interrupt register                   */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] Transfer completed interrupt                                       */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] Endpoint disabled interrupt                                        */
            uint32            : 1;
      __IOM uint32 TOC        : 1;            /*!< [3..3] Timeout condition                                                  */
      __IOM uint32 ITTXFE     : 1;            /*!< [4..4] IN token received when TxFIFO is empty                             */
            uint32            : 1;
      __IOM uint32 INEPNE     : 1;            /*!< [6..6] IN endpoint NAK effective                                          */
      __IM  uint32 TXFE       : 1;            /*!< [7..7] Transmit FIFO empty                                                */
      __IOM uint32 TXFIFOUDRN : 1;            /*!< [8..8] Transmit Fifo Underrun                                             */
      __IOM uint32 BNA        : 1;            /*!< [9..9] Buffer not available interrupt                                     */
            uint32            : 1;
      __IOM uint32 PKTDRPSTS  : 1;            /*!< [11..11] Packet dropped status                                            */
      __IOM uint32 BERR       : 1;            /*!< [12..12] Babble error interrupt                                           */
      __IOM uint32 NAK        : 1;            /*!< [13..13] NAK interrupt                                                    */
            uint32            : 18;
    } bit;
  } OTG_HS_DIEPINT2;
  __IM  uint32  RESERVED10;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000150) OTG_HS device endpoint transfer size register              */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 MCNT       : 2;            /*!< [30..29] Multi count                                                      */
            uint32            : 1;
    } bit;
  } OTG_HS_DIEPTSIZ2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000154) OTG_HS device endpoint-3 DMA address register              */
    
    struct {
      __IOM uint32 DMAADDR    : 32;           /*!< [31..0] DMA address                                                       */
    } bit;
  } OTG_HS_DIEPDMA3;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000158) OTG_HS device IN endpoint transmit FIFO status
                                                                    register                                                   */
    
    struct {
      __IM  uint32 INEPTFSAV  : 16;           /*!< [15..0] IN endpoint TxFIFO space avail                                    */
            uint32            : 16;
    } bit;
  } OTG_HS_DTXFSTS2;
  __IM  uint32  RESERVED11;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000160) OTG device endpoint-3 control register                     */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] Maximum packet size                                               */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USB active endpoint                                              */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] Even/odd frame                                                   */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAK status                                                       */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] Endpoint type                                                    */
            uint32            : 1;
      __IOM uint32 Stall      : 1;            /*!< [21..21] STALL handshake                                                  */
      __IOM uint32 TXFNUM     : 4;            /*!< [25..22] TxFIFO number                                                    */
      __OM  uint32 CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] Set DATA0 PID                                                    */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] Set odd frame                                                    */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] Endpoint enable                                                  */
    } bit;
  } OTG_HS_DIEPCTL3;
  __IM  uint32  RESERVED12;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000168) OTG device endpoint-3 interrupt register                   */
    
