Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 MCNT       : 2;            /*!< [30..29] Multi count                                                      */
            uint32            : 1;
    } bit;
  } OTG_HS_DIEPTSIZ4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000194) OTG_HS device endpoint-5 DMA address register              */
    
    struct {
      __IOM uint32 DMAADDR    : 32;           /*!< [31..0] DMA address                                                       */
    } bit;
  } OTG_HS_DIEPDMA5;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000198) OTG_HS device IN endpoint transmit FIFO status
                                                                    register                                                   */
    
    struct {
      __IM  uint32 INEPTFSAV  : 16;           /*!< [15..0] IN endpoint TxFIFO space avail                                    */
            uint32            : 16;
    } bit;
  } OTG_HS_DTXFSTS4;
  __IM  uint32  RESERVED17;
  
  union {
    union {
      __IOM uint32 reg;                       /*!< (@ 0x000001A0) OTG device endpoint-5 control register                     */
      
      struct {
        __IOM uint32 MPSIZ    : 11;           /*!< [10..0] Maximum packet size                                               */
              uint32          : 4;
        __IOM uint32 USBAEP   : 1;            /*!< [15..15] USB active endpoint                                              */
        __IM  uint32 EONUM_DPID : 1;          /*!< [16..16] Even/odd frame                                                   */
        __IM  uint32 NAKSTS   : 1;            /*!< [17..17] NAK status                                                       */
        __IOM uint32 EPTYP    : 2;            /*!< [19..18] Endpoint type                                                    */
              uint32          : 1;
        __IOM uint32 Stall    : 1;            /*!< [21..21] STALL handshake                                                  */
        __IOM uint32 TXFNUM   : 4;            /*!< [25..22] TxFIFO number                                                    */
        __OM  uint32 CNAK     : 1;            /*!< [26..26] Clear NAK                                                        */
        __OM  uint32 SNAK     : 1;            /*!< [27..27] Set NAK                                                          */
        __OM  uint32 SD0PID_SEVNFRM : 1;      /*!< [28..28] Set DATA0 PID                                                    */
        __OM  uint32 SODDFRM  : 1;            /*!< [29..29] Set odd frame                                                    */
        __IOM uint32 EPDIS    : 1;            /*!< [30..30] Endpoint disable                                                 */
        __IOM uint32 EPENA    : 1;            /*!< [31..31] Endpoint enable                                                  */
      } bit;
    } OTG_HS_DIEPCTL5;
    
    union {
      __IOM uint32 reg;                       /*!< (@ 0x000001A0) OTG_HS device endpoint transfer size register              */
      
      struct {
        __IOM uint32 XFRSIZ   : 19;           /*!< [18..0] Transfer size                                                     */
        __IOM uint32 PKTCNT   : 10;           /*!< [28..19] Packet count                                                     */
        __IOM uint32 MCNT     : 2;            /*!< [30..29] Multi count                                                      */
              uint32          : 1;
      } bit;
    } OTG_HS_DIEPTSIZ6;
  };
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000001A4) OTG_HS device IN endpoint transmit FIFO status
                                                                    register                                                   */
    
    struct {
      __IOM uint32 INEPTFSAV  : 16;           /*!< [15..0] IN endpoint TxFIFO space avail                                    */
            uint32            : 16;
    } bit;
  } OTG_HS_DTXFSTS6;
  
  union {
    union {
      __IOM uint32 reg;                       /*!< (@ 0x000001A8) OTG device endpoint-5 interrupt register                   */
      
      struct {
        __IOM uint32 XFRC     : 1;            /*!< [0..0] Transfer completed interrupt                                       */
        __IOM uint32 EPDISD   : 1;            /*!< [1..1] Endpoint disabled interrupt                                        */
              uint32          : 1;
        __IOM uint32 TOC      : 1;            /*!< [3..3] Timeout condition                                                  */
        __IOM uint32 ITTXFE   : 1;            /*!< [4..4] IN token received when TxFIFO is empty                             */
              uint32          : 1;
        __IOM uint32 INEPNE   : 1;            /*!< [6..6] IN endpoint NAK effective                                          */
        __IM  uint32 TXFE     : 1;            /*!< [7..7] Transmit FIFO empty                                                */
        __IOM uint32 TXFIFOUDRN : 1;          /*!< [8..8] Transmit Fifo Underrun                                             */
        __IOM uint32 BNA      : 1;            /*!< [9..9] Buffer not available interrupt                                     */
              uint32          : 1;
        __IOM uint32 PKTDRPSTS : 1;           /*!< [11..11] Packet dropped status                                            */
        __IOM uint32 BERR     : 1;            /*!< [12..12] Babble error interrupt                                           */
        __IOM uint32 NAK      : 1;            /*!< [13..13] NAK interrupt                                                    */
              uint32          : 18;
      } bit;
    } OTG_HS_DIEPINT5;
    
    union {
      __IOM uint32 reg;                       /*!< (@ 0x000001A8) OTG_HS device endpoint transfer size register              */
      
