Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] Transfer completed interrupt                                       */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] Endpoint disabled interrupt                                        */
            uint32            : 1;
      __IOM uint32 TOC        : 1;            /*!< [3..3] Timeout condition                                                  */
      __IOM uint32 ITTXFE     : 1;            /*!< [4..4] IN token received when TxFIFO is empty                             */
            uint32            : 1;
      __IOM uint32 INEPNE     : 1;            /*!< [6..6] IN endpoint NAK effective                                          */
      __IM  uint32 TXFE       : 1;            /*!< [7..7] Transmit FIFO empty                                                */
      __IOM uint32 TXFIFOUDRN : 1;            /*!< [8..8] Transmit Fifo Underrun                                             */
      __IOM uint32 BNA        : 1;            /*!< [9..9] Buffer not available interrupt                                     */
            uint32            : 1;
      __IOM uint32 PKTDRPSTS  : 1;            /*!< [11..11] Packet dropped status                                            */
      __IOM uint32 BERR       : 1;            /*!< [12..12] Babble error interrupt                                           */
      __IOM uint32 NAK        : 1;            /*!< [13..13] NAK interrupt                                                    */
            uint32            : 18;
    } bit;
  } OTG_HS_DIEPINT7;
  __IM  uint32  RESERVED23[69];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000300) OTG_HS device control OUT endpoint 0 control
                                                                    register                                                   */
    
    struct {
      __IM  uint32 MPSIZ      : 2;            /*!< [1..0] Maximum packet size                                                */
            uint32            : 13;
      __IM  uint32 USBAEP     : 1;            /*!< [15..15] USB active endpoint                                              */
            uint32            : 1;
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAK status                                                       */
      __IM  uint32 EPTYP      : 2;            /*!< [19..18] Endpoint type                                                    */
      __IOM uint32 SNPM       : 1;            /*!< [20..20] Snoop mode                                                       */
      __IOM uint32 Stall      : 1;            /*!< [21..21] STALL handshake                                                  */
            uint32            : 4;
      __OM  uint32 CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
            uint32            : 2;
      __IM  uint32 EPDIS      : 1;            /*!< [30..30] Endpoint disable                                                 */
      __OM  uint32 EPENA      : 1;            /*!< [31..31] Endpoint enable                                                  */
    } bit;
  } OTG_HS_DOEPCTL0;
  __IM  uint32  RESERVED24;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000308) OTG_HS device endpoint-0 interrupt register                */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] Transfer completed interrupt                                       */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] Endpoint disabled interrupt                                        */
            uint32            : 1;
      __IOM uint32 STUP       : 1;            /*!< [3..3] SETUP phase done                                                   */
      __IOM uint32 OTEPDIS    : 1;            /*!< [4..4] OUT token received when endpoint disabled                          */
            uint32            : 1;
      __IOM uint32 B2BSTUP    : 1;            /*!< [6..6] Back-to-back SETUP packets received                                */
            uint32            : 7;
      __IOM uint32 NYET       : 1;            /*!< [14..14] NYET interrupt                                                   */
            uint32            : 17;
    } bit;
  } OTG_HS_DOEPINT0;
  __IM  uint32  RESERVED25;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000310) OTG_HS device endpoint-0 transfer size register            */
    
    struct {
      __IOM uint32 XFRSIZ     : 7;            /*!< [6..0] Transfer size                                                      */
            uint32            : 12;
      __IOM uint32 PKTCNT     : 1;            /*!< [19..19] Packet count                                                     */
            uint32            : 9;
      __IOM uint32 STUPCNT    : 2;            /*!< [30..29] SETUP packet count                                               */
            uint32            : 1;
    } bit;
  } OTG_HS_DOEPTSIZ0;
  __IM  uint32  RESERVED26[3];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000320) OTG device endpoint-1 control register                     */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] Maximum packet size                                               */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USB active endpoint                                              */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] Even odd frame/Endpoint data PID                                 */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAK status                                                       */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] Endpoint type                                                    */
      __IOM uint32 SNPM       : 1;            /*!< [20..20] Snoop mode                                                       */
      __IOM uint32 Stall      : 1;            /*!< [21..21] STALL handshake                                                  */
            uint32            : 4;
      __OM  uint32 CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] Set DATA0 PID/Set even frame                                     */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] Set odd frame                                                    */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] Endpoint enable                                                  */
    } bit;
  } OTG_HS_DOEPCTL1;
  __IM  uint32  RESERVED27;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000328) OTG_HS device endpoint-1 interrupt register                */
    
