Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] Transfer completed interrupt                                       */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] Endpoint disabled interrupt                                        */
            uint32            : 1;
      __IOM uint32 STUP       : 1;            /*!< [3..3] SETUP phase done                                                   */
      __IOM uint32 OTEPDIS    : 1;            /*!< [4..4] OUT token received when endpoint disabled                          */
            uint32            : 1;
      __IOM uint32 B2BSTUP    : 1;            /*!< [6..6] Back-to-back SETUP packets received                                */
            uint32            : 7;
      __IOM uint32 NYET       : 1;            /*!< [14..14] NYET interrupt                                                   */
            uint32            : 17;
    } bit;
  } OTG_HS_DOEPINT5;
  __IM  uint32  RESERVED40;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000003B0) OTG_HS device endpoint-5 transfer size register            */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 RXDPID_STUPCNT : 2;        /*!< [30..29] Received data PID/SETUP packet count                             */
            uint32            : 1;
    } bit;
  } OTG_HS_DOEPTSIZ5;
  __IM  uint32  RESERVED41[3];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000003C0) OTG device endpoint-6 control register                     */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] Maximum packet size                                               */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USB active endpoint                                              */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] Even odd frame/Endpoint data PID                                 */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAK status                                                       */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] Endpoint type                                                    */
      __IOM uint32 SNPM       : 1;            /*!< [20..20] Snoop mode                                                       */
      __IOM uint32 Stall      : 1;            /*!< [21..21] STALL handshake                                                  */
            uint32            : 4;
      __OM  uint32 CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] Set DATA0 PID/Set even frame                                     */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] Set odd frame                                                    */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] Endpoint enable                                                  */
    } bit;
  } OTG_HS_DOEPCTL6;
  __IM  uint32  RESERVED42;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000003C8) OTG_HS device endpoint-6 interrupt register                */
    
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] Transfer completed interrupt                                       */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] Endpoint disabled interrupt                                        */
            uint32            : 1;
      __IOM uint32 STUP       : 1;            /*!< [3..3] SETUP phase done                                                   */
      __IOM uint32 OTEPDIS    : 1;            /*!< [4..4] OUT token received when endpoint disabled                          */
            uint32            : 1;
      __IOM uint32 B2BSTUP    : 1;            /*!< [6..6] Back-to-back SETUP packets received                                */
            uint32            : 7;
      __IOM uint32 NYET       : 1;            /*!< [14..14] NYET interrupt                                                   */
            uint32            : 17;
    } bit;
  } OTG_HS_DOEPINT6;
  __IM  uint32  RESERVED43;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000003D0) OTG_HS device endpoint-6 transfer size register            */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 RXDPID_STUPCNT : 2;        /*!< [30..29] Received data PID/SETUP packet count                             */
            uint32            : 1;
    } bit;
  } OTG_HS_DOEPTSIZ6;
  __IM  uint32  RESERVED44[3];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000003E0) OTG device endpoint-7 control register                     */
    
    struct {
      __IOM uint32 MPSIZ      : 11;           /*!< [10..0] Maximum packet size                                               */
            uint32            : 4;
      __IOM uint32 USBAEP     : 1;            /*!< [15..15] USB active endpoint                                              */
      __IM  uint32 EONUM_DPID : 1;            /*!< [16..16] Even odd frame/Endpoint data PID                                 */
      __IM  uint32 NAKSTS     : 1;            /*!< [17..17] NAK status                                                       */
      __IOM uint32 EPTYP      : 2;            /*!< [19..18] Endpoint type                                                    */
      __IOM uint32 SNPM       : 1;            /*!< [20..20] Snoop mode                                                       */
      __IOM uint32 Stall      : 1;            /*!< [21..21] STALL handshake                                                  */
            uint32            : 4;
      __OM  uint32 CNAK       : 1;            /*!< [26..26] Clear NAK                                                        */
      __OM  uint32 SNAK       : 1;            /*!< [27..27] Set NAK                                                          */
      __OM  uint32 SD0PID_SEVNFRM : 1;        /*!< [28..28] Set DATA0 PID/Set even frame                                     */
      __OM  uint32 SODDFRM    : 1;            /*!< [29..29] Set odd frame                                                    */
      __IOM uint32 EPDIS      : 1;            /*!< [30..30] Endpoint disable                                                 */
      __IOM uint32 EPENA      : 1;            /*!< [31..31] Endpoint enable                                                  */
    } bit;
  } OTG_HS_DOEPCTL7;
  __IM  uint32  RESERVED45;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000003E8) OTG_HS device endpoint-7 interrupt register                */
    
