Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 XFRC       : 1;            /*!< [0..0] Transfer completed interrupt                                       */
      __IOM uint32 EPDISD     : 1;            /*!< [1..1] Endpoint disabled interrupt                                        */
            uint32            : 1;
      __IOM uint32 STUP       : 1;            /*!< [3..3] SETUP phase done                                                   */
      __IOM uint32 OTEPDIS    : 1;            /*!< [4..4] OUT token received when endpoint disabled                          */
            uint32            : 1;
      __IOM uint32 B2BSTUP    : 1;            /*!< [6..6] Back-to-back SETUP packets received                                */
            uint32            : 7;
      __IOM uint32 NYET       : 1;            /*!< [14..14] NYET interrupt                                                   */
            uint32            : 17;
    } bit;
  } OTG_HS_DOEPINT7;
  __IM  uint32  RESERVED46;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x000003F0) OTG_HS device endpoint-7 transfer size register            */
    
    struct {
      __IOM uint32 XFRSIZ     : 19;           /*!< [18..0] Transfer size                                                     */
      __IOM uint32 PKTCNT     : 10;           /*!< [28..19] Packet count                                                     */
      __IOM uint32 RXDPID_STUPCNT : 2;        /*!< [30..29] Received data PID/SETUP packet count                             */
            uint32            : 1;
    } bit;
  } OTG_HS_DOEPTSIZ7;
} OTG_HS_DEVICE_Type;                           /*!< Size = 1012 (0x3f4)                                                       */



/* =========================================================================================================================== */
/* ================                                       OTG_HS_PWRCLK                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go high speed (OTG_HS_PWRCLK)
  */

typedef struct {                                /*!< (@ 0x40040E00) OTG_HS_PWRCLK Structure                                    */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Power and clock gating control register                    */
    
    struct {
      __IOM uint32 STPPCLK    : 1;            /*!< [0..0] Stop PHY clock                                                     */
      __IOM uint32 GATEHCLK   : 1;            /*!< [1..1] Gate HCLK                                                          */
            uint32            : 2;
      __IOM uint32 PHYSUSP    : 1;            /*!< [4..4] PHY suspended                                                      */
            uint32            : 27;
    } bit;
  } OTG_HS_PCGCR;
} OTG_HS_PWRCLK_Type;                           /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           NVIC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Nested Vectored Interrupt       Controller (NVIC)
  */

typedef struct {                                /*!< (@ 0xE000E100) NVIC Structure                                             */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Interrupt Set-Enable Register                              */
    
    struct {
      __IOM uint32 SETENA     : 32;           /*!< [31..0] SETENA                                                            */
    } bit;
  } ISER0;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Interrupt Set-Enable Register                              */
    
    struct {
      __IOM uint32 SETENA     : 32;           /*!< [31..0] SETENA                                                            */
    } bit;
  } ISER1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) Interrupt Set-Enable Register                              */
    
    struct {
      __IOM uint32 SETENA     : 32;           /*!< [31..0] SETENA                                                            */
    } bit;
  } ISER2;
  __IM  uint32  RESERVED[29];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000080) Interrupt Clear-Enable Register                            */
    
    struct {
      __IOM uint32 CLRENA     : 32;           /*!< [31..0] CLRENA                                                            */
    } bit;
  } ICER0;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000084) Interrupt Clear-Enable Register                            */
    
    struct {
      __IOM uint32 CLRENA     : 32;           /*!< [31..0] CLRENA                                                            */
    } bit;
  } ICER1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000088) Interrupt Clear-Enable Register                            */
    
    struct {
      __IOM uint32 CLRENA     : 32;           /*!< [31..0] CLRENA                                                            */
    } bit;
  } ICER2;
  __IM  uint32  RESERVED1[29];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000100) Interrupt Set-Pending Register                             */
    
    struct {
      __IOM uint32 SETPEND    : 32;           /*!< [31..0] SETPEND                                                           */
    } bit;
  } ISPR0;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000104) Interrupt Set-Pending Register                             */
    
