Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 SETPEND    : 32;           /*!< [31..0] SETPEND                                                           */
    } bit;
  } ISPR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000108) Interrupt Set-Pending Register                             */
    
    struct {
      __IOM uint32 SETPEND    : 32;           /*!< [31..0] SETPEND                                                           */
    } bit;
  } ISPR2;
  __IM  uint32  RESERVED2[29];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000180) Interrupt Clear-Pending Register                           */
    
    struct {
      __IOM uint32 CLRPEND    : 32;           /*!< [31..0] CLRPEND                                                           */
    } bit;
  } ICPR0;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000184) Interrupt Clear-Pending Register                           */
    
    struct {
      __IOM uint32 CLRPEND    : 32;           /*!< [31..0] CLRPEND                                                           */
    } bit;
  } ICPR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000188) Interrupt Clear-Pending Register                           */
    
    struct {
      __IOM uint32 CLRPEND    : 32;           /*!< [31..0] CLRPEND                                                           */
    } bit;
  } ICPR2;
  __IM  uint32  RESERVED3[29];
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000200) Interrupt Active Bit Register                              */
    
    struct {
      __IM  uint32 ACTIVE     : 32;           /*!< [31..0] ACTIVE                                                            */
    } bit;
  } IABR0;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000204) Interrupt Active Bit Register                              */
    
    struct {
      __IM  uint32 ACTIVE     : 32;           /*!< [31..0] ACTIVE                                                            */
    } bit;
  } IABR1;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000208) Interrupt Active Bit Register                              */
    
    struct {
      __IM  uint32 ACTIVE     : 32;           /*!< [31..0] ACTIVE                                                            */
    } bit;
  } IABR2;
  __IM  uint32  RESERVED4[61];
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000300) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR0;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000304) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000308) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000030C) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000310) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR4;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000314) Interrupt Priority Register                                */
    
