Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR5;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000318) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR6;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000031C) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR7;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000320) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR8;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000324) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR9;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000328) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR10;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000032C) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR11;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000330) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR12;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000334) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR13;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000338) Interrupt Priority Register                                */
    
