Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR14;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000033C) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR15;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000340) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR16;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000344) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR17;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000348) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR18;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000034C) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR19;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000350) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR20;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000354) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR21;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000358) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR22;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000035C) Interrupt Priority Register                                */
    
