Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR23;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000360) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR24;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000364) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32 IPR_N0     : 8;            /*!< [7..0] IPR_N0                                                             */
      __IOM uint32 IPR_N1     : 8;            /*!< [15..8] IPR_N1                                                            */
      __IOM uint32 IPR_N2     : 8;            /*!< [23..16] IPR_N2                                                           */
      __IOM uint32 IPR_N3     : 8;            /*!< [31..24] IPR_N3                                                           */
    } bit;
  } IPR25;
} NVIC_Type;                                    /*!< Size = 872 (0x368)                                                        */



/* =========================================================================================================================== */
/* ================                                            MPU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Memory protection unit (MPU)
  */

typedef struct {                                /*!< (@ 0xE000ED90) MPU Structure                                              */
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000000) MPU type register                                          */
    
    struct {
      __IM  uint32 SEPARATE   : 1;            /*!< [0..0] Separate flag                                                      */
            uint32            : 7;
      __IM  uint32 DREGION    : 8;            /*!< [15..8] Number of MPU data regions                                        */
      __IM  uint32 IREGION    : 8;            /*!< [23..16] Number of MPU instruction regions                                */
            uint32            : 8;
    } bit;
  } MPU_TYPER;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000004) MPU control register                                       */
    
    struct {
      __IM  uint32 ENABLE     : 1;            /*!< [0..0] Enables the MPU                                                    */
      __IM  uint32 HFNMIENA   : 1;            /*!< [1..1] Enables the operation of MPU during hard fault                     */
      __IM  uint32 PRIVDEFENA : 1;            /*!< [2..2] Enable priviliged software access to default memory map            */
            uint32            : 29;
    } bit;
  } MPU_CTRL;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) MPU region number register                                 */
    
    struct {
      __IOM uint32 REGION     : 8;            /*!< [7..0] MPU region                                                         */
            uint32            : 24;
    } bit;
  } MPU_RNR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) MPU region base address register                           */
    
    struct {
      __IOM uint32 REGION     : 4;            /*!< [3..0] MPU region field                                                   */
      __IOM uint32 VALID      : 1;            /*!< [4..4] MPU region number valid                                            */
      __IOM uint32 ADDR       : 27;           /*!< [31..5] Region base address field                                         */
    } bit;
  } MPU_RBAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) MPU region attribute and size register                     */
    
    struct {
      __IOM uint32 ENABLE     : 1;            /*!< [0..0] Region enable bit.                                                 */
      __IOM uint32 SIZE       : 5;            /*!< [5..1] Size of the MPU protection region                                  */
            uint32            : 2;
      __IOM uint32 SRD        : 8;            /*!< [15..8] Subregion disable bits                                            */
      __IOM uint32 B          : 1;            /*!< [16..16] memory attribute                                                 */
      __IOM uint32 C          : 1;            /*!< [17..17] memory attribute                                                 */
      __IOM uint32 S          : 1;            /*!< [18..18] Shareable memory attribute                                       */
      __IOM uint32 TEX        : 3;            /*!< [21..19] memory attribute                                                 */
            uint32            : 2;
      __IOM uint32 AP         : 3;            /*!< [26..24] Access permission                                                */
            uint32            : 1;
      __IOM uint32 XN         : 1;            /*!< [28..28] Instruction access disable bit                                   */
            uint32            : 3;
    } bit;
  } MPU_RASR;
} MPU_Type;                                     /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                            STK                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SysTick timer (STK)
  */

typedef struct {                                /*!< (@ 0xE000E010) STK Structure                                              */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) SysTick control and status register                        */
    
