Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 ENABLE     : 1;            /*!< [0..0] Counter enable                                                     */
      __IOM uint32 TICKINT    : 1;            /*!< [1..1] SysTick exception request enable                                   */
      __IOM uint32 CLKSOURCE  : 1;            /*!< [2..2] Clock source selection                                             */
            uint32            : 13;
      __IOM uint32 COUNTFLAG  : 1;            /*!< [16..16] COUNTFLAG                                                        */
            uint32            : 15;
    } bit;
  } CSR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) SysTick reload value register                              */
    
    struct {
      __IOM uint32 RELOAD     : 24;           /*!< [23..0] RELOAD value                                                      */
            uint32            : 8;
    } bit;
  } RVR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) SysTick current value register                             */
    
    struct {
      __IOM uint32 CURRENT    : 24;           /*!< [23..0] Current counter value                                             */
            uint32            : 8;
    } bit;
  } CVR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) SysTick calibration value register                         */
    
    struct {
      __IOM uint32 TENMS      : 24;           /*!< [23..0] Calibration value                                                 */
            uint32            : 6;
      __IOM uint32 SKEW       : 1;            /*!< [30..30] SKEW flag: Indicates whether the TENMS value is exact            */
      __IOM uint32 NOREF      : 1;            /*!< [31..31] NOREF flag. Reads as zero                                        */
    } bit;
  } CALIB;
} STK_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                         NVIC_STIR                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief Nested vectored interrupt       controller (NVIC_STIR)
  */

typedef struct {                                /*!< (@ 0xE000EF00) NVIC_STIR Structure                                        */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Software trigger interrupt register                        */
    
    struct {
      __IOM uint32 INTID      : 9;            /*!< [8..0] Software generated interrupt ID                                    */
            uint32            : 23;
    } bit;
  } STIR;
} NVIC_STIR_Type;                               /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                         FPU_CPACR                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief Floating point unit CPACR (FPU_CPACR)
  */

typedef struct {                                /*!< (@ 0xE000ED88) FPU_CPACR Structure                                        */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Coprocessor access control register                        */
    
    struct {
            uint32            : 20;
      __IOM uint32 CP         : 4;            /*!< [23..20] CP                                                               */
            uint32            : 8;
    } bit;
  } CPACR;
} FPU_CPACR_Type;                               /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                         SCB_ACTRL                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief System control block ACTLR (SCB_ACTRL)
  */

typedef struct {                                /*!< (@ 0xE000E008) SCB_ACTRL Structure                                        */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Auxiliary control register                                 */
    
    struct {
            uint32            : 2;
      __IOM uint32 DISFOLD    : 1;            /*!< [2..2] DISFOLD                                                            */
            uint32            : 7;
      __IOM uint32 FPEXCODIS  : 1;            /*!< [10..10] FPEXCODIS                                                        */
      __IOM uint32 DISRAMODE  : 1;            /*!< [11..11] DISRAMODE                                                        */
      __IOM uint32 DISITMATBFLUSH : 1;        /*!< [12..12] DISITMATBFLUSH                                                   */
            uint32            : 19;
    } bit;
  } ACTRL;
} SCB_ACTRL_Type;                               /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                            FPU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Floting point unit (FPU)
  */

typedef struct {                                /*!< (@ 0xE000EF34) FPU Structure                                              */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Floating-point context control register                    */
    
