Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 LSPACT     : 1;            /*!< [0..0] LSPACT                                                             */
      __IOM uint32 USER       : 1;            /*!< [1..1] USER                                                               */
            uint32            : 1;
      __IOM uint32 THREAD     : 1;            /*!< [3..3] THREAD                                                             */
      __IOM uint32 HFRDY      : 1;            /*!< [4..4] HFRDY                                                              */
      __IOM uint32 MMRDY      : 1;            /*!< [5..5] MMRDY                                                              */
      __IOM uint32 BFRDY      : 1;            /*!< [6..6] BFRDY                                                              */
            uint32            : 1;
      __IOM uint32 MONRDY     : 1;            /*!< [8..8] MONRDY                                                             */
            uint32            : 21;
      __IOM uint32 LSPEN      : 1;            /*!< [30..30] LSPEN                                                            */
      __IOM uint32 ASPEN      : 1;            /*!< [31..31] ASPEN                                                            */
    } bit;
  } FPCCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Floating-point context address register                    */
    
    struct {
            uint32            : 3;
      __IOM uint32 ADDRESS    : 29;           /*!< [31..3] Location of unpopulated floating-point                            */
    } bit;
  } FPCAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) Floating-point status control register                     */
    
    struct {
      __IOM uint32 IOC        : 1;            /*!< [0..0] Invalid operation cumulative exception bit                         */
      __IOM uint32 DZC        : 1;            /*!< [1..1] Division by zero cumulative exception bit.                         */
      __IOM uint32 OFC        : 1;            /*!< [2..2] Overflow cumulative exception bit                                  */
      __IOM uint32 UFC        : 1;            /*!< [3..3] Underflow cumulative exception bit                                 */
      __IOM uint32 IXC        : 1;            /*!< [4..4] Inexact cumulative exception bit                                   */
            uint32            : 2;
      __IOM uint32 IDC        : 1;            /*!< [7..7] Input denormal cumulative exception bit.                           */
            uint32            : 14;
      __IOM uint32 RMode      : 2;            /*!< [23..22] Rounding Mode control field                                      */
      __IOM uint32 FZ         : 1;            /*!< [24..24] Flush-to-zero mode control bit:                                  */
      __IOM uint32 DN         : 1;            /*!< [25..25] Default NaN mode control bit                                     */
      __IOM uint32 AHP        : 1;            /*!< [26..26] Alternative half-precision control bit                           */
            uint32            : 1;
      __IOM uint32 V          : 1;            /*!< [28..28] Overflow condition code flag                                     */
      __IOM uint32 C          : 1;            /*!< [29..29] Carry condition code flag                                        */
      __IOM uint32 Z          : 1;            /*!< [30..30] Zero condition code flag                                         */
      __IOM uint32 N          : 1;            /*!< [31..31] Negative condition code flag                                     */
    } bit;
  } FPSCR;
} FPU_Type;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            SCB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System control block (SCB)
  */

typedef struct {                                /*!< (@ 0xE000ED00) SCB Structure                                              */
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000000) CPUID base register                                        */
    
    struct {
      __IM  uint32 Revision   : 4;            /*!< [3..0] Revision number                                                    */
      __IM  uint32 PartNo     : 12;           /*!< [15..4] Part number of the processor                                      */
      __IM  uint32 Constant   : 4;            /*!< [19..16] Reads as 0xF                                                     */
      __IM  uint32 Variant    : 4;            /*!< [23..20] Variant number                                                   */
      __IM  uint32 Implementer : 8;           /*!< [31..24] Implementer code                                                 */
    } bit;
  } CPUID;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Interrupt control and state register                       */
    
    struct {
      __IOM uint32 VECTACTIVE : 9;            /*!< [8..0] Active vector                                                      */
            uint32            : 2;
      __IOM uint32 RETTOBASE  : 1;            /*!< [11..11] Return to base level                                             */
      __IOM uint32 VECTPENDING : 7;           /*!< [18..12] Pending vector                                                   */
            uint32            : 3;
      __IOM uint32 ISRPENDING : 1;            /*!< [22..22] Interrupt pending flag                                           */
            uint32            : 2;
      __IOM uint32 PENDSTCLR  : 1;            /*!< [25..25] SysTick exception clear-pending bit                              */
      __IOM uint32 PENDSTSET  : 1;            /*!< [26..26] SysTick exception set-pending bit                                */
      __IOM uint32 PENDSVCLR  : 1;            /*!< [27..27] PendSV clear-pending bit                                         */
      __IOM uint32 PENDSVSET  : 1;            /*!< [28..28] PendSV set-pending bit                                           */
            uint32            : 2;
      __IOM uint32 NMIPENDSET : 1;            /*!< [31..31] NMI set-pending bit.                                             */
    } bit;
  } ICSR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) Vector table offset register                               */
    
