Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
            uint32            : 9;
      __IOM uint32 TBLOFF     : 21;           /*!< [29..9] Vector table base offset field                                    */
            uint32            : 2;
    } bit;
  } VTOR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) Application interrupt and reset control register           */
    
    struct {
      __IOM uint32 VECTRESET  : 1;            /*!< [0..0] VECTRESET                                                          */
      __IOM uint32 VECTCLRACTIVE : 1;         /*!< [1..1] VECTCLRACTIVE                                                      */
      __IOM uint32 SYSRESETREQ : 1;           /*!< [2..2] SYSRESETREQ                                                        */
            uint32            : 5;
      __IOM uint32 PRIGROUP   : 3;            /*!< [10..8] PRIGROUP                                                          */
            uint32            : 4;
      __IOM uint32 ENDIANESS  : 1;            /*!< [15..15] ENDIANESS                                                        */
      __IOM uint32 VECTKEYSTAT : 16;          /*!< [31..16] Register key                                                     */
    } bit;
  } AIRCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) System control register                                    */
    
    struct {
            uint32            : 1;
      __IOM uint32 SLEEPONEXIT : 1;           /*!< [1..1] SLEEPONEXIT                                                        */
      __IOM uint32 SLEEPDEEP  : 1;            /*!< [2..2] SLEEPDEEP                                                          */
            uint32            : 1;
      __IOM uint32 SEVEONPEND : 1;            /*!< [4..4] Send Event on Pending bit                                          */
            uint32            : 27;
    } bit;
  } SCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000014) Configuration and control register                         */
    
    struct {
      __IOM uint32 NONBASETHRDENA : 1;        /*!< [0..0] Configures how the processor enters Thread mode                    */
      __IOM uint32 USERSETMPEND : 1;          /*!< [1..1] USERSETMPEND                                                       */
            uint32            : 1;
      __IOM uint32 UNALIGN__TRP : 1;          /*!< [3..3] UNALIGN_ TRP                                                       */
      __IOM uint32 DIV_0_TRP  : 1;            /*!< [4..4] DIV_0_TRP                                                          */
            uint32            : 3;
      __IOM uint32 BFHFNMIGN  : 1;            /*!< [8..8] BFHFNMIGN                                                          */
      __IOM uint32 STKALIGN   : 1;            /*!< [9..9] STKALIGN                                                           */
            uint32            : 6;
      __IOM uint32 DC         : 1;            /*!< [16..16] DC                                                               */
      __IOM uint32 IC         : 1;            /*!< [17..17] IC                                                               */
      __IOM uint32 BP         : 1;            /*!< [18..18] BP                                                               */
            uint32            : 13;
    } bit;
  } CCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) System handler priority registers                          */
    
    struct {
      __IOM uint32 PRI_4      : 8;            /*!< [7..0] Priority of system handler 4                                       */
      __IOM uint32 PRI_5      : 8;            /*!< [15..8] Priority of system handler 5                                      */
      __IOM uint32 PRI_6      : 8;            /*!< [23..16] Priority of system handler 6                                     */
            uint32            : 8;
    } bit;
  } SHPR1;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000001C) System handler priority registers                          */
    
    struct {
            uint32            : 24;
      __IOM uint32 PRI_11     : 8;            /*!< [31..24] Priority of system handler 11                                    */
    } bit;
  } SHPR2;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000020) System handler priority registers                          */
    
    struct {
            uint32            : 16;
      __IOM uint32 PRI_14     : 8;            /*!< [23..16] Priority of system handler 14                                    */
      __IOM uint32 PRI_15     : 8;            /*!< [31..24] Priority of system handler 15                                    */
    } bit;
  } SHPR3;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000024) System handler control and state register                  */
    
    struct {
      __IOM uint32 MEMFAULTACT : 1;           /*!< [0..0] Memory management fault exception active bit                       */
      __IOM uint32 BUSFAULTACT : 1;           /*!< [1..1] Bus fault exception active bit                                     */
            uint32            : 1;
      __IOM uint32 USGFAULTACT : 1;           /*!< [3..3] Usage fault exception active bit                                   */
            uint32            : 3;
      __IOM uint32 SVCALLACT  : 1;            /*!< [7..7] SVC call active bit                                                */
      __IOM uint32 MONITORACT : 1;            /*!< [8..8] Debug monitor active bit                                           */
            uint32            : 1;
      __IOM uint32 PENDSVACT  : 1;            /*!< [10..10] PendSV exception active bit                                      */
      __IOM uint32 SYSTICKACT : 1;            /*!< [11..11] SysTick exception active bit                                     */
      __IOM uint32 USGFAULTPENDED : 1;        /*!< [12..12] Usage fault exception pending bit                                */
      __IOM uint32 MEMFAULTPENDED : 1;        /*!< [13..13] Memory management fault exception pending bit                    */
      __IOM uint32 BUSFAULTPENDED : 1;        /*!< [14..14] Bus fault exception pending bit                                  */
      __IOM uint32 SVCALLPENDED : 1;          /*!< [15..15] SVC call pending bit                                             */
      __IOM uint32 MEMFAULTENA : 1;           /*!< [16..16] Memory management fault enable bit                               */
      __IOM uint32 BUSFAULTENA : 1;           /*!< [17..17] Bus fault enable bit                                             */
      __IOM uint32 USGFAULTENA : 1;           /*!< [18..18] Usage fault enable bit                                           */
            uint32            : 13;
    } bit;
  } SHCRS;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000028) Configurable fault status register                         */
    
