Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 IACCVIOL   : 1;            /*!< [0..0] IACCVIOL                                                           */
      __IOM uint32 DACCVIOL   : 1;            /*!< [1..1] DACCVIOL                                                           */
            uint32            : 1;
      __IOM uint32 MUNSTKERR  : 1;            /*!< [3..3] MUNSTKERR                                                          */
      __IOM uint32 MSTKERR    : 1;            /*!< [4..4] MSTKERR                                                            */
      __IOM uint32 MLSPERR    : 1;            /*!< [5..5] MLSPERR                                                            */
            uint32            : 1;
      __IOM uint32 MMARVALID  : 1;            /*!< [7..7] MMARVALID                                                          */
      __IOM uint32 IBUSERR    : 1;            /*!< [8..8] Instruction bus error                                              */
      __IOM uint32 PRECISERR  : 1;            /*!< [9..9] Precise data bus error                                             */
      __IOM uint32 IMPRECISERR : 1;           /*!< [10..10] Imprecise data bus error                                         */
      __IOM uint32 UNSTKERR   : 1;            /*!< [11..11] Bus fault on unstacking for a return from exception              */
      __IOM uint32 STKERR     : 1;            /*!< [12..12] Bus fault on stacking for exception entry                        */
      __IOM uint32 LSPERR     : 1;            /*!< [13..13] Bus fault on floating-point lazy state preservation              */
            uint32            : 1;
      __IOM uint32 BFARVALID  : 1;            /*!< [15..15] Bus Fault Address Register (BFAR) valid flag                     */
      __IOM uint32 UNDEFINSTR : 1;            /*!< [16..16] Undefined instruction usage fault                                */
      __IOM uint32 INVSTATE   : 1;            /*!< [17..17] Invalid state usage fault                                        */
      __IOM uint32 INVPC      : 1;            /*!< [18..18] Invalid PC load usage fault                                      */
      __IOM uint32 NOCP       : 1;            /*!< [19..19] No coprocessor usage fault.                                      */
            uint32            : 4;
      __IOM uint32 UNALIGNED  : 1;            /*!< [24..24] Unaligned access usage fault                                     */
      __IOM uint32 DIVBYZERO  : 1;            /*!< [25..25] Divide by zero usage fault                                       */
            uint32            : 6;
    } bit;
  } CFSR_UFSR_BFSR_MMFSR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000002C) Hard fault status register                                 */
    
    struct {
            uint32            : 1;
      __IOM uint32 VECTTBL    : 1;            /*!< [1..1] Vector table hard fault                                            */
            uint32            : 28;
      __IOM uint32 FORCED     : 1;            /*!< [30..30] Forced hard fault                                                */
      __IOM uint32 DEBUG_VT   : 1;            /*!< [31..31] Reserved for Debug use                                           */
    } bit;
  } HFSR;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000034) Memory management fault address register                   */
    
    struct {
      __IOM uint32 ADDRESS    : 32;           /*!< [31..0] Memory management fault address                                   */
    } bit;
  } MMFAR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000038) Bus fault address register                                 */
    
    struct {
      __IOM uint32 ADDRESS    : 32;           /*!< [31..0] Bus fault address                                                 */
    } bit;
  } BFAR;
} SCB_Type;                                     /*!< Size = 60 (0x3c)                                                          */



/* =========================================================================================================================== */
/* ================                                            PF                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief Processor features (PF)
  */

typedef struct {                                /*!< (@ 0xE000ED78) PF Structure                                               */
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000000) Cache Level ID register                                    */
    
    struct {
      __IM  uint32 CL1        : 3;            /*!< [2..0] CL1                                                                */
      __IM  uint32 CL2        : 3;            /*!< [5..3] CL2                                                                */
      __IM  uint32 CL3        : 3;            /*!< [8..6] CL3                                                                */
      __IM  uint32 CL4        : 3;            /*!< [11..9] CL4                                                               */
      __IM  uint32 CL5        : 3;            /*!< [14..12] CL5                                                              */
      __IM  uint32 CL6        : 3;            /*!< [17..15] CL6                                                              */
      __IM  uint32 CL7        : 3;            /*!< [20..18] CL7                                                              */
      __IM  uint32 LoUIS      : 3;            /*!< [23..21] LoUIS                                                            */
      __IM  uint32 LoC        : 3;            /*!< [26..24] LoC                                                              */
      __IM  uint32 LoU        : 3;            /*!< [29..27] LoU                                                              */
            uint32            : 2;
    } bit;
  } CLIDR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000004) Cache Type register                                        */
    
