Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IM  uint32 _IminLine  : 4;            /*!< [3..0] IminLine                                                           */
            uint32            : 12;
      __IM  uint32 DMinLine   : 4;            /*!< [19..16] DMinLine                                                         */
      __IM  uint32 ERG        : 4;            /*!< [23..20] ERG                                                              */
      __IM  uint32 CWG        : 4;            /*!< [27..24] CWG                                                              */
            uint32            : 1;
      __IM  uint32 Format     : 3;            /*!< [31..29] Format                                                           */
    } bit;
  } CTR;
  
  union {
    __IM  uint32 reg;                         /*!< (@ 0x00000008) Cache Size ID register                                     */
    
    struct {
      __IM  uint32 LineSize   : 3;            /*!< [2..0] LineSize                                                           */
      __IM  uint32 Associativity : 10;        /*!< [12..3] Associativity                                                     */
      __IM  uint32 NumSets    : 15;           /*!< [27..13] NumSets                                                          */
      __IM  uint32 WA         : 1;            /*!< [28..28] WA                                                               */
      __IM  uint32 RA         : 1;            /*!< [29..29] RA                                                               */
      __IM  uint32 WB         : 1;            /*!< [30..30] WB                                                               */
      __IM  uint32 WT         : 1;            /*!< [31..31] WT                                                               */
    } bit;
  } CCSIDR;
} PF_Type;                                      /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            AC                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief Access control (AC)
  */

typedef struct {                                /*!< (@ 0xE000EF90) AC Structure                                               */
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000000) Instruction and Data Tightly-Coupled Memory Control
                                                                    Registers                                                  */
    
    struct {
      __IOM uint32 EN         : 1;            /*!< [0..0] EN                                                                 */
      __IOM uint32 RMW        : 1;            /*!< [1..1] RMW                                                                */
      __IOM uint32 RETEN      : 1;            /*!< [2..2] RETEN                                                              */
      __IOM uint32 SZ         : 4;            /*!< [6..3] SZ                                                                 */
            uint32            : 25;
    } bit;
  } ITCMCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000004) Instruction and Data Tightly-Coupled Memory Control
                                                                    Registers                                                  */
    
    struct {
      __IOM uint32 EN         : 1;            /*!< [0..0] EN                                                                 */
      __IOM uint32 RMW        : 1;            /*!< [1..1] RMW                                                                */
      __IOM uint32 RETEN      : 1;            /*!< [2..2] RETEN                                                              */
      __IOM uint32 SZ         : 4;            /*!< [6..3] SZ                                                                 */
            uint32            : 25;
    } bit;
  } DTCMCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000008) AHBP Control register                                      */
    
    struct {
      __IOM uint32 EN         : 1;            /*!< [0..0] EN                                                                 */
      __IOM uint32 SZ         : 3;            /*!< [3..1] SZ                                                                 */
            uint32            : 28;
    } bit;
  } AHBPCR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x0000000C) Auxiliary Cache Control register                           */
    
    struct {
      __IOM uint32 SIWT       : 1;            /*!< [0..0] SIWT                                                               */
      __IOM uint32 ECCEN      : 1;            /*!< [1..1] ECCEN                                                              */
      __IOM uint32 FORCEWT    : 1;            /*!< [2..2] FORCEWT                                                            */
            uint32            : 29;
    } bit;
  } CACR;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000010) AHB Slave Control register                                 */
    
    struct {
      __IOM uint32 CTL        : 2;            /*!< [1..0] CTL                                                                */
      __IOM uint32 TPRI       : 9;            /*!< [10..2] TPRI                                                              */
      __IOM uint32 INITCOUNT  : 5;            /*!< [15..11] INITCOUNT                                                        */
            uint32            : 16;
    } bit;
  } AHBSCR;
  __IM  uint32  RESERVED;
  
  union {
    __IOM uint32 reg;                         /*!< (@ 0x00000018) Auxiliary Bus Fault Status register                        */
    
