Chalandi/Blinky_Nucleo_F746/Code/mcal/STM32F7x6.h
    struct {
      __IOM uint32 ITCM       : 1;            /*!< [0..0] ITCM                                                               */
      __IOM uint32 DTCM       : 1;            /*!< [1..1] DTCM                                                               */
      __IOM uint32 AHBP       : 1;            /*!< [2..2] AHBP                                                               */
      __IOM uint32 AXIM       : 1;            /*!< [3..3] AXIM                                                               */
      __IOM uint32 EPPB       : 1;            /*!< [4..4] EPPB                                                               */
            uint32            : 3;
      __IOM uint32 AXIMTYPE   : 2;            /*!< [9..8] AXIMTYPE                                                           */
            uint32            : 22;
    } bit;
  } ABFSR;
} AC_Type;                                      /*!< Size = 28 (0x1c)                                                          */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define RNG_BASE                    0x50060800UL
#define HASH_BASE                   0x50060400UL
#define CRYP_BASE                   0x50060000UL
#define DCMI_BASE                   0x50050000UL
#define FMC_BASE                    0xA0000000UL
#define DBG_BASE                    0xE0042000UL
#define DMA2_BASE                   0x40026400UL
#define DMA1_BASE                   0x40026000UL
#define RCC_BASE                    0x40023800UL
#define GPIOD_BASE                  0x40020C00UL
#define GPIOC_BASE                  0x40020800UL
#define GPIOK_BASE                  0x40022800UL
#define GPIOJ_BASE                  0x40022400UL
#define GPIOI_BASE                  0x40022000UL
#define GPIOH_BASE                  0x40021C00UL
#define GPIOG_BASE                  0x40021800UL
#define GPIOF_BASE                  0x40021400UL
#define GPIOE_BASE                  0x40021000UL
#define GPIOB_BASE                  0x40020400UL
#define GPIOA_BASE                  0x40020000UL
#define SYSCFG_BASE                 0x40013800UL
#define SPI1_BASE                   0x40013000UL
#define SPI3_BASE                   0x40003C00UL
#define SPI4_BASE                   0x40013400UL
#define SPI5_BASE                   0x40015000UL
#define SPI6_BASE                   0x40015400UL
#define SPI2_BASE                   0x40003800UL
#define ADC1_BASE                   0x40012000UL
#define ADC2_BASE                   0x40012100UL
#define ADC3_BASE                   0x40012200UL
#define DAC_BASE                    0x40007400UL
#define PWR_BASE                    0x40007000UL
#define IWDG_BASE                   0x40003000UL
#define WWDG_BASE                   0x40002C00UL
#define C_ADC_BASE                  0x40012300UL
#define TIM1_BASE                   0x40010000UL
#define TIM8_BASE                   0x40010400UL
#define TIM2_BASE                   0x40000000UL
#define TIM3_BASE                   0x40000400UL
#define TIM4_BASE                   0x40000800UL
#define TIM5_BASE                   0x40000C00UL
#define TIM9_BASE                   0x40014000UL
#define TIM12_BASE                  0x40001800UL
#define TIM10_BASE                  0x40014400UL
#define TIM11_BASE                  0x40014800UL
#define TIM13_BASE                  0x40001C00UL
#define TIM14_BASE                  0x40002000UL
#define TIM6_BASE                   0x40001000UL
#define TIM7_BASE                   0x40001400UL
#define Ethernet_MAC_BASE           0x40028000UL
#define Ethernet_MMC_BASE           0x40028100UL
#define Ethernet_PTP_BASE           0x40028700UL
#define Ethernet_DMA_BASE           0x40029000UL
#define CRC_BASE                    0x40023000UL
#define CAN1_BASE                   0x40006400UL
#define CAN2_BASE                   0x40006800UL
#define FLASH_BASE                  0x40023C00UL
#define EXTI_BASE                   0x40013C00UL
#define LTDC_BASE                   0x40016800UL
#define SAI1_BASE                   0x40015800UL
#define SAI2_BASE                   0x40015C00UL
#define DMA2D_BASE                  0x4002B000UL
#define QUADSPI_BASE                0xA0001000UL
#define CEC_BASE                    0x40006C00UL
#define SPDIF_RX_BASE               0x40004000UL
#define SDMMC1_BASE                 0x40012C00UL
#define LPTIM1_BASE                 0x40002400UL
#define I2C1_BASE                   0x40005400UL
#define I2C2_BASE                   0x40005800UL
#define I2C3_BASE                   0x40005C00UL
#define I2C4_BASE                   0x40006000UL
#define RTC_BASE                    0x40002800UL
#define USART6_BASE                 0x40011400UL
#define USART1_BASE                 0x40011000UL
#define USART3_BASE                 0x40004800UL
#define USART2_BASE                 0x40004400UL
#define UART5_BASE                  0x40005000UL
#define UART4_BASE                  0x40004C00UL
#define UART8_BASE                  0x40007C00UL
#define UART7_BASE                  0x40007800UL
#define OTG_FS_GLOBAL_BASE          0x50000000UL
#define OTG_FS_HOST_BASE            0x50000400UL
#define OTG_FS_DEVICE_BASE          0x50000800UL
#define OTG_FS_PWRCLK_BASE          0x50000E00UL
#define OTG_HS_GLOBAL_BASE          0x40040000UL
#define OTG_HS_HOST_BASE            0x40040400UL
#define OTG_HS_DEVICE_BASE          0x40040800UL
#define OTG_HS_PWRCLK_BASE          0x40040E00UL
#define NVIC_BASE                   0xE000E100UL
#define MPU_BASE                    0xE000ED90UL
#define STK_BASE                    0xE000E010UL
#define NVIC_STIR_BASE              0xE000EF00UL
#define FPU_CPACR_BASE              0xE000ED88UL
#define SCB_ACTRL_BASE              0xE000E008UL
#define FPU_BASE                    0xE000EF34UL
#define SCB_BASE                    0xE000ED00UL
#define PF_BASE                     0xE000ED78UL
#define AC_BASE                     0xE000EF90UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define RNG                         ((RNG_Type*)               RNG_BASE)
#define HASH                        ((HASH_Type*)              HASH_BASE)
#define CRYP                        ((CRYP_Type*)              CRYP_BASE)
#define DCMI                        ((DCMI_Type*)              DCMI_BASE)
#define FMC                         ((FMC_Type*)               FMC_BASE)
#define DBG                         ((DBG_Type*)               DBG_BASE)
#define DMA2                        ((DMA2_Type*)              DMA2_BASE)
#define DMA1                        ((DMA2_Type*)              DMA1_BASE)
#define RCC                         ((RCC_Type*)               RCC_BASE)
#define GPIOD                       ((GPIOD_Type*)             GPIOD_BASE)
#define GPIOC                       ((GPIOD_Type*)             GPIOC_BASE)
#define GPIOK                       ((GPIOD_Type*)             GPIOK_BASE)
#define GPIOJ                       ((GPIOD_Type*)             GPIOJ_BASE)
#define GPIOI                       ((GPIOD_Type*)             GPIOI_BASE)
#define GPIOH                       ((GPIOD_Type*)             GPIOH_BASE)
#define GPIOG                       ((GPIOD_Type*)             GPIOG_BASE)
#define GPIOF                       ((GPIOD_Type*)             GPIOF_BASE)
#define GPIOE                       ((GPIOD_Type*)             GPIOE_BASE)
#define GPIOB                       ((GPIOB_Type*)             GPIOB_BASE)
#define GPIOA                       ((GPIOA_Type*)             GPIOA_BASE)
#define SYSCFG                      ((SYSCFG_Type*)            SYSCFG_BASE)
#define SPI1                        ((SPI1_Type*)              SPI1_BASE)
#define SPI3                        ((SPI1_Type*)              SPI3_BASE)
#define SPI4                        ((SPI1_Type*)              SPI4_BASE)
#define SPI5                        ((SPI1_Type*)              SPI5_BASE)
#define SPI6                        ((SPI1_Type*)              SPI6_BASE)
#define SPI2                        ((SPI2_Type*)              SPI2_BASE)
#define ADC1                        ((ADC1_Type*)              ADC1_BASE)
#define ADC2                        ((ADC1_Type*)              ADC2_BASE)
#define ADC3                        ((ADC1_Type*)              ADC3_BASE)
#define DAC                         ((DAC_Type*)               DAC_BASE)
#define PWR                         ((PWR_Type*)               PWR_BASE)
#define IWDG                        ((IWDG_Type*)              IWDG_BASE)
#define WWDG                        ((WWDG_Type*)              WWDG_BASE)
#define C_ADC                       ((C_ADC_Type*)             C_ADC_BASE)
#define TIM1                        ((TIM1_Type*)              TIM1_BASE)
#define TIM8                        ((TIM1_Type*)              TIM8_BASE)
#define TIM2                        ((TIM2_Type*)              TIM2_BASE)
#define TIM3                        ((TIM3_Type*)              TIM3_BASE)
#define TIM4                        ((TIM4_Type*)              TIM4_BASE)
#define TIM5                        ((TIM4_Type*)              TIM5_BASE)
#define TIM9                        ((TIM9_Type*)              TIM9_BASE)
#define TIM12                       ((TIM9_Type*)              TIM12_BASE)
#define TIM10                       ((TIM10_Type*)             TIM10_BASE)
#define TIM11                       ((TIM10_Type*)             TIM11_BASE)
#define TIM13                       ((TIM10_Type*)             TIM13_BASE)
#define TIM14                       ((TIM10_Type*)             TIM14_BASE)
#define TIM6                        ((TIM6_Type*)              TIM6_BASE)
#define TIM7                        ((TIM6_Type*)              TIM7_BASE)
#define Ethernet_MAC                ((Ethernet_MAC_Type*)      Ethernet_MAC_BASE)
#define Ethernet_MMC                ((Ethernet_MMC_Type*)      Ethernet_MMC_BASE)
#define Ethernet_PTP                ((Ethernet_PTP_Type*)      Ethernet_PTP_BASE)
#define Ethernet_DMA                ((Ethernet_DMA_Type*)      Ethernet_DMA_BASE)
#define CRC                         ((CRC_Type*)               CRC_BASE)
#define CAN1                        ((CAN1_Type*)              CAN1_BASE)
#define CAN2                        ((CAN1_Type*)              CAN2_BASE)
#define FLASH                       ((FLASH_Type*)             FLASH_BASE)
#define EXTI                        ((EXTI_Type*)              EXTI_BASE)
#define LTDC                        ((LTDC_Type*)              LTDC_BASE)
#define SAI1                        ((SAI1_Type*)              SAI1_BASE)
#define SAI2                        ((SAI1_Type*)              SAI2_BASE)
#define DMA2D                       ((DMA2D_Type*)             DMA2D_BASE)
#define QUADSPI                     ((QUADSPI_Type*)           QUADSPI_BASE)
#define CEC                         ((CEC_Type*)               CEC_BASE)
#define SPDIF_RX                    ((SPDIF_RX_Type*)          SPDIF_RX_BASE)
#define SDMMC1                      ((SDMMC1_Type*)            SDMMC1_BASE)
#define LPTIM1                      ((LPTIM1_Type*)            LPTIM1_BASE)
#define I2C1                        ((I2C1_Type*)              I2C1_BASE)
#define I2C2                        ((I2C1_Type*)              I2C2_BASE)
#define I2C3                        ((I2C1_Type*)              I2C3_BASE)
#define I2C4                        ((I2C1_Type*)              I2C4_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define USART6                      ((USART6_Type*)            USART6_BASE)
#define USART1                      ((USART6_Type*)            USART1_BASE)
#define USART3                      ((USART6_Type*)            USART3_BASE)
#define USART2                      ((USART6_Type*)            USART2_BASE)
#define UART5                       ((USART6_Type*)            UART5_BASE)
#define UART4                       ((USART6_Type*)            UART4_BASE)
#define UART8                       ((USART6_Type*)            UART8_BASE)
#define UART7                       ((USART6_Type*)            UART7_BASE)
#define OTG_FS_GLOBAL               ((OTG_FS_GLOBAL_Type*)     OTG_FS_GLOBAL_BASE)
#define OTG_FS_HOST                 ((OTG_FS_HOST_Type*)       OTG_FS_HOST_BASE)
#define OTG_FS_DEVICE               ((OTG_FS_DEVICE_Type*)     OTG_FS_DEVICE_BASE)
#define OTG_FS_PWRCLK               ((OTG_FS_PWRCLK_Type*)     OTG_FS_PWRCLK_BASE)
#define OTG_HS_GLOBAL               ((OTG_HS_GLOBAL_Type*)     OTG_HS_GLOBAL_BASE)
#define OTG_HS_HOST                 ((OTG_HS_HOST_Type*)       OTG_HS_HOST_BASE)
#define OTG_HS_DEVICE               ((OTG_HS_DEVICE_Type*)     OTG_HS_DEVICE_BASE)
#define OTG_HS_PWRCLK               ((OTG_HS_PWRCLK_Type*)     OTG_HS_PWRCLK_BASE)
#define NVIC                        ((NVIC_Type*)              NVIC_BASE)
#define MPU                         ((MPU_Type*)               MPU_BASE)
#define STK                         ((STK_Type*)               STK_BASE)
#define NVIC_STIR                   ((NVIC_STIR_Type*)         NVIC_STIR_BASE)
#define FPU_CPACR                   ((FPU_CPACR_Type*)         FPU_CPACR_BASE)
#define SCB_ACTRL                   ((SCB_ACTRL_Type*)         SCB_ACTRL_BASE)
#define FPU                         ((FPU_Type*)               FPU_BASE)
#define SCB                         ((SCB_Type*)               SCB_BASE)
#define PF                          ((PF_Type*)                PF_BASE)
#define AC                          ((AC_Type*)                AC_BASE)


#ifdef __cplusplus
}
#endif

#endif /* STM32F7X6_H */
